{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=1","asin":"B086D4JNGM","page":1,"pages":93,"reviews":[{"id":"R36E6CRFVVROEG","title":"5.0 out of 5 stars SRS-XB33 vs Charge 4 (and also a few cheaper models)","author":"Allan R","rating":5,"content":"So I've been looking for my do-it-all BT speaker for a while, without spending too much, and of the ones I have owned, the Sony SRS-XB33 is the clear winner. Scroll down if you want to read the direct review of the Sony speaker. Previously, I've owned the Oontz Angle 3 Ultra, and briefly the Tribit Maxsound Plus, and JBL Charge 4. The Oontz speakers I still own, (two in paired stero), and they are a great value for the money, especially as a pair in stereo. That would be a clear winner for me for under $100 (for both!) However, as you might imagine, the small size and overall build prevents this from really producing deep, resonating bass, and the overall sound is a little thin without a ton of range. However, for a lot of people, these would be a perfectly acceptable choice for on-the-go music.The Tribit Maxsound was just not very good. I don't know how it seems to receive such high praise as an affordable, but great sounding speaker. It just isn't very good, very tinny, and the bass is really lacking. The Oontz speakers are a much better sound profile, and even slightly better bass. That model also cannot be paired in stereo (AFAIK). Not worth purchasing IMO.Now, for the XB33, and how it compared to a worthy competitor, the JBL Charge 4. The two speakers are of similar size (I didn't get exact measurements, but are more or less similar), and larger than I might have though. Perhaps because I was used to much smaller, cheaper BT speakers... These are definitely not as portable, at least for things like packing in luggage. Probably fine for road trips, but I would not want to pack this in my airplane luggage. In the box comes the speaker, a charging cord and some (terrible) instructions. The instructions now look like IKEA assembly instructions, just confusing pictures. The pairing process is pretty easy.SOUND: The sound quality of this speaker is outstanding. The overall sound profile is very rich, and it seems to carry farther than the volume would indicate. Meaning, some speakers are loud, but when you walk further away from it, the sound dissipates quickly. The Sony speaker's sound carries farther, I don't know why that is, or how that is quantified, other than when I walk away from it, the volume I hear decreases much more slowly than some other speakers I've had. Again, that's one of those possibly subjective things, but it's definitely true based on my experience. The bass is very robust and resonates well without simply thumping for the sake of being the deepest, hardest bass. The Charge 4 has deeper bass that hits harder, but this one just sounds better. It complements the mids and highs much better than the Charge 4. Speaking of which, the main issue I had with that speaker is the lack of clarity in the mid range. The profile was just too one-dimensional for me. Thumpy bass and decent highs, but there was no depth to the sound. I just could not get into the sound profile from that speaker. You'll see a common complaint about the Charge 4 is the mids, and it absolutely is true. A good speaker with very good bass, but no depth and dimension to it. Back to this speaker, the overall sound profile is the key point. The bass is very good, but the speaker isn't just a slapper. The mids and highs are all excellently rendered in a very three dimensional sound that works well together. There isn't one aspect of this speaker that is \"the best\", but as a total package, it's the best sound I've heard from speakers in and around this price point. Recently I purchased a second to pair in stereo, and I'm even more impressed now. One speaker by itself sounds so rich that you may not need a second, but you really can hear the difference in two of them. Hands down, this is the winner vs the Charge 4, and an excellent value in this price range. Oh, I forgot to mention the lights! They are customizeable in the app, and really add some additional flare to a great sounding speaker, for those big house parties.A few minor complaints I have. One is the volume of this speaker is surprisingly low. I have sensitive hearing, so I generally don't need extreme volume, but I find myself usually at about 80-90% volume outside, and maybe 70% inside, and that's just to listen at a decently loud, but comfortable volume. If you turn it all the way up, it's loud, but I could easily leave it turned up all the way without feeling like my ears would start bleeding immediately. Even my small Oontz speakers can get louder. Again, as a stereo pair, the overall volume is much louder, and that might be a solution, but as a solo speaker, some people might find the volume a bit low. Also, the battery life is pretty poor. Maybe I'm not used to these larger speakers, but I find myself charging the thing every few days, using it several hours a day. It is probably within spec, but it sure does seem like these need to be charged quite often. However, apart from that, this speaker is fantastic, and highly recommended.","timestamp":"Reviewed in the United States July 9, 2020","profile_id":"AE337MXGVFISTCBIEDVVWGUFS2IQ","is_verified":true,"helpful_count":123,"product_attributes":"Color: Blue"},{"id":"ROBFW4PP7372P","title":"5.0 out of 5 stars 2 Years Later…FAVORITE Portable Bluetooth Speaker!!","author":"IC","rating":5,"content":"This thing is a BEAST - you’re definitely paying for a not cheap speaker, but even two years after purchasing I’m blown away by the quality and consistency of the speaker. It is loud (when needed), bass is surprisingly strong, and the battery life is very impressive.When (or if?) this speaker ever dies I’ll be ordering the same one without hesitation!","timestamp":"Reviewed in the United States April 28, 2024","profile_id":"AEE3BWRTWIAESXDQKDRWNSLKF7SQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R362ZP81YD83WL","title":"5.0 out of 5 stars Performs as Expected","author":"Dave in VA","rating":5,"content":"Very good sound quality for a small portable speaker. Blue Tooth easily pairs with iPhone, Android, and Amazon Echo. Volume adjusts well in very small increments from very quiet to loud. I have not turned it to full volume yet, so I don't know how loud it can get or how much distortion there may be at full volume, but at reasonable levels, I did not detect any distortion. In a large room, 18'X30', with vaulted ceiling, it was still loud even at just a mid-range volume. I do not use the lighting system in it, I found that useless - I wanted a speaker, not a light show.I have been using the device for almost one month on a regular, almost daily, basis, paired to phones and to an Amazon Echo - far superior sound quality to any of those. Used it once on battery mode for several or more hours at a moderate volume without it going dead or noticing any other issues. When it is in battery mode, it turns off after awhile. Left connected to charging cable, it auto-connects with BT device, no manual switching needed.Took on a vacation, put it in the laptop backpack with two laptops, etc., it's light enough and small enough that weight and size is not an issue.So far I am satisfied with how well it performs. I have another portable speaker I bought about 5 years ago for a similar price that is much smaller. I thought that one was pretty good, this Sony blows that one away. This one also pairs more readily and the sound volume, unlike the last one, can be adjusted in small increments.","timestamp":"Reviewed in the United States November 6, 2021","profile_id":"AGTPLWFF7BBIYTFEPFINH6VCANJA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RT4S0NBB1JFT6","title":"4.0 out of 5 stars Wow! Very slept on!","author":"G-$","rating":4,"content":"Usually I'd buy personal audio from a manufacturer who specializes in speakers, like JBL, Beats by Dre or Sennheiser. But after purchasing some XB50AP earbuds, listening to some XB950N1 headphones, as well as my hearing my brother's SRS-XB31 Bluetooth speaker, I figured there was something to this XB (XTRA BASS) thing that Sony has. The SRS-XB33 is no exception! I bought this speaker to replace a JBL Flip 4 that I gave to my brother's girlfriend. Like all the XTRA BASS devices, the sound is crisp and clean with deep bass. I think It could have been louder. The party lights could have been better visually. And I wish the buttons on the control panel & the access panel in the back were illuminated for easier use. This speaker plays bigger than it looks. The party lights are... well I've seen better. But you'll get more playing time with them OFF. WHAT YOU SHOULD KNOW -- There's no AUX input. The speaker ships with the party lights & XTRA BASS ON. You can turn them OFF from the speaker, but there's very few audio or illumination settings otherwise. For those reasons, I recommend installing the Sony Music Center app on your Apple or Android device. It's very easy to use and offers multiple illumination settings, as well as additional audio settings; to include an equalizer. For additional party settings, also install Sony Fiestable. It automatically integrates with the Music Center app, but works indepently for other party functions. The speaker uses a USB Type C Charger, (in the packaging, no plug) and It has Bluetooth 5.0 connectivity. U could even connect via NFC. Overall, I'm very pleased with my purchase! It has pretty good tech & great sound.","timestamp":"Reviewed in the United States July 8, 2021","profile_id":"AHPEAYDD3GXEYQWAQT5VWMLSVMQA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R20RX5L3XO0XZW","title":"5.0 out of 5 stars Good Sound Decent Value. Minor Flaws.","author":"JMR","rating":5,"content":"I don't like the fact I can not pair this with my older ipads... At $100+ you would figure it can. I can pair it with newer Ipads and older androids with no problem. ( I use my older tech as Media players... TV, Music, Pics, etc.) I am a noob when it comes to high tech so my knowledge is limited but I can get around.I do like the sound. Its not over the top but it is enough to hear it from far. Bass is good as well. Not sure about the water proof part as I have not tested it in the water yet. I have had it out in the snow a few times and its been covered in snow but with the days here are at below freezing I cant consider this water yet since you can just blow of the snow from it... (Bought in Jan review in Feb)What I really like is the lights. My 7 Year old loves them as well. With covid around we have dance parties at our house ( we turn the lights off and dance to his favorite music) just the 3 of us... but we definitely enjoy the lights and sound quality.Battery is awesome. It'll last me about a week of 3 - 4 hours a day listening to it. Sometimes 2 weeks depending on use. I tells you once the battery is low which is pretty cool. It doesn't bring an ac adapter though. But you get an usb cord. Its a downside but if you own any tech you probably have a million laying around...I would definitely recommend it. It is a bit bulky (heavy and big) but I like its size.","timestamp":"Reviewed in the United States February 10, 2021","profile_id":"AEOSAPIV4Z4GO7I5K3W7A7MLESMQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R3ET3VKUL0TNHE","title":"5.0 out of 5 stars great for party's","author":"Geneva Brogdon","rating":5,"content":"worked great for our granduation party","timestamp":"Reviewed in the United States June 3, 2024","profile_id":"AGIPMQZGT35FKWXZBY5TCCQ4VJ4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2YDKCMXCTE39C","title":"5.0 out of 5 stars Bluetooth Speaker","author":"Michelle","rating":5,"content":"I LOVE this! It still works like new! I bought this awhile ago and it's amazing. We use at our house poolside, mostly. Or if we're having a party, a family cookout, etc. Highly recommended! Well worth the money!!","timestamp":"Reviewed in the United States February 1, 2024","profile_id":"AG3XQW6BEXJ7NJAFMJ6RWVINQ5FQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RUICOC8HVPD96","title":"5.0 out of 5 stars Solid Speaker for the Money","author":"averageavs","rating":5,"content":"Sound out of the box was a little muffled. Download the Sony app and adjust the settings, and it opens up the sound tremendously. The fact that this is IP67 made this a perfect option for around the beach or water. I took it on my kayak and I didn't worry about dropping it in the water or getting splashed, and battery life was more than enough for a 5 hour trip. I am sure there are better sounding speakers out there, but for the sub $100 range I cant imagine you will find much better then this for the price and the IP rating. The volume was loud enough for outdoor use, as everyone in my group could hear the music from at least 50 yards away.","timestamp":"Reviewed in the United States June 1, 2021","profile_id":"AH2YFSCHLRC6SD4GAWVVGJJ5BRWA","is_verified":true,"product_attributes":"Color: Red"},{"id":"R2U8WVANEQPJ1Q","title":"4.0 out of 5 stars I work outside and it gets the job done!","author":"TechnoNinja","rating":4,"content":"The media could not be loaded. It is not as loud as jbl speakers in its price range but it is loud enough to be heard several feet away outside. I work outside in urban community gardens and there is a lot of noises competing on being the loudest.My usual work day is shoveling stuff and so sound of several shovels scraping can be pretty loud. I keep the xb33 at 100% and the music is not drowned out by outdoor sounds. The speaker last about 8-10 hours at full volume on live mode or extra bass mode. Stamina mode can last 24 hours but it feels pointless to drop that much on a speaker and not use it's full potential.One of my coworkers has a jbl charge 5 but everyone prefers my xb33 despite it not being as loud. The xb33 makes up for its lack of loudness by having a much better balanced sound stage. You can hear every instrument and detail clearly and it doesn't get lost when you turn up the volume. The jbl speakers aeem to only focua on vocals,, mids, highs, and booming bass. The same songs can sound noticeably different on each speaker.Regarding music, this speaker is versatile. I use it to play trip hop, hip hop, drum & bass, jpop, rock, metal, soul, funk, dub, Latin jazz, orchestral, house and pop music and it all sounds great on it. The speaker doesn't have bias for any genre or elements but with the equalizer app you can get some customization. I have a video showing off the different songs I have playing on it.The range is fantastic and lives up to marketing. I had coworkers pair to my speaker and the walk offsite to do something else. Their phone would still be playing music through the speaker after they left but once they left the 66 feet range then it would disconnect.It lives up to being waterproof I used it in the rain and it worked perfectly fine. I spilt soda on it and ran water on it and it wasn't damaged at all either. I never worry about getting the speaker dirty because I know I can rinse the dirt off.I bought mine used for $60 and was surprised by how new it looks and perform. Don't be afraid of buying these used if you wanna save some money.","timestamp":"Reviewed in the United States May 20, 2022","profile_id":"AERYKX4I4LBC775EW7DB6WLNRSMQ","is_verified":true,"helpful_count":19,"product_attributes":"Color: Black"},{"id":"REH36D64QXBG5","title":"4.0 out of 5 stars Great sound for the shower or a tiny room, annoying song control buttons, 4 hour battery life","author":"Ariel Fisher","rating":4,"content":"ITEM REVIEWED: SONY SRSXB33I like pop and rock music and I am an audiophile who buys high end speakers, amps, and subwoofers.This speaker sounds AWESOME in a very small space, such as an enclosed shower. Even all by itself, just a single channel I enjoy listening to it almost as much as a much larger powerful system.Unfortunate drawbacks though. By far the worst drawback is the terribly annoying song control buttonsThere SHOULD be a separate button for PAUSE, NEXT SONG, and GO BACK A SONG. Instead all 3 are the same button. Press once to pause, twice fast to go forward, thrice fast to go back. Insanely annoying.Very often you try to SKIP THE SONG and instead pause and unpause. Drawback #2: Only runs a bit over 4 hours at max volume, and WORSE YET announces audibly PLEASE RECHARGE with at least an hour left.Drawback #3: Only powerful enough for a very small space such as an enclosed shower. You will need way more than ONE of these for larger rooms. Worth it if all you need is a shower speaker and don't mind the annoying song controls. Nice to be able to answer phone calls in the shower:).Took off a full star due to the insane lack of proper song control buttons.Update 3/4/22:Comparison to the OONTZ ANGLE 3 ULTRA (2 tone BLUE COLOR):The Sony has a bit more bass feel to it, but bear in mind that the SONY is about 4 times the size and weight of the OONTZ and more than double the price. Unless you care about the gimmicky lights (yes they are cool) in the SONY, the OONTZ is far superior simply because of the song control buttons which are 3 separate buttons on the OONTZ, rather than one button and a song and dance about how many times to press it on the SONY. The OONTZ also pairs more reliably and easily to the bluetooth host than does the SONY. Overall max volume and music quality is almost identical on the 2 except the bass is fuller on the SONY due to its greater heft. Battery life is FAR SUPERIOR on the OONTZ - lasting at least 12 hours at MAX vs. 4 on the SONY.","timestamp":"Reviewed in the United States February 18, 2022","profile_id":"AGAIJRXU7OM7GW45NHJPLLVW2XPA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Blue"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:26","page":1,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=1","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=2","asin":"B086D4JNGM","page":2,"pages":93,"reviews":[{"id":"R1BJSSM1QPM6C7","title":"3.0 out of 5 stars Wireless only","author":"david black","rating":3,"content":"This unit does not have the port for a wire to input music. Bluetooth ONLY.Other units have the ability to plug into a phone. This unit does not.","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AFQYXLJEKRZGSW6OARKJI2ZQ5LIQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3P4QT9D0W8PQQ","title":"3.0 out of 5 stars Not What I Anticipated","author":"Charles Chaffee","rating":3,"content":"When I bought this I perhaps didn’t do enough research. I bought it for the purpose of the cross country backpacking trip I am considering undertaking. That being said, there’s nothing particularly horrible about the speaker per se; but for my purpose it seems highly impractical.First, while the lights (as pictured above) and corresponding apps you can download are neat little gimmicks when sitting in your living room, etc. they are not something that I feel are a true selling point. I am most concerned with sound quality and battery capacity. Secondly, it seems quite a bit larger than seemingly necessary for the sound it produces… I also have a JBL Charge 4 that I’ve had for going on 2 years now. It is not only smaller but packs a bigger “punch” (and by “punch” I am not meaning to say the JBL has better sound quality; just that it hits harder from a smaller unit).As far as sound quality goes, this Sony XB33 (maybe I should have spent $100 more on the 43) does nothing to really blow me away. It doesn’t sound bad whatsoever, and the clarity is really good. The sound seems to carry better than the JBL, and the clarity as far as distinguishing between different aspects of the song is definitely better. But it does nothing to blow me away. Again: it’s a $149 (or whatever it costed) speaker and it is far worth that as far as sound quality goes.The battery life seems pretty good as well, though not so sure it surpasses the Charge 4… I’m sure there are settings that can be adjusted (no lights, bass boost off, etc) that will prolong that. I have not had it long enough to experiment with that yet however.One neat feature I found was the little three channel (Low, Mid, High) equalizer that can be found in the app. It is an ice touch.One thing I don’t like is the completely un-rugged feel of this thing. No doubt it’s fine for the house and backyard, deck, etc… but I won’t be taking it on a 1000 mile backpacking trip.Reading over everything I wrote here I realize it seems as though I’m dissing this thing. That was not the intention. It sounds good. It is a great price. It has some nice (albeit I feel unnecessary) features. It seems a bit bulky and doesn’t feel quite rugged enough for my personal taste. Otherwise nothing else I can point out.If you want a nice Bluetooth speaker for your house, room, office—whatever—this seems like a good choice","timestamp":"Reviewed in the United States September 14, 2021","profile_id":"AFA6MXD4SAQA7VDAQ2CNBDWTZGGA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Taupe"},{"id":"RDP10RUDDV66J","title":"3.0 out of 5 stars Brand New My foot","author":"Confused and Frustrated","rating":3,"content":"Was delivered to me damaged speaker barely works","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AGZIX3MRHX74GE2PTYWKNIEWPXCQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"ROP40ONFLIY5M","title":"4.0 out of 5 stars Excellent sound, easy pairing with buttons, but no aux input","author":"Jason Dunn","rating":4,"content":"I'm pretty picky about my Bluetooth speakers, and normally go for Anker products, but when I saw The Wirecutter rate the Sony SRS-XB33 speaker so highly I figured I'd give it a try.Long story short, I was so impressed with the first one I bought, I purchased a second one so I could put them in \"party mode\" and use two at the same time. The sound is excellent: full, rich, and a decent amount of bass for something this small. The software app is pretty rough, and it has a frustrating limitation of not remembering the speaker pairing. It does allow you to control the lights on the speakers, which is a nice touch. I discovered that using the buttons on the back are a much easier way of creating the speaker pairing, so I do that each time - I wish it would just remember the setup like my older, cheaper VAVA speakers do.My one knock against this product is the lack of an AUX input. There are situations where having an AUX input is really handy - like when I want to take the audio from my Nintendo Switch and put it out to the speakers. I got around that by using a Bluetooth audio transmitter from the Switch, but the audio levels are lower so it's not ideal. This would be a 5-star product if it has an AUX input.Overall this is a great product, and I love that Sony offers this speaker in bold, beautiful colours - I went with the red, and it's awesome looking!","timestamp":"Reviewed in the United States September 9, 2020","profile_id":"AG4TNMGWFXUNI5TZANSMQHPYOXEA","is_verified":true,"helpful_count":21,"product_attributes":"Color: Red"},{"id":"RU9MWWHIOY9UT","title":"3.0 out of 5 stars Sony vs JBL - Not terrible but Not great","author":"Amazon Customer","rating":3,"content":"I purchased this speaker in December of ‘21 and have genuinely been waiting to give it a review to see how I actually like it. Unfortunately, I’m less than impressed with this speaker. The speaker does have a decent sound - as in the speaker works. However, I don’t feel like I can figure out the right sound settings. It’s either too much bass and not enough voice or too much voice and no bass. This speaker also has a very forward sound. If you are standing to the side or back of the speaker you can hardly hear the sound. I used to have a JBL and switched to Sony. The JBL has a very 360 sound where you can set the speaker anywhere and hear it everywhere. With the Sony I’m constantly having to move the speaker with me so I can hear the sound. The Sony Music Center app you use to adjust the effects is also kind of odd and pointless. The speaker itself doesn’t have a great sound like the JBL does so it’s hard to pinpoint what settings you need to make it sound better. There’s also a ‘Live’ button on the speaker itself that Sony touts should fill a room more with sound and be a more ‘live concert’ feel. I unfortunately don’t hear much difference at all between Live on and Live off. Overall, I should have stuck with my gut and JBL instead of switching. Again, in my opinion? not a terrible speaker but also not great.","timestamp":"Reviewed in the United States October 3, 2022","profile_id":"AHOKBZV2EYHME4H436RMEI2S7DKA","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"RYIMIDOFSQDZ9","title":"5.0 out of 5 stars Long charge time and still sounds great","author":"Timothy","rating":5,"content":"At the price, I couldn’t be more happy with this bluetooth speaker. Almost never runs out of juice and still sounds amazing even 2 years later.","timestamp":"Reviewed in the United States March 19, 2024","profile_id":"AETRSQLHHMNN5ISHAOROL4W4AKMQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2FIG0DLZC80HY","title":"3.0 out of 5 stars Sony is a good brand, but don't believe the hype about this XB33 speaker","author":"Dennis James","rating":3,"content":"The speaker is a large size, but it does not come with big sound. It is okay for indoor use, but not so great outdoors such as around the pool or at the beach. I was a little disappointed with the sound quality especially at this price point. I've heard better sound on smaller more portable speakers.","timestamp":"Reviewed in the United States April 10, 2024","profile_id":"AEIZA3IFDABTH3JLGNMN5JLZF4KQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R189XI8M77ZQQB","title":"2.0 out of 5 stars it does the job, but there are way better speakers out there.","author":"sophia","rating":2,"content":"(I got the sony srs-xb33) It’s a fine speaker, if you don’t mind or really note differences in sound quality, but even then you could find other speaker at a similar price that sounds better and is louder- loll. I saw many comments saying the volume is relatively low and now that I have it and used it, I understand what they meant and it’s true. From the first time I used it like two days ago I was like oh wow, it is low… If you’re just using it to listen to some music while you’re home it’s definitely loud enough. But again, for the size and price you can find something better. It produces a low volume even when it’s loud. I wanted to test this out so I compared it to another speaker I have (same song and approx same volume). The other speaker was noticeably louder. I even raised the volume more on the sony, and STILL my other speaker was louder. Not only that but the other speaker had amazing sound quality. Before doing this comparison today to test the “loudness,” I already noted that the sound quality wasn’t all that great. Even if you mess with the EQ the sony music center app, it doesn’t help all that much. The sound just isn’t crisp and rich. It was easy to connect, and the bluetooth worked out nicely. The range was good too, it still worked fine as I left my phone in one spot of the house and took the speaker with me in other rooms. If you want a speaker just to have around the house, it’ll be fine, it’s not horrible but honestly, it’s not that great of a speaker. I’d recommend looking for another one. Also, this may be a bit random but I really didn’t like how tiny the cable is, that was the first thing I didn’t like when I opened it for the first time lol. It’s like 21 inches. A small cable is fine for other products but it’s a bit inconvenient to have such a small cable for the portable speaker. I only charged it when I got it as instructed on the pamphlet that shows you how to connect to the speaker. The battery is still high and I’ve used it a bit in the past two days. I feel like you’ll run into the same things if you get the srs-xb43, it’s just bigger really. I saw reviews on the xb43 that mentioned the things I’m experiencing on the xb33.","timestamp":"Reviewed in the United States January 5, 2022","profile_id":"AHQZCP4QY7KLE7XYPPZRYSMAEU7A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RNVS8LOTKOF2V","title":"5.0 out of 5 stars Audio","author":"Eduardo","rating":5,"content":"Excelente producto. Excelente atención y cumplimiento.","timestamp":"Reviewed in the United States April 11, 2024","profile_id":"AHJBJWPXNJODJQB37E5CM3J5HTVQ","is_verified":true,"product_attributes":"Color: Taupe"},{"id":"R2867PI1BTARLU","title":"5.0 out of 5 stars The BEST Bluetooth speaker!","author":"Jill Reese","rating":5,"content":"This is the BEST Bluetooth speaker FOR small groups and back patio gatherings. It is pretty loud in a bedroom or bathroom.Bought it for golfing and swimming pool gatherings of 6 people or less. I use it when I play golf. It has rubber bottoms and sits against the windshield of the golfcart perfectly. The sound is balanced, with heavy bass. This is my second Sony speaker of this size. My first sony speaker was stolen! I loved it so much that I bought it again. It has excellent sound balance & terrific sound quality!! The bass on this is the best I have heard ever for this size speaker! I keep my iPhone in my pocket when golfing and control the volume/songs playing through the speaker from the putting green. So the Bluetooth range is reliable. Great speaker for GOLFING!!","timestamp":"Reviewed in the United States August 9, 2022","profile_id":"AGNYHWE7U77GDSXCBG3KRM7UYB5A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:27","page":2,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=2","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=3","asin":"B086D4JNGM","page":3,"pages":93,"reviews":[{"id":"RQLRYT3K8S3ZO","title":"4.0 out of 5 stars Decent mid-range speaker","author":"Paul3","rating":4,"content":"I bought this specifically to annoy a person with the music i listen to. I ddint want to drop a ton of cash on a speaker, and this guy was a \"renewed item\" so i got it priced reasonably. Its not the loudest speaker, but the sound is pretty decent. Bass is pretty good. Itll vibrate at higher volumes, but so will most speakers. The lights are annoying, but they can be turned off. The best part is its waterproof. I wanted to test it so i submerged it in a pool while listenong to some tunes. Low and behold, sucker kept working as advertised. I call that a bonus. Im not a sound snob that needs to have my bass shaking my bones, so for what i paid i think this is a good quality product. Id buy it again.","timestamp":"Reviewed in the United States August 16, 2021","profile_id":"AF3KK6JYBVGTFZMQW43VAS7RTNUA","is_verified":true,"product_attributes":"Color: Black"},{"id":"RC5MK1T45R8ZA","title":"5.0 out of 5 stars Portable","author":"michael kubiak","rating":5,"content":"Good sound. Easy to pair and transport. Great for my office. Battery lasts a long time. Very impressive.","timestamp":"Reviewed in the United States February 5, 2024","profile_id":"AFHZEULMHXSHQRO4FMX5VBGTCVEQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RVV9CDHDQS0EE","title":"5.0 out of 5 stars Perfect size","author":"Lisa Peterson","rating":5,"content":"Great sound, portable","timestamp":"Reviewed in the United States March 15, 2024","profile_id":"AH6MH7UTOR6YQN23GQGM2YC5WLMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3VLEJMH8AHE3","title":"3.0 out of 5 stars No LDAC in stereo mode. Not advertised and a big negative.","author":"grinder","rating":3,"content":"I recently purchased two SRS-XB33 speakers. I researched LDAC vs aptX codecs and given the LDAC high bandwidth and the overall good reviews of this speaker, thought this was the best choice.After receiving the speakers I paired the first one with my phone and saw in both the phone settings (including the developer options) and the Sony Music Center app, that LDAC/HD audio was being used. However, when I stereo paired the second speaker, LDAC went dead and the connection protocol switched to SBC (the base codec for Bluetooth connectivity). I checked all the settings and all the HD options on the phone were greyed out. I searched the web and Sony literature for answers. Why advertise LDAC and its increased bandwidth if it can only be used on a mono speaker? Also, Sony's Bluetooth headphones maintain stereo sound while in LDAC, so what's the difference? I never did find out. I was finally able to chat with a Sony rep and they confirmed that LDAC is not available in stereo mode. Makes no sense to me that it is what it is.If you're looking for great stereo sound from two of these, forget it. Instead, you need to look for a pair that has aptX HD, LL or adaptive capabilities.","timestamp":"Reviewed in the United States May 27, 2022","profile_id":"AGPKMQBQTEEASFQ47DWKL2YMFFUQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R60AHO84SP13X","title":"5.0 out of 5 stars THE SOUND QUALITY IS AMAZING....","author":"Henry Lewis","rating":5,"content":"This is one awesome sounding Portable Bluetooth Speaker,SONY SRS-XB33 EXTRA BASS You can Actually feel the bass coming from this Bluetooth speaker It sounds Simply Amazing I am real happy with it The lights are so cool with every beat from the music that's playing The Lights change different colors with each instrument that is played and the side Radiator Speakers truly pump out the sound You can put your hand near them and feel it WOW..I have nothing bad to say about this Portable Bluetooth speaker From Sony.I will diffently buy another one,It is solid and has a little weight to it,The more I listen to this truly amazing SONY SRS-XB33 EXTRA BASS Bluetooth Speaker..It has plenty of power,Just downloaded the Song Music App To shut off the Illuminated Lights...The lights flash to the sound of the music that comes out of these speakers..I recommend Buying this one Hearing is believing..","timestamp":"Reviewed in the United States February 7, 2022","profile_id":"AHZ4SYOZFZNDDFUEH5GRNQMANOUA","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R3BBOHGVNA4BWA","title":"5.0 out of 5 stars Most powerful speaker out there","author":"ruben","rating":5,"content":"I had so many speakers, but this one is the best one I ever had","timestamp":"Reviewed in the United States February 4, 2024","profile_id":"AGTWP4ZA37BDBWY3ADEWMIHABJAQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R33XMXWM6H6252","title":"5.0 out of 5 stars GREAT QUALITY LOVE IT","author":"Sunny morals","rating":5,"content":"for the price I was expecting it to be all lies. This speaker is amazing I have a 400 dollar speaker in my home that only somewhat out does this bad boy. I bought this one for my best friend as bday gift and it lives up to all it says it does along side having multiple speaker connection so if you have more than one they can all link for surround sound throughout a party or just the house while cleaning. Battery life is also great she does dishes by it all the time and its still good to go so its water resistants also lived up to the test love it thank you! The sound quality is amazing to whoever these people are that are saying it isn't idk if they got a defective one or what but it is loud and super bass. Ps bluetooth range is far not far far but far enough to get around without annoying cut offs.","timestamp":"Reviewed in the United States June 29, 2021","profile_id":"AEA5P4UXS3WY5CB6YED4BIP6BJFQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3QBAA2IO6MLAK","title":"4.0 out of 5 stars Very good BT speaker for the price point","author":"Stephen","rating":4,"content":"This is our first wireless speaker. So I read reviews, asked friends who have good audio equipment, and listened to a few units before making this purchase. This works very well in our small home. The speaker maintains a connection throughout any room in the house and to our hot tub. The water resistance gives me peace of mind when used near the hot tub. Real world battery life is sufficient but not what Sony leads one to hope for. The speaker is loud enough to overcome background noise in the house to fill the larger rooms with clear audio. The distracting lights are easy to turn off.","timestamp":"Reviewed in the United States April 28, 2022","profile_id":"AFPRMXC7LWZS64DD23GLYIM2TVMQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2Q7QXG503M86Y","title":"4.0 out of 5 stars Pretty good speaker for the price","author":"Dustin","rating":4,"content":"I ordered the product refurbished/used, the product was a little hairy( I like my speakers bald). Jokes aside, the condition of my item was in pretty great condition besides it growing a little hair. My product was like new and it’s sound quality it’s reasonably good, no damage to product at all and it it comes well packaged. I was overall satisfied with my purchase","timestamp":"Reviewed in the United States April 3, 2023","profile_id":"AE6WWDMZIMX47PI5KPGIMZPHGYJA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R174MJAXG7V9MO","title":"3.0 out of 5 stars A note to Hip Hop/Trap/Rap Enthusiasts","author":"B. Simone K","rating":3,"content":"I'm not sure if this will make sense but this speaker \"sounds\" like bass but does not \"feel\" like bass. The video reviews I saw for this speaker only play dub step/pop music or rock with some \"bass\" melodies. I took a chance because I liked the look/style of the speaker. I also am a sucker for flashing lights that dance to the music which this does. When I saw the product labeled as \"extra bass\" I was wary, but I wanted to try anyway. It does boast a full sound (a nice live sound). But when you turn it up full volume on your phone/device and on the speaker, the speaker starts to sound garbled and static-y. When I see a product labeled extra bass I want to be embrassed to play it in my apartment complex. I want my floors to shake. I want someone knocking on my door. I recommend if you want that experience go for the Harmon/Kardon speaker as it seems to be better designed for this. The main reason I kept it was the portability and size of it. I think it does provide good sound, but it is no Beats or JBL.","timestamp":"Reviewed in the United States March 4, 2022","profile_id":"AFT7T5ZMSM3BIXDT34X4Z457R32A","is_verified":true,"product_attributes":"Color: Taupe"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:28","page":3,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=3","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=4","asin":"B086D4JNGM","page":4,"pages":93,"reviews":[{"id":"R3UUVUUA0PYYSG","title":"5.0 out of 5 stars My choice over JBL Charge 4","author":"Eric Baker","rating":5,"content":"The Sony XB-33 is an excellent portable bluetooth speaker! It definitely has better bass than it's JBL counterpart (I did a side by side comparison then returned the JBL). Aside from the bass I really like the somewhat triangular shape; it's easy to grab and carry around. It connects quickly and has fantastic range from my cell phone. The battery life depends on how loud you play it, but will last plenty long enough for a day's worth of activities. Made of high quality parts and a better app the only downside I've found is that you have to download a second app to control the lights, but they can be manually turned off on the back of the unit. A small inconvienance for the better sound it produces. I haven't checked the waterproof claims, but you really can't go wrong with this speaker!","timestamp":"Reviewed in the United States June 18, 2021","profile_id":"AECHW4KNJ2DNMX6HWGTFUKEXIHFQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R2NVYWB81P2372","title":"3.0 out of 5 stars If you’re looking for a loud speaker…this isn’t the right one for you.","author":"Kyla","rating":3,"content":"I love the look of this speaker and how easily it connects to my phone. The battery life is great too. My only complaint is the sound. It’s not loud enough for its size. This speaker is big and yet the sound is an issue. I feel a bit deceived because the description talks about how great the bass is and the sound. Yet I haven’t experienced how great either of these things is. I mostly use my speaker at work in a nosy kitchen with lots of people and talking happening. This speaker is great in small spaces with not a lot going on. In the environment, I have it in you can’t hear the music unless you’re right next to it and I have the volume all the way up. I’m disappointed because I thought I was finally going to find a speaker that could be loud enough for everyone in the kitchen to hear and enjoy. Don’t get this if you need a loud speaker for parties or busy environments.","timestamp":"Reviewed in the United States September 23, 2022","profile_id":"AGVFE4GJTTVJCPVOHVO3ICRXQVKQ","is_verified":true,"product_attributes":"Color: Red"},{"id":"R322V5K86XU66Q","title":"5.0 out of 5 stars Just Amazing Sound for Solo to Quartet Jazz & Classical","author":"Larry Rosenstrauch","rating":5,"content":"It’s rare that I like a product so well to tell the world it’s great. The sound, including a rich but not overpowering bass, are top notch for listening on the patio, den, or kitchen. I listen to lots of classical guitar and duos/trios of classical and jazz. Excellent reproduction when a few feet away. Good ambient music for a party. The built in speakerphone for iPhone or Android was an unexpected plus. Bluetooth works perfectly and has a nice voice prompt saying “Bluetooth connected” and similar voice for the battery level including with a “please charge” prompt. Friends who have heard this have bought one. Sony…keep making such good products. It’s refreshing to find one so well done.","timestamp":"Reviewed in the United States March 21, 2022","profile_id":"AFIMNAELG6DYWGY4OVLLMKI54NOA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3M8PXTBKWR8J1","title":"4.0 out of 5 stars Good sound and easy to use.","author":"Hop Pocket","rating":4,"content":"I had hoped to get another brand, but they were out of stock. This one's been a pleasant surprise. The extra bass gives a great sound -- we used it for background music in a good sized hotel party room and it sounded like the music was piped in. It's not light, but for this sound it has to have heft. It is compact -- fits perfectly in a growler cooler if you have an extra. Good value for the bucks.","timestamp":"Reviewed in the United States July 6, 2022","profile_id":"AFQG6E65SEOFOJB2NDAXO3RDTSWA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R16Y6JZ01DNIZO","title":"5.0 out of 5 stars Quality","author":"Rlw","rating":5,"content":"Ok I haven't used this yet exept to check it out and so far so good it sounds great lights are a good extra but not really needed on this it's alil heavy but it's durable go sony nice job","timestamp":"Reviewed in the United States September 9, 2023","profile_id":"AGX6IJHP7F2YKMEKDWARSMZGB5UQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R1Y49DT7JL3FYM","title":"5.0 out of 5 stars Important to consider","author":"Frederick H Walsh","rating":5,"content":"The blue tooth speaker function squite well. Can't complain about that. But it seem to me that the designer might have forgotten something rather important. Aesthetics are always a concern and the speaker is lovely, but functionality should be considered, too. It seems to be a trend these days for monochromatic designs, and inevitably the color is black. But why are the control buttons all black too? Maybe a blind person whose sense of touch may have become acute can deal with that, but the sighted among us, unless we're in the sunshine on a cloudless day, the black on black control panel is a bit frustrating at times.","timestamp":"Reviewed in the United States March 18, 2022","profile_id":"AE2NSML2IKHACEQ32IKEJZPRUZRA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1K77BUFEH6C9H","title":"4.0 out of 5 stars Like brand new...","author":"James M.","rating":4,"content":"Product was described as \"used: like new\" and that's exactly what was delivered. Original box, original packaging, all accessories and manuals. If I didn't know it was used, I would not know it was used...","timestamp":"Reviewed in the United States April 11, 2023","profile_id":"AEMIJ5N5PTYJST5AJASK5PWQTK7A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R3LGB70H3XH511","title":"5.0 out of 5 stars I love this speaker.","author":"Dave","rating":5,"content":"Before, I had to lug my wired computer speakers out to the patio to play music from my ipod or iphone. Now, I just take this wherever and it works.I love the sound. I do not need the flashing lights (but they're kinda cool).This is not a professional review, I haven't evaluated this against other competitive alternatives, but overall, it is easy to use and sounds great.","timestamp":"Reviewed in the United States March 20, 2023","profile_id":"AFNH2PUQTAST6AKET7LCW74SJSUA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Red"},{"id":"R1WH4TT1I71A3K","title":"5.0 out of 5 stars Sounds better than my JBL speakers.","author":"Blueman","rating":5,"content":"After using this speaker and comparing it to my JBL Extreme 2 and Charge 3 I’m finding the sound superior in every way. At first I didn’t like the speaker but have since changed my opinion.My JBL speakers turn off automatically when I listen as I’m going to sleep. This speaker claims to do that but alas it stays on all night using ip the battery while I sleep. Oh well, I’ll just use my JBL’s for sleep time. I can highly recommend this product after all. Oh, I especially like that it charges with generic usb C cable not proprietary like JBL Extreme 2.","timestamp":"Reviewed in the United States April 9, 2022","profile_id":"AFAXSX6OMXACB7YCFXZ4Z5BXPKAQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R34TSNAEXHOLW8","title":"4.0 out of 5 stars Great base response wish it was louder","author":"Jon","rating":4,"content":"I like my purchase, I bought it to replace a speaker I was using at work. I think the sound is really good and the base is better than my old speaker. It is great for my work space but if I was going to buy a speaker for home or outdoor use I think I would find one that is louder. So I would buy again if I needed to replace my work speaker. The battery life is great. I love that it has type C charging. I have had way to many issues with Micro USB. The price was really good and I feel I got my moneys worth for my use case.","timestamp":"Reviewed in the United States June 18, 2021","profile_id":"AHNGQQKPKWFDOVF76L25RJCFJEOQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:30","page":4,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=4","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=5","asin":"B086D4JNGM","page":5,"pages":93,"reviews":[{"id":"RB91MGYBSZOFN","title":"4.0 out of 5 stars Good speaker","author":"Stacy","rating":4,"content":"I’ve always had Bose speakers in the past. Was hesitant to purchase this but it actually ranked fairly close in comparison. Instructions have you download 2 apps to use it to its full capability.Note that this speaker works best with Android, not iPhone. Android allows tons of equalizer adjustments for sound quality. iPhone has no equalizer whatsoever. Not in the phone or apps. Instead it offers you DJ effects.So really, I guess I’m faulting the iPhone compatibility with this speaker. Not the speaker itself.In summary, speaker sounds great. Good bass. Sides of speaker vibrate like a sub. I’m pleased with quality and fair price.","timestamp":"Reviewed in the United States August 30, 2021","profile_id":"AFECNX53L5PU573HY57L7CKZC2UQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R2LH2PMI81WBZX","title":"3.0 out of 5 stars Low Volume Listening Good; Everything Else is Whatever","author":"Po","rating":3,"content":"Overall nice build quality, decent looking design, but its just okay. Only good for a specific need/person.Pros:-Build quality is solid, not rugged, but will serve most home users and be okay at a park or beach- Low volume listening is good; if you will be listening to this at night or with close neighbors, the sound production at lower volumes is enjoyable-Bass was semi-decent, especially at low volumes it stood outCons:- Lights don't sync up with music that great and add a tacky effect to the whole package (there is a button to turn it off thankfully).- Sound was very narrow/directional; speaker only sounds good pointed directly at you- Overwhelming boosted vocals and underwhelming boosted bass at higher volumesI can really only suggest this to those who will be mainly listening in a home or at a desk. Also, if low volume listening is a priority this is probably the best in class for that.Maybe if you have a bedroom/office combo and listen to it on low volumes primarily, it would be a fit for you, otherwise look elsewhere.I compared this side-by-side against the LG PL7 and Anker Soundcore motion+ and this came 2nd out of the three for me (#1 is Anker for the price and overall sound)","timestamp":"Reviewed in the United States December 29, 2020","profile_id":"AGMVWZXWYAXHR4NI5FSFAUHFM6XA","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R1RFBLEE2BMDWG","title":"5.0 out of 5 stars Good Speaker - Don’t have high expectations","author":"dave_p","rating":5,"content":"Ok so I m writing after using for 1 year or so Sony XB33 soeaker. We cannot compare this with BookSelf speaker, Thats not correct compare.But if paired with another one . it does sound amazing. I got 2 for $100 or so pulled the trigger , now this is go to speaker we always use it in my backyard party.Sound is reasonably loud outdoors but has good base which I like most.JBL imo sound more louder at high freq but this one sound just right","timestamp":"Reviewed in the United States August 8, 2022","profile_id":"AFEXPBLPD2M6ZRGR4ZZ64WTRNC2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R28DQUKXLUXDA4","title":"3.0 out of 5 stars Nice small speaker, so-so sound quality","author":"M. Booth","rating":3,"content":"I've been using a Sony X55 for 7 years and it finally gave up the ghost. The XB33 was the perfect size to replace it, however the sound quality was below par.The X55 had a wonderfully balanced sound with the woofer and two tweeters giving tight bass and crisp mids and highs. The xb33 with just two woofers has almost no mids and the highs are muddy at best. The xb33 DOES play much LOUDER then the x55, so for parties this would be the better choice. However, my needs are for low to mid volume while camping, so I tried the xb43.The xb43, with two woofers and two tweeters has the balanced sound I wanted. The size sucks: The xb43 looks and feels much larger and is MUCH HEAVIER. (nothing is free)I returned the xb33 and kept the xb43.","timestamp":"Reviewed in the United States July 31, 2022","profile_id":"AESYCQNZV7C7X5OCRZSEI3AZIYGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Blue"},{"id":"R1D0IK8DGIGI3L","title":"4.0 out of 5 stars Good speaker but not great","author":"Freddy","rating":4,"content":"ProsGood battery life lasts a few days for outdoor workouts and leisure listening - i just let it die and use a portable charger to fill up until i can plug it into an outletSound is good maybe could have more bass (i don't use the live feature and stamina mode sucks - too quiet)Lights are cool - at first I thought they were dorky but they're fun with the right music (not great for podcasts)usb C charging is niceConsoriginal packaging could be better - it felt cheap just in a plastic bag in a box - no flap reveal or anything specialnfc bluetooth tap to connect doesn't work with iPhone (.....yet)the back flap (where you charge, check battery life, etc.) is a little hard to open, i almost never get it on the first try","timestamp":"Reviewed in the United States August 18, 2020","profile_id":"AFVZB66DUPCAE5LVR2HJM7HVX6TA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Blue"},{"id":"RDUOKVW3R4TT4","title":"5.0 out of 5 stars A perfect portable","author":"Eric C. Helmer","rating":5,"content":"The Sony SRS-XB33 lives up to the hype and then some. In fact I can’t find a thing to criticize. As a matter of fact I’m about to purchase another right now. And I’d be lying if I said I’m going to gift it. Nope. It’s for me, me, me. A number of similar Sony BT portables have the ability to pair with another for stereophonic listening bliss. This is a pleasure I’m certain you’ll want to experience for yourselves. Treat yourself!","timestamp":"Reviewed in the United States September 30, 2022","profile_id":"AHZKCPQCSE4TAZSUBWT6UAEWV7GQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R24Z7DXHWIL16V","title":"4.0 out of 5 stars Good speaker but I wished it got a little louder","author":"John Nguyen","rating":4,"content":"This speaker was easy to pair and set up. The app is easy to learn and navigate. The speaker feels well made and looks good. I bought it to give my backyard outdoor TV some better sound and it is great for that. My kids also like to stream music while splashing around in the pool also. They don't throw the speaker in the pool but it's suppose to be water proof. I don't use the lighting effects much but it would be a great party attention getter with a multiple speaker set up. The sound is good, but not amazing. I paid $129 for it and I feel it sounds great for that price point. My only gripe is that I wish it got a little louder....maybe 15-20% louder for my outdoor purposes. It's plenty loud for indoor use.","timestamp":"Reviewed in the United States July 14, 2020","profile_id":"AE6XLMRGB2ZLNXZ2JOWREGG2SVRQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: Blue"},{"id":"R2PGKDAKP3QFSX","title":"5.0 out of 5 stars great little speaker","author":"Bobby Erwin","rating":5,"content":"So far, very pleased with this speaker. The sound is great. Overall, Sony tends to weight the sound of their speakers towards bass; but the Sony app allows me to tweak the EQ to my liking right from my phone.I've used it for podcasts, for music, so far only around the house. It's more than adequate to fill a room with sound, so it's definitely meeting my needs.I play guitar, and I've used it as the 'band' backing track for practice sessions. Perfect for that. It's plenty loud to keep up with my amp at 'home' volumes. Again, it's bass / mid heavy, so I had to goose the treble quite a bit for the symbols to cut enough over the mids from my amp. A more balanced sound is better for that application.","timestamp":"Reviewed in the United States October 6, 2020","profile_id":"AFWKO2KUWJVWLUO34FIRXBPWPO6A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1X77RPDRDJYAQ","title":"3.0 out of 5 stars Very good for the 3 1/2 years it lasted","author":"calitrav","rating":3,"content":"Updated review: it died after 3 years and 7 months which I’m not too happy about because I thought I could get 5 years out of it. But I used it almost every day and frequently took it in the car with me where it rolled around in the seat sometime but it never really took a bad beating. Over the last few months I noticed a “buzz” from the bass on some songs. If it were possible to easily service this Sony speaker then it would be a 4 or even a 5 star product, but since no one seems to know how to fix it I’m downgrading to 3 stars for now.Previous review:I’ve had mine for about 18 months and the battery drains and dies a lot faster than it used to.I wouldn’t mind much if it were easy to replace the battery since it’s a solid speaker otherwise:I still enjoy using it just about every day.","timestamp":"Reviewed in the United States January 5, 2022","profile_id":"AFSR43AFFQIB6TBAP6GFLDFPJ5DQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R2P9OCCPG3IYZD","title":"4.0 out of 5 stars Sounds good but not as loud as a jbl that you can get for the same price","author":"nicholas","rating":4,"content":"The sound quality is pretty good I think just as good as my Hardon karmon 5 but no where near as loud and they say it lasts 24 hour of play time but I have been only able to get about 6 hours out of it I use it for work so I would prefer at least 10 hours so I don’t haft to bring my powerbank to charge it idk if I got a faulty battery but I’m getting it replaced for a new one so I guess I will see if it was just a bad battery or a lie about the battery and again it could be louder for the price","timestamp":"Reviewed in the United States March 17, 2021","profile_id":"AEMVD53ISMBQTZMXXE25VJPPS7NQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:31","page":5,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=5","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=6","asin":"B086D4JNGM","page":6,"pages":93,"reviews":[{"id":"R3F1RORIXCBEKD","title":"2.0 out of 5 stars Not worth the price","author":"Jason","rating":2,"content":"Purchased XB33 a couple of weeks ago. Unit looks nice and the lights are pretty cool. Download the app for better EQ controls. Overall the sound quality is just ok. I purchased this as several reviewers stated it had great sound quality and bass. Obviously I understand this is a small Bluetooth speaker and do not expect it to sound like the 2 12” subs in my car. However I did expect a little bit of bass tones based on the design and weight of the speaker. Any song with actual bass will distort the sound quality severely almost to the point it sounds like its blowing the speakers out even when only turned half way up. Battery life isn’t the best either. This unit usually lasts a couple of hours while riding around on the golf cart listening to it. The longest it has lasted me on a full charge is about 4-5 hours so definitely not something you want to purchase and try to use outdoors without a power supply for extended periods of time. For the price and quality I would not recommend this product. I have a JBL Clip 3 that weighs less than a third of the xb33 and honestly out performs it in just about everyway from sounds quality to battery life. Sorry Sony but this one doesn’t live up to the hype or marketing.","timestamp":"Reviewed in the United States May 1, 2022","profile_id":"AH56JRJMRAVGY4LD3Z75ASCJCTCQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3UPVLJ36RL1DA","title":"5.0 out of 5 stars Does exactly what it says. Good bass, clear sound.","author":"MM","rating":5,"content":"Easy to set up, came with about 50% charge so was able to use it right out of the box. I use it in my office and it's plenty loud in that space (15x10ft). I downloaded the complementary equalizer app from the Play Store, very useful for tweaking the bass and treble.Bluetooth pairs easily with all my devices, only nit is that it sometimes pairs with a device I'm not using for music.All in all a good solid speaker.","timestamp":"Reviewed in the United States June 14, 2022","profile_id":"AH7QEYKZQDIHVTUBK7IKDIVX5DUA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3349BSB42C1AF","title":"5.0 out of 5 stars Great Sound","author":"Jerry","rating":5,"content":"The sound on this small unit is great & may even be better than the Bose bluetooth unit I have. Some of the comments about lack of base are baseless :-) This is a small speaker & can't be expected to deliver base like a large sound system. The same thought on comments about it not being loud enough are also inaccurate. I've yet to crank it up past about the halfway point for fear of bothering the neighbors. Now granted it's not loud enough to fill an auditorium or outside concert venue, but then that's not what you buy it for. Some will love the flashing lights, others such as myself might see them as a small distraction. This a fantastic sounding unit.","timestamp":"Reviewed in the United States June 15, 2021","profile_id":"AGR66B4FQWWNJNQQWW2KRIIADZ6Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RHBENJHFLK447","title":"5.0 out of 5 stars Great for the wallet and the experience!","author":"Mordy Sollofe","rating":5,"content":"I really enjoy good quality sound (not to the point of an audiophile) and this speaker is great. Good base and also with violin and piano. The lights are also a cool feature but I havent found a time they were so practical so they are off most of the time. Ive also listened to some friends JBL speakers like the charge 4/5 and flip 6and there is a slight difference but neither are better than the other imo.","timestamp":"Reviewed in the United States August 24, 2022","profile_id":"AEXLFMQD46KTDPLFYROJ73NUZADQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R16I3TWSEOD4HA","title":"4.0 out of 5 stars Sony XB33 can open up","author":"Ray","rating":4,"content":"The Bluetooth 5.0 on this unit works flawlessly. Lacking is a AC fast charger and low volume clarity. Just a bit muddy but overall a nice speaker to have around the house and pool. I would also liked to have the option of turning it on using my phone but it does have a Bluetooth standby once you download the app. And by the way there is a software update waiting for you once again when you download the app. And another mention Sony does not post the power output of these speakers, I think they should since there are many ways to measure power at least pick one!","timestamp":"Reviewed in the United States January 1, 2021","profile_id":"AGB5MCFTYFLOGDDU7PZWA4MLCFJA","is_verified":true,"product_attributes":"Color: Blue"},{"id":"ROO0KGE00IADY","title":"5.0 out of 5 stars Great speaker.","author":"Movie Fanatic","rating":5,"content":"I am replacing a $200 Harmon Kardon BT speaker that I have had for years. This sony BT speaker is great! The sound quality is on par with the more expensive speaker. It is plenty loud and even lights up! There are RGB lights along the sides and the speakers light up and it changes to the music. The speaker connects to my phone easily and quickly. If you are looking to spend on a speaker, but not break the bank, this speaker is for you!Update (few weeks later): The bass is excellent and the speaker gets loud and the battery lasts for a while. So happy with this speaker. Oh it also has a USB port for charging a phone.","timestamp":"Reviewed in the United States March 27, 2021","profile_id":"AEJLBYHW5M7DV3ONNRJI4JFPUGAQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3N260XOH2SW67","title":"5.0 out of 5 stars Awesome All-Around Speaker!","author":"eric","rating":5,"content":"Fantastic speaker!Mids and highs are great. The bass is not amazing, but still very good. You won't hear rumbling low bass as you would with earphones, but still hear the majority of bass lows.Also, as with any headphone or speaker, the source of your music (phone, computer, etc) and the EQ can have different effects on the overall sound as well. You may have to tinker around with them to find the optimal sound that suites your ears the best.Overall, I think this speaker is a 8.5-9/10. It is a great deal at this price compared with other competitors' speakers in this price range.I highly recommend! Besides you can always return it if you don't like it.","timestamp":"Reviewed in the United States March 8, 2021","profile_id":"AFRMXTXVPRVKT7GSWHTAKKKLVFNQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2XOK59J8DOCJI","title":"4.0 out of 5 stars Good Speaker Nothing More Nothing Less","author":"Henry Lopez","rating":4,"content":"The new Sony SRS-XB33 is a good speaker and it’s just that a good speaker. The design of the speaker is great it looks amazing better than last years XB-32 but the sound quality is just not worth the price I was disappointed with the speaker. In my opinion the XB-31 had better sound quality. The only thing it has going for it is that it pairs with you phone right away and the battery life is better the previous XB30 line up. I can not agree with the price that I paid which was around $160.00 with tax but I do see that the price has gone down but I still think it should be priced a little lower.","timestamp":"Reviewed in the United States June 23, 2020","profile_id":"AFZHH5OUZ77EA4KOJZTR5YLLLEQQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2UXPX0NWNQ7EW","title":"5.0 out of 5 stars Perfect little speaker","author":"Tracy H","rating":5,"content":"All I have to do is turn it on and it connects to my phone via Bluetooth immediately. Press play on my phone and I'm suddenly listening to my favorite Playlist from Spotify. Currently this sits in my kitchen. I have taken it outside for my listening pleasure while working in my yard. The sound quality is much better than I've ever heard from a small portable speaker. I'm pleased with this purchase.","timestamp":"Reviewed in the United States August 30, 2022","profile_id":"AFDMHDOZ2WNDGIXIMN5HGOMRHPWA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R3MOU8HT63SNZ8","title":"5.0 out of 5 stars Good Quality material","author":"DH","rating":5,"content":"Best speaker so far...good quality sound, base and lasting battery. If you like the blinking lights, you can turn on to go with the beat as well.","timestamp":"Reviewed in the United States August 6, 2023","profile_id":"AE6BE47BGKLOL3233HVMIKBMEZFA","is_verified":true,"product_attributes":"Color: Blue"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:33","page":6,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=6","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=7","asin":"B086D4JNGM","page":7,"pages":93,"reviews":[{"id":"R2NEL2IKGW697U","title":"5.0 out of 5 stars Great sound","author":"Schelly Y.","rating":5,"content":"Very impressive for the size. Love the bass. Light feature is fun and glad to be able to shut it off or less bass.","timestamp":"Reviewed in the United States August 18, 2023","profile_id":"AFG5E7LMUJGEFPWD6RBWDGZVPCGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R381DO5JGOBJ2W","title":"5.0 out of 5 stars Love it","author":"William Spadaro","rating":5,"content":"Works great","timestamp":"Reviewed in the United States November 27, 2023","profile_id":"AFDOZEPDLNGT35B2264ZTZ44UFZQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"R2FE46T2UF146W","title":"5.0 out of 5 stars Amazing SONY","author":"Such a Great Guy","rating":5,"content":"I liked that I got what I paid for. Item is exactly as described. Nothing more, nothing less. Plus, ya know... it's a SONY!EXTREMELY durable. I'm a tow motor operator, always getting on or off my machine, and I can attest to the fact of durability. Plus the sound? Oh man.I love my classic rock LOUD!! And with the 'live' option, I feel like I'm at a concert.Couldn't be happier. Well worth the price in my opinion. Hands down the best speaker choice for a party, with the party lights on the speaker... Amazing design.","timestamp":"Reviewed in the United States July 1, 2021","profile_id":"AECKTJ4KYYJI6MH3GIF6ESGKKSMQ","is_verified":true,"product_attributes":"Color: Blue"},{"id":"RPTJWWJ50JBR2","title":"5.0 out of 5 stars Sony SRS-XB33 Extra Bass - Amazing Sound - Excellent Treble & Bass - Waterproof","author":"Paul R.","rating":5,"content":"Perfect Size & Weight - Easy Transportable - Awesome Phone Audio Speaker - Comes with: EQ & Remote Control App - Best Sound (like all Bluetooth speakers & headphones) requires separate EQ App - Very good quality & performance for price point - Bluetooth Connectivity Auto Connects After Pairing - Live Acoustic Mode Increases Reverb & Room Size Effect or Echo - Great YouTube Demonstration & Comparison Videos Online - Use in Bedroom - Office - Kitchen - Bathroom - Patio - Deck - Porch - Pool Parties - Rain & Moisture Proof - Loudest Volume Setting - No Distortion - Very Clear & Sharp Sound - Very Adequate For Most Room Based Applications","timestamp":"Reviewed in the United States May 13, 2021","profile_id":"AFDMNXAI4GGF2Y4B46SOJOZIKN3A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2BZBB6O1JJ793","title":"5.0 out of 5 stars Doing","author":"Bob","rating":5,"content":"Better than Bose, period!","timestamp":"Reviewed in the United States November 9, 2023","profile_id":"AHNVAG4PBINBISTHC43EATW27Z2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R15M47W434JPW8","title":"4.0 out of 5 stars General Feedback","author":"Kahf sadam","rating":4,"content":"Despite receiving the item late against incredible hardship, the product satisfied my expectations sufficiently. The Bluetooth, sound and battery life are are incredible great.Nevertheless, I have unsettled issues with the customs duty. I was compelled to clear the taxes independent of the initial deposits for the product; which was unprecedented for all my purchases before. Therefore, should anyone process me through, please?","timestamp":"Reviewed in the United States December 14, 2021","profile_id":"AHBP4RR6HGRH7J5BU7PG4XOPJGCQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R11KRJF053O0Q9","title":"5.0 out of 5 stars Do it. Do it now.","author":"J. B. Vannort","rating":5,"content":"Yeah, I just got this Sony, but so far I'm really impressed. Looks cool, sounds great, and I like the lights. I'M A 45 YEAR OLD MAN BUT I LIKE THE GOT DAMN LIGHTS!!!I had a cool little JBL that served me well for about 5 years until I recently dropped it 1 too many times. I just initiated a return on a JBL CHARGE FOUR that.... Wouldn't take a charge! Even after hard resetting it. Turns out there's a lot of that with this model. Whatever, I like this one better anyway, and it's cheaper. AND HAS LIGHTS THAT GROOVE TO THE MUSIC 🎵🎶!!!!!","timestamp":"Reviewed in the United States July 8, 2021","profile_id":"AGAX7CCA7W7X34JWK3X4MACVT5SQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Taupe"},{"id":"R1P73T4FAABNU","title":"5.0 out of 5 stars Me encantó !!","author":"Ricardo","rating":5,"content":"Excelente calidad y buen precio, ningún defecto.","timestamp":"Reviewed in the United States October 7, 2023","profile_id":"AEIL2AMFHYIEZFCU4IZWWNOYQLQA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3TFX5W0UWOXND","title":"5.0 out of 5 stars Great sound","author":"argo","rating":5,"content":"Great speakers, won’t disappoint","timestamp":"Reviewed in the United States October 18, 2023","profile_id":"AGI7BOPHMFKPGRC2EYBIA3OSGATA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2PHQMPZFI12TV","title":"5.0 out of 5 stars Can’t go wrong with Sony","author":"Matthew Walker","rating":5,"content":"I did some research on the top rated Bluetooth speakers and saw that the Wonderboom 3 was the best. So I bought one, and it was terrible. I shipped it back after 30 seconds of listening because it sounded awful. My previous Sony was fantastic but finally but the dust after west and tear.Sony never fails. The audio quality is fantastic, especially on “live” mode. Live mode is supposed to use more battery power, but I just recently had it running for about 14 hours on a camping trip, so it has great battery too. Bluetooth connects almost instantly.Great speaker.","timestamp":"Reviewed in the United States May 24, 2021","profile_id":"AGOSM4FNJRR6GDWSHS772452G6MQ","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:34","page":7,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=7","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=8","asin":"B086D4JNGM","page":8,"pages":93,"reviews":[{"id":"R28O5MXY3FPPGH","title":"5.0 out of 5 stars Sounds much better than other brands of it's size that cost twice as much.","author":"Anthony Picone","rating":5,"content":"Nice bass and clarity. I compared it to the JbL and Bose that are similar in size but cost 2 - 3 times as much. This Sony unit sounds better in my opinion. The blue tooth connects immediately to my Samsung galaxy s21 without any problems. I usually leave it on all night as a low volume playing sleep music from my phone and the battery still has 70% life in the morning.","timestamp":"Reviewed in the United States March 21, 2022","profile_id":"AGM63KXZXDPQL6NSR6ZXO6WO4BEQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RZ5XVWIC6HQ4V","title":"5.0 out of 5 stars Sick with it!","author":"Michael R. Karcher","rating":5,"content":"Make sure you check your compatible speakers. At the time of writing this review it is only compatible with the xb23, xb33, and xb43. Would like a big mamba jamba to connect to like the xb32 with the Xb90 but alas, it’s a very attractive prospect to have seamless pairing with 100 speakers rather than just 10 in said older models. I should’ve checked it out first. Even still, really amazing sound. Can drown out a good area, a few rooms maybe, indoors. Bass is sick with it and the lights are cool. Boys and girls, it’s party time.","timestamp":"Reviewed in the United States April 4, 2021","profile_id":"AEEF55ODIEA4CJW6AN7TXAXPSDRA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2QVA28EJ2MP73","title":"5.0 out of 5 stars Love these speakers","author":"Tee","rating":5,"content":"The media could not be loaded. I was going to get jbl buy these Sony speakers are unmatched I have the 43 as well and I wouldn't get anything else","timestamp":"Reviewed in the United States June 4, 2023","profile_id":"AGABCX7SOE3TUWTGRNUNU2KUDGNA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R21CUYH6PRA6NV","title":"5.0 out of 5 stars EXCELLENT, EXCELLENT, EXCELLENT","author":"Amazon Customer","rating":5,"content":"I love the Sony SRS-XB33 EXTRA BASS Wireless Portable Speaker IP67 - I take it everywhere. The sound quality is great and the battery life is fantastic. And if that wasn't a enough, you can order a travel case for it, which I will be ordering in short order. I highly recommend this little yet powerful speaker and will definitely be ordering as gifts for family and friends.","timestamp":"Reviewed in the United States March 29, 2022","profile_id":"AF7PJE7RQXBHVUHTMQPB3F3BBYNQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2FEDA4BC7FKTD","title":"3.0 out of 5 stars Poor Battery Life - Always Charging","author":"Brittany M","rating":3,"content":"I originally had the Sony SRS XB32 and had it for years. I was so in love with the sound quality and colors I decided when it was time for an upgrade to size up and get this aesthetic and powerful speaker. The sound quality is great but the battery life is horrible and in no way compares to its predecessor. Even with the lights/sound enhancements turned off, I can get maybe 4-5 hours of max charge time off it. A bummer at best.","timestamp":"Reviewed in the United States March 23, 2023","profile_id":"AEWMDIDPZWGMJNCRULL4STMK6LOQ","is_verified":true,"product_attributes":"Color: Taupe"},{"id":"RIWC3EJBAXGJU","title":"5.0 out of 5 stars Perfect gift","author":"Lisa","rating":5,"content":"I dont' have a picture, but this product was the perfect gift for my husband. He loves his music and carries this speaker everywhere he goes around the house, outside, on the porch, to the garage, etc. I just might have to get he a couple more so he doesnt' have to carry it around.","timestamp":"Reviewed in the United States September 21, 2022","profile_id":"AEAZGVJM2MERMCYDSIKJTB3W6RAA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2XR7AQTQJ64AN","title":"5.0 out of 5 stars Excellent Product","author":"Ian Law","rating":5,"content":"I've owned this for a few years now. It's an excellent speaker with good sound quality and solid battery life. There was a time when I went a month without turning it on and it remained at a high charge.","timestamp":"Reviewed in the United States March 24, 2023","profile_id":"AHHAXMAXWDBHSEVJQRMDX3M4XF6A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1SWPS7WUE043L","title":"3.0 out of 5 stars Sound quality","author":"Syris Boatman","rating":3,"content":"There is like no bass at all, whatsoever, and it says “extra bass.” Don’t buy if you like true deep bass speakers, with or even one with a little bass. But it turns on easily. Battery life is really good. The light effects are awesome!","timestamp":"Reviewed in the United States June 17, 2023","profile_id":"AHIUI7LC2G7SBFGFACPUTTGOIDJQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1K38KXQAKM2DB","title":"5.0 out of 5 stars Reliable — But Not Loud Enough for Outdoor Parties","author":"Andre Wiggins","rating":5,"content":"I bought this for a cabana pool party I threw in Las Vegas. I tested it for a few weeks indoors at my home and it was great. When we arrived for the party, the sound was disappointing. Granted, I should’ve known better but I had hoped it would hold up. Not a bad product, just a little disappointed with its outdoor ability.","timestamp":"Reviewed in the United States May 11, 2022","profile_id":"AGTVXC5LW65PWLFXLYXKBGFTP3XA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Blue"},{"id":"RKPJQ961EHLPL","title":"5.0 out of 5 stars incredible sound for bluetooth speaker","author":"Doodly","rating":5,"content":"I used to have creative, klipsch, and bose desktop speakers, from 2.1 to 7.1 and everything inbetween, held off on bluetooth speakers for so many years because I heard too many distorted crappy hip hop music in public.These are incredible. They sound about the same/even better than youtube reviews (I came across this channel gymcaddy, had a bunch of really in depth and detailed comparisons and sound samples for xb33 vs other similar speakers). They feel great to hold, lights are cool but I rarely use them to maximize battery (didn't buy a speaker for the lights). I think these are the most optimal compromise between sound quality, price, and portable size for biking.","timestamp":"Reviewed in the United States September 22, 2020","profile_id":"AE3AOBNOF62VOT2W44CC4YW4725Q","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:35","page":8,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=8","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=9","asin":"B086D4JNGM","page":9,"pages":93,"reviews":[{"id":"RPBQ8R0R4AJST","title":"5.0 out of 5 stars Good sound, easy to use, good battery life","author":"nadalu","rating":5,"content":"Got this for portable music at our beach house. One charge held up for all of evenings playing music into the wee hours. Good sound, easy to pair -- we swapped source devices a lot. Price was a tad higher than I'd planned to pay, but worth it.","timestamp":"Reviewed in the United States December 3, 2022","profile_id":"AEJEFZHZJSXLUSHWMXQ4HS2G5REA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Red"},{"id":"RDG58B8QCUVNY","title":"5.0 out of 5 stars 15 hours, great sound for $125","author":"David D","rating":5,"content":"As sound goes Sony got the sound right on this speaker. If used in \"stamina\" mode you are likely to get 15 hours of music. If you use live mode you will be lucky to get 6 to 7 hours of music. The light modes don't seem to deplete the speaker battery as much as I thought. I have owned other speakers that get much louder but not with the sound quality that the Sony has...... I'm quite pleased with the speaker so far. I recommend it if you are looking for great sound quality but not for sheer volume.","timestamp":"Reviewed in the United States September 20, 2020","profile_id":"AEYSKNM2ZQZRQ65NOCZB2H5NM7VQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2ZVHHGT5XWDQW","title":"5.0 out of 5 stars Outstanding sound in a moderately sized package!","author":"AB","rating":5,"content":"Picked this up during Prime days, and as soon as I got it out of the box and playing, I was immediately taken aback by the amount of bass this thing has! Clear highs, clean and loud lows, and everything in between. Cool light show too! I use this mainly for background noise in my office, and it more than delivers! Went with Sony because the last one we bought (SRS-X3) almost 6 years ago still sounds like it did when it was new. I have no reason to believe this one won't live up to the same expectation! Will update review if anything changes.","timestamp":"Reviewed in the United States October 16, 2020","profile_id":"AH2RZHUP746L7RWPGTK3LTBQ356A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R25JJHJYGGBUUQ","title":"5.0 out of 5 stars Nice little bluetooth speaker!","author":"Sam Frontiero","rating":5,"content":"This little bluetooth speaker could probably compete with a bose speaker of the same size. I place It in a vorner of a hutch at work and I believe it helps wIth the bass reproduction. It sounds AWESOME. And it has this little light show that goes a long with the beat. That was a surprise. I purchased it as renewed so it didnt come with an instruction manual. Best $75 bucks I ever spent on something that streams music via bluetooth. A chatge for anout an hour and a half and it lasts 10 hours!","timestamp":"Reviewed in the United States April 26, 2021","profile_id":"AGTWUHQRXPZCRSJJAYX74LHQK3YQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3VEZSFT9M6H7K","title":"5.0 out of 5 stars Best overall sound for the money with solid low-end response","author":"Politicking","rating":5,"content":"I bought the EU Megaboom 3 based on the reviews and look. While is looked coolest the sound was meh. I then proceeded to buy the JBL, Bose, and Sony. The Sony has the best overall sound with solid low frequency response expected for a small speaker. The other contenders sounded flat with limited bass. The JBL would be second in terms of low-end response. This is important to me since I listen to mostly hip-hip, EDM, and Reggae. The lights are super annoying and stay off but pleased with the speaker so far.","timestamp":"Reviewed in the United States November 18, 2020","profile_id":"AF2QP6ZUFFFPJVGP7SYRTKHHZP6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"RERHGBHA5BX1T","title":"4.0 out of 5 stars Mr","author":"kimchau99","rating":4,"content":"Very good","timestamp":"Reviewed in the United States March 25, 2023","profile_id":"AHE6W3J6SSAZ3QLEVG7C5S7DD53Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"RJGO2FECM70B9","title":"5.0 out of 5 stars Perfect for the golf cart!!!!","author":"Kevin B.","rating":5,"content":"The media could not be loaded. The lights on the speakers add a great touch! Sound quality beats other speakers by far. Your never gonna get hard bass bumps from any small speaker but you can definitely hear the lows. I have a gas golf cart and these things sound great! Also don't have to worry about rain. I have been caught in a few down pours. Did I mention the lights yeah I highly recommend.","timestamp":"Reviewed in the United States June 27, 2021","profile_id":"AGGUTIKGX36HDDALOCFZUJYVXOOQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RYOZGWN1T7CFV","title":"4.0 out of 5 stars A lot of bang for the buck","author":"NOEL MURPHY","rating":4,"content":"Great sounding full spectrum speaker .Light show is pretty impressive as well. The highs sound just as good as the Lows .As a musician and a sound guy it gets a big seal of approval.Battery life is outstanding I love taking the speaker to the lake. Do yourself a favor and get the three-year replacement plan and you’ll be rocking for a while. Peace.","timestamp":"Reviewed in the United States August 13, 2021","profile_id":"AHBOOJWPVUUHDTYCI4FM5YLIYLOQ","is_verified":true,"product_attributes":"Color: Red"},{"id":"R230SZFKPB1MEV","title":"5.0 out of 5 stars Well packaged.","author":"Alfonso Hernandez","rating":5,"content":"Arrived on time,the speaker arrived in good state has described and well packaged, thanks.","timestamp":"Reviewed in the United States July 19, 2023","profile_id":"AHSIGEAQW6JTWWMB5RUWXKO4GX7A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R271TB0UB0C1W8","title":"5.0 out of 5 stars Great speaker !","author":"Joshua Mobley","rating":5,"content":"This the best speaker I’ve ever purchased ! Very loud lots of bass and it has tons of hidden specs! Sure to get the party started with the lights ! I will definitely be purchasing another one","timestamp":"Reviewed in the United States April 14, 2023","profile_id":"AHIKMUZBVY6RVI6MJCJWL4SDNMQQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:36","page":9,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=9","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=10","asin":"B086D4JNGM","page":10,"pages":1,"reviews":[{"id":"R3VY600RGX3FNZ","title":"3.0 out of 5 stars XB33 - Not Loud enough (Sony please publish your specs)","author":"Craig Petku","rating":3,"content":"The sound quality of this speaker is good and the flashy lights are a nice touch. However it is nowhere near loud enough for my intended use. At full volume with my phone set to its max, the speaker just fills a 12x10 interior room. Since the intent is to use on a PWC where it will need to overcome engine noise, I have no confidence in it being loud enough. I suspected this would be the case when Sony refused to discuss specifications such as SPL or wattage and compare it to the competition. Sadly I waited well over a week for delivery as Amazon has had trouble getting stock of this new unit. Also, the NFC feature didn't work with my Samsung phone. Not a big deal as BT pairing is pretty easy.Now due to Sony's over-selling the XB33's abilities, Amazon will be getting a return of a nice product and incurreng shipping both ways, but that's the beauty of Prime...","timestamp":"Reviewed in the United States July 7, 2020","profile_id":"AFKRXRA4E2X2CDCX7OQZX24ABATA","is_verified":true,"helpful_count":63,"product_attributes":"Color: Blue"},{"id":"RTVU01XFJ2GTT","title":"5.0 out of 5 stars Easy to pair with devices","author":"Linda S","rating":5,"content":"Had an older model that I liked and use at work. Wanted one for at home for my office for listening to my Amazon music or Audible books while working. Love the way it pairs so easily to any device. Has great sound quality. Charge lasts for quite a while. I use it off and on so don't know how long for continual use. I guess the only thing I didn't like was that the USB C-type charge cord was only a foot long so a little impractical. But easy enough to pick up a longer cord. Not a deal breaker, since speaker works and sound great.","timestamp":"Reviewed in the United States September 25, 2020","profile_id":"AFLZPJOI4BC5VIL5FGBQBWFH4XGA","is_verified":true,"product_attributes":"Color: Red"},{"id":"R282MSC8E9JWFX","title":"4.0 out of 5 stars Speakers comparison","author":"John","rating":4,"content":"In general is a good speaker, great battery life, good connectivity and good audio but I have owned JBL speakers and they are much better in terms of audio, I purchased this sony because I wanted to compare but definitely they are different. If you are trying to choose between these 2, you won't regret this one but I 100% recommend jbl over this sony","timestamp":"Reviewed in the United States July 18, 2021","profile_id":"AFW2NXCM2MFUOZMB66IXR4OY3OQQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R29ILJEX6MEPAU","title":"4.0 out of 5 stars Just a little regret","author":"G","rating":4,"content":"Watched videos on Charge5 and this unit…unit looks great and the light feature is nice but I believe I would’ve enjoyed sound quality more with the Charge5 due to the two speakers it has plays highs and lows separate speakers vs. the Sony plays everything out of the two speakers. Makes sound a bit muffled at times","timestamp":"Reviewed in the United States September 18, 2021","profile_id":"AEN7K2M4EGO26Z5RKE3IOE5HBCXQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2X8DM4W60O8YY","title":"5.0 out of 5 stars Love the sound","author":"Macey Moon","rating":5,"content":"Thank you, shipping was on time and fast.Love the product, my granddaughter had one and I like hers so I order me one. The sound is great.","timestamp":"Reviewed in the United States April 6, 2023","profile_id":"AHK2PNNN5JCDDCS42CNZDSFY75AA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1686JX1OCSEL6","title":"5.0 out of 5 stars Made me finally get rid of my old big speakers which I thought I needed for true fidelity!","author":"Vicki Adams","rating":5,"content":"I continue to be amazed by the depth, defination, lows, mid-range and high frequencies of the speakers. Far, far better than I thought anything that small could fill a room with. The first was so cool, I bought a second one so I could receive true stereo and they are my first, nearly only choice of listening to music. Then I started taking one to my workbench so I could have great tunes while doing other stuff in the garage.Try 'em. You'll like 'em!","timestamp":"Reviewed in the United States May 11, 2021","profile_id":"AEJS2XC6DX3K4I3XU6L4VNZWFWWA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1JLPO0A3D1VHI","title":"5.0 out of 5 stars Sony did this right! I cant put it down.","author":"IroquoisPliskin","rating":5,"content":"I love it. Very good audio quality. Well-balanced highs, mids and lows. I am writing this only 3 hours after receiving it, and I can't turn it off. I have been listening to music from my phone and I'm hearing quality and noticing frequencies in bass and mids that I never heard on anything else I got. Sony does it again. I don't like the way they treated Michael Jackson, but I do like the way they build their gaming consoles, and Bluetooth speakers!","timestamp":"Reviewed in the United States December 1, 2020","profile_id":"AG567CB23TFAUET7ANAQPNQMWZUA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Blue"},{"id":"R248RSH9N5RM46","title":"4.0 out of 5 stars Very good","author":"frimpongbright","rating":4,"content":"Sound quality is perfect, good bass and all that and there are apps you can have to control the lightning and sound effects but it isn’t as loud as I expected it to be.","timestamp":"Reviewed in the United States March 28, 2022","profile_id":"AG4EWY6C4LATMZWP3R42XL7XCQFQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3U7Q26UTZD1J","title":"5.0 out of 5 stars Fabulous sound","author":"Linn Campbell","rating":5,"content":"This is the second set to go with the first set I bought","timestamp":"Reviewed in the United States July 4, 2023","profile_id":"AEMTG7EYK77EBY36FA2EV4DSDXHQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3NBOL1WJRJ27X","title":"4.0 out of 5 stars Pretty Good","author":"Butch Bouchard","rating":4,"content":"The only, and I mean ONLY reason I'm not giving this a five-star is that it's not quite the booming sound they advertise. It certainly has its limits. They advertise it like its blaring, heart thumping sound. I'm just not that impressed. Good value. Haven't testing the battery life as it's only on for a few hours at a time. And as far as water and shock proof? I don't plan on testing those attributes intentionally.","timestamp":"Reviewed in the United States December 5, 2020","profile_id":"AGLW4UTX5ZHGLZEUBO2V4FPJFCVQ","is_verified":true,"product_attributes":"Color: Blue"}],"page_type":"Question","asin_in_url":"B086D4JNGM","product_name":"Sony SRS-XB33 EXTRA BASS Wireless Bluetooth Portable Speaker, IP67 Waterproof & Durable for Home, Outdoor, and Travel, 24 Hour Battery, Party Lights, USB Type-C, and Speakerphone, Black","parse_status_code":12000},"created_at":"2024-09-12 04:58:23","updated_at":"2024-09-12 04:58:38","page":10,"url":"https://www.amazon.com/product-reviews/B086D4JNGM?reviewerType=all_reviews&pageNumber=10","job_id":"7239859870067874817","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-12 04:58:23","domain":"com","geo_location":null,"id":"7239859870067874817","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B086D4JNGM","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-12 04:58:38","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7239859870067874817","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7239859870067874817/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7239859870067874817/results/1/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/2/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/3/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/4/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/5/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/6/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/7/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/8/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/9/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/10/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/11/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/12/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/13/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/14/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/15/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/16/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/17/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/18/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/19/content","http://data.oxylabs.io/v1/queries/7239859870067874817/results/20/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7239859870067874817/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7239859870067874817/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/16/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/17/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/18/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/19/content?type=raw","http://data.oxylabs.io/v1/queries/7239859870067874817/results/20/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7239859870067874817/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7239859870067874817/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/16/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/17/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/18/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/19/content?type=parsed","http://data.oxylabs.io/v1/queries/7239859870067874817/results/20/content?type=parsed"],"method":"GET"}]}}