{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=1","asin":"B09PMYTJD2","page":1,"pages":107,"reviews":[{"id":"RI4J0OA8QEHX8","title":"5.0 out of 5 stars Simply top of its class!!","author":"Dr. Ace Farley","rating":5,"content":"This Stormbox blast is simply the benchmark in the large size boombox Bluetooth speaker category. On sale for under $150, nothing outperforms this speaker, period. It makes smaller more expensive speakers from Bose and Bang and Olufsen sound tiny in comparison. Well worth the money if you have the space.Pros: amazing deep pounding bass, clear and accurate mids and highs after app EQ adjustments, tribit app compatibility, heavy tank-like build quality, superb battery lifeCons: huge size and heavy weight make it difficult to use in all rooms or spaces, doesn’t look particularly high-end aesthetically, bass can easily overpower mids and highs without eq adjustments","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AELFZXV7CNAJY5QEDRPA7YXBUGDQ","is_verified":true,"product_attributes":""},{"id":"REPT12N1Z65B","title":"5.0 out of 5 stars Tribit Stormbox Blast","author":"BLRG","rating":5,"content":"Arrived yesterday and connected it straight away. Had 60% charge on arrival and excellent packaging. Sound blows away the Soundcore Motion Boom + (in my opinion) which I tried first but was just not able to get the deeper bass and despite watching all the videos and reviews and eq recommendations was not able to get the deep bass or anything close to the Tribit also was not able to reduce the screechy highs on the MB+. My son has the HK Onyx studio 6 and when comparing the MB+ to the studio 6 the only area the MB+ wins is it gets louder but the sound is no where near the shear richness or quality of the Studio 6. This Tribit has the deep bass and smooth richness but can also get loud and also sounds great on lower volumes as well - normally listen at 30%-40%. We are using it as a sound bar for our TV right now and watched a couple movies last night. WOW what a difference. Was like being at the cinema - the rumble on the lows! The bluetooth is easy to connect and only small issue is delay when flipping between tv, phone & laptop bluetooth. Was flipping between multiple devices simultaneously, Was testing with youtube videos from the laptop, movies on TV and music from my phone as well as playing with the tribit app & settings. I think it is only supposed to connect to two devices at a time but irrespective it was only slight delay flipping between 3 devices - between 2-3 seconds. The sound and deep bass is so good for its size and I know many talk of it being heavy but its not heavy to me, feels right and solid - not cheap -but quality. It is super easy to carry around and will be great for the boat / lake and beach. It is warm and rich sounding with plenty of customization. Will see how the battery does over time and how it keeps performing but so far very impressed. Started the morning with the battery at 100% and shows on the app. As soon as the light on the unit showed it was filly charged the app said 100%. Lights on it are bright- nice to have but I keep them turned off. Nice thing is they still show when adjusting the volume even when light display is off. Have had it on today non-stop for 12 hours so far playing between 40 - 60% volume - lights off - working as a TV sound bar and for streaming music. I am still showing 60%. Will see how long it keeps going.","timestamp":"Reviewed in the United States September 1, 2023","profile_id":"AF5F2GNRXCRVAOOCW36TN7IGGNWA","is_verified":true,"helpful_count":40,"product_attributes":""},{"id":"R2D4M42M5NELUB","title":"5.0 out of 5 stars Awesome Sound","author":"Ryan Nobles-Fisher","rating":5,"content":"Was considering this or the JBL equivalent, but after trying this product for a few weeks I am more than happy. I was a little worried about trying a non-name-brand speaker, but after consulting some forums, I took a chance. The sound is juicy and has good bass. I downloaded the updated sound enhancements and am very happy with it. The battery lasts a lot longer than you'd expect and is quite loud. I usually keep it around half volume and works great both indoor and outdoor. Its got some heft, but the quality of the construction feels solid and I love the boom-box aesthetic. For the price, you cant beat this.","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AEGRAUUKUO3JGDSH3IXQVSAXPH5A","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"RZN1X5HHIPU79","title":"5.0 out of 5 stars Unbeatable price/performance! Has 3.5 mm aux input!","author":"Corndog","rating":5,"content":"Sure, it's a bit weighty, but I'd rather that and have nice, beefy sound, than to have it be light and have a less substantial sound. But you may differ. If you are one of those people, you may prefer the Motion Boom Plus by Soundcore. I got a chance to test out both in person, and personally, like many, I went with the Blast.The Motion Boom Plus can be tuned for an elegant sound, but its limited EQ in the app kills what could be much better. I was able to get richer, lower reaching bass out of it using a 3rd party app, but it took much work what was existent out off the box with the Blast - and much more substantial at that! The retro-looking RGB side lights are icing on the cake. Very cool to look at, and adds a unique effect.As for sound, I usually opt for flat, neutral tunes when it comes to my monitors and headphones, but I wanted a fun, boomy \"travel\" speaker (more like 'road-trip speaker) that was competent with the bass. Not only is it clean and punchy, it can reach down surprisingly low for such small drivers. The mids and highs are nothing to write home about, but they aren't terrible. They're serviceable. Mids are a bit recessed, dry, and resist drastic tuning, but can be slightly brightened to bring the tracks alive. Could be better, but not bad, and doesn't ruin the sound of the speaker. I'll also add here that I wouldn't have purchased this speaker if it did not have the 3.5 mm aux input, so good on Tribit for including that.Battery life is also phenomenal, but prepare to lose just a tiny bit in the power of the sound when unplugged. I honestly prefer that approach, as I value sound quality over portability. If it's relatively close while on battery, but gets a nice boost plugged in, hooray for that! In the end, I suppose it's how you look at it; lose power when unplugged for portability vs get a boost when plugged in - I see it the second way because I'm used to the philosophy that there is always a sacrifice for portability.Right now the Stormbox Blast is priced 40% off its original price at $155.98. That's awesome, especially when you consider that the less capable, yet lighter Motion Boom Plus is price $5 more. It's really going to come down to your preferences and personal needs. But if it's for a more powerful sound, a flashier look and presence, then this one is going to be it in this price range.","timestamp":"Reviewed in the United States January 9, 2023","profile_id":"AHFFS52VKVXLX27S2JJMXWFDQ5AA","is_verified":true,"helpful_count":55,"product_attributes":""},{"id":"RWUVNJD6SC9JC","title":"4.0 out of 5 stars Great initial quality","author":"SuperBlindGirl","rating":4,"content":"Writing this review from one blind person's perspective.I have purchased other Tribit speakers, namely the storm box. I was very happy with it, so when I wanted some thing bigger and louder for outdoors, I gravitated toward this blast. Based on my experience with the storm box, which is a smaller less powerful speaker, I was hoping the blast would afford the same features. There were some similarities, but some drawbacks as well. It is not a larger version of the storm box. It does have somewhat of a similar feel, same shape only larger, but sports a handle on the top as it is much heavier than I would have expected. I assume this is due to the significantly larger battery which allows for long playtime, lighting, and the ability to charge other devices from the speaker. Well it is noticeably heavy, it is not overwhelmingly heavy. Unlike the storm box, do not expect 360° sound from this speaker. It only projects forward. What I liked about the storm box were large easy to find volume and play pause buttons. The buttons to control the speaker are on the top in front of the handle in a row. While they do have some tactile markings, they are not as pronounced as the storm box, and are much smaller buttons. They can easily blend together. I would have liked to see bigger and better marked buttons considering the large size of this speaker. Similarly to the storm box, the controls only allow for volume up and down and play pause. There are not controls to skip tracks or fast forward. I really would like to see this feature added to their line of products as it would be extremely helpful, so is one drawback to the brand. One cool thing is that you can download the Tribit app, which I did on my iPhone, and this allows for full control of the speaker, including lights, equalizer, and volume controls. I have been using the speaker outside, and I think that is where it excels. It definitely sounds good inside, but definitely seems made for the outdoors. I appreciate that it is water resistant, and it has decently deep base which I also appreciate. The lighting has two different modes, which with my extremely low vision I can barely make out but I'm sure keep things interesting for those who can see. You can control the lights either from the app or using the button on the speaker itself. You can also turn on and off the base boost on the speaker itself or in the app. There are more equalizer options within the app . I don't have much of a very discerning ear I guess, because I have a hard time distinguishing between the difference of bass boost and party modes, but the sound quality is good. The biggest and best surprise for me was that when I used Bluetooth to connect this speaker to my iPhone to play music, the music played on the speaker, but voiceover was only coming out of my phone. I actually love this because it allows me to control the music from my phone accessibly but not interrupt the music. I wish every speaker would do this! my storm box speakers don't seem to have this functionality and I have not experienced it with any other brands of speakers. This made me very happy! I was able to purchase the speaker on sale, which made the price tag a lot more palatable. So my recommendation would be to watch for that! it is definitely overall a solid speaker and worth checking out, especially if you have vision issues.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AFIUWEUUEJPYZ2Z6F3WRP6TBHVOA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R14WFG5XBMZ1C8","title":"5.0 out of 5 stars Amazing speaker for the price.","author":"Marc Roman","rating":5,"content":"I was sick and tired of wearing headphones or playing music through my phones speaker. I was looking at the Soundboks and other high priced Bluetooth speaker options. I was reading a Reddit post and saw the Tribit with exception ratings with a price that was a quarter of what I was looking at. Plus much more portable. This speaker performs amazing and is so easy to use. It has a Bluetooth connect button, volume controls, button to turn the lights off and one for more bass. I couldn’t be more happy.","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AHW33OXLQC7OUHSI5GDXSF6ILGNA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R2BIG9HUD363LX","title":"5.0 out of 5 stars outstanding sound quality","author":"damon","rating":5,"content":"I really appreciate the reviews I came across that recommended this - they were absolutely spot on! I have several different portable/ bluetooth speakers to compare this to, new and older - and it is very impressive. Originally I was trying to replace an older Altec Lansing speaker that the speakers finally gave up, and my wife was looking to upgrade from a little Oontz Angle 3. After looking into the different options, we ended up trying/ getting a few (all of which exceeded the old Altec and the tiny Angle 3).The Bugani Shock is smaller, lighter & much cheaper than the Tribit - it sounds good for its size, can get pretty loud and stays clear, but its not in the same league by a large margin. I had tried the W-King D-10 - its bigger than the Bugani, but smaller & lighter than the Tribit - and priced in the middle of them as well. Again, it sounds good, gets loud, stays clear, had much more bass and had a bigger overall sound stage than the Bugani - but still not on the same scale as this Tribit. I recently got the Klipsch Groove XXL - and sound quality wise, they are extremely close - maybe the Klipsch having a little more detail, the Tribit has a bit more bass - but both have unreal scale, especially for being relatively small, portable speakers. How much bass the Tribit puts out is really impressive for its size - all while having a very balanced overall sound.I havent found out the limit of the battery life yet - but I have played it at around 60-80% volume for several hours continuously w/ no problems.We ended up getting a 2nd Tribit recently when they were on sale - I tried them together in stereo - they work seamlessly and sounds that much better.I could easily give a recommendation for either the Tribit or Klipsch - they're similar size, the Tribit is a little heavier but has a better handle... Finding each on sale - the Tribit is around $20 cheaper... The Klipsch has a remote... I couldnt find any waterproof/ resistance rating for the Klipsch, while the Tribit is IPX7 rated, etc.... I dont believe a better option is available at this time for a speaker under $200 - I did my best to find it.","timestamp":"Reviewed in the United States May 30, 2024","profile_id":"AEJ7MGTSJ6ICFUTZIAMMCNLF7USA","is_verified":true,"helpful_count":3,"product_attributes":""},{"id":"R1AYDTW2QVE2T","title":"5.0 out of 5 stars Unbelievable Deal!","author":"Chad Czternastek","rating":5,"content":"The media could not be loaded. I budgeted $210 to buy this in a month or two. I seen it on Amazon for $150 and I jumped on the deal. My friend has one so I heard the sound that comes from the speakers. The sub-woofers are built into the flanking sides. It hurts to touch it when you got bass going on.The sound that comes out the speakers is so good. So crisp, so clean, just as good as a Bose if not better. Unless you are one of those who want the expensive, hi-fidelity stuff, these will more than do.Some people complain about the weight but I think it builds into a big space of speakers into a dense set of small speakers combining into 90W. It weighs 12 pounds which don't seem like a lot but you initially expect it to be lighter, and you instantly realize all the weight is the dense design. Only issue I could complain about, if I had to find one, is the battery life. The ads and descriptions say it has so many hours, and they figure that time at super low settings. When you use this at the ideal volume, you are not going to get as much as you think. As I said, if I had to complain it would be that. For me, I listen to music on it, and lasts me two to three days. That's a couple hours, a few there. But if you have it plugged in, you have no worries. 8-10 hours total I would say is realistic.If you get this and like to listen to remastered music, which seems to be the accepted way to cash in on a already successful record. You can tell cause the music quality is top tier. You hear the little things that you don't normally hear. I think listening to the sound, you need to use the pre-set equalizer settings based on the music type. I have no clue on how to use an equalizer but using the pre-set ones you can tell when switching.What makes this so great is how music is bought now compared to a decade and beyond. Used to be you hear a couple songs off an album, you go pay $20 for the record. Now, you pay $10 to Amazon Music or Spotify and you have almost full access to any album, ever. You can discover new music on this. The quality is good enough to invest more time into the great art of music. I've read you can have more then one connected at the same time.Best value of anything I ever got. This is so worth it at retail price but you can usually catch it for $199 or less if you look or find the right deal. I've had a set of speakers well over $500 total that don't sound as good as this. If you are thinking about investing in some speakers, and stream from Bluetooth, I can save you time. Of course if you are looking to get very high quality speakers, and higher level of wattage and thump, you are gonna pay more but this does the job.","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFZDMTNFX6AMFWXYZTFNRWAB34WA","is_verified":true,"helpful_count":8,"product_attributes":""},{"id":"RJFFRUZIKDIQP","title":"5.0 out of 5 stars Full, LOUD Sound Even in Open Spaces","author":"Teknogk","rating":5,"content":"I have been eying up the JBL BOOMBOX 3 for a while since I love my Charge 4 but I wanted something that filled the yard with sound and carried good bass. The Boombox 3 seemed to be the ticket but man, that price is high.I stumbled onto a review for this Tribit StormBox on YouTube from German guy who had these two side by side on an open basketball court while his son was zooming around a few RC cars. He switched between these two testing the volume, bass, using different music and the difference was remarkable. Unfortunately that video has disappeared but I was impressed enough to look into this and give it a try and when I saw this had a $40 coupon bringing it to $160 I jumped. I was not disappointed!The sound is great, the battery is phenomenal (without running the LEDs and at about 50-75% volume), and a few people who have heard it were very impressed. I had three long 6-8 hours days in the yard and each night forgot to take it in when I only had one and charge it and on the 4th day I thought I might be in trouble lasting all day but checked the app and it still had 40% charge!I loved it so much I purchased a second one so I could run them in stereo mode as a left and right speaker! It also works in 'serial' mode so both speakers are connected and both playing the same music in stereo if they are spread apart too far to have a left and right speaker.UPDATE!!! I thought is was able to play in 'serial' mode which the speaker said it was in but it is still only left and right when connected. I didn't really notice it with the music I was playing but caught on after some music with more separation. I reached out to Tribit on this and they said it only paired in stereo mode but not at all a deal breaker but it would be nice to have this feature.The nice touch for using them together is that once linked they remember the mode you are connected in (stereo or serial) so when you turn them on they link together again automatically. The volume of both is controlled by my phone so they both go up and down with the one control and if you turn one off when connected the other powers down as well. The only slightly negative things I have with this is sometimes if my phone is on me in my pocket and I am working at a lower level in the yard behind a retaining wall the Bluetooth can get a little spotty but works fine when I leave the yard and go in the house and even stays connected if I go into the front yard.The other thing I would like to see is some sort of visual indicator of the battery life on the speaker itself, maybe adding that as an option when cycling the LED modes. As of now I need to open the app to check the battery.The app is only OK but getting better as I have had a 3-4 updates to it since my first one was ordered in March.Beyond that I really could not be happier with this purchase and I have two of them new ($320 with a $40 coupon for each and STILL currently available as of 7/31/24) for significantly less than a single JBL Boombox 3 new ($500) or 'renewed' ($375).I am no super geek audiophile but to me and many others that have heard this it sounds great to us and really fills the yard with sound and good bass so I highly recommend this speaker!","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AHSIGPKSADGJ3Y3ARZDGYVQBQYBA","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R1M5UBI9XI0S16","title":"5.0 out of 5 stars My review vs soundcore boom 2 plus","author":"John","rating":5,"content":"So quickly going over the differencesThe weight. The soundcore isn't light, but the tribit is noticeably heavierAppearance. I personally like the soundcore. For both I don't like the lights. I'm sure they drain battery and I just don't care for them.Sound. To me, out of the box, the soundcore just sounds downright bad. I immediately wanted to return it upon hearing it. That's actually why I bought the tribit, yeah it sounds that bad. The tribit took a few days to arrive and during that time I played with the soundcore. I found some random guys eq and it made things definitely better. The soundcore is a lot newer and I didn't find many eq online.... Or maybe I just don't know where to find them. I'm posting mine that I'm slowly tweaking, but sounds a million times better than what it comes with. I have no idea why soundcore launched what that preset. As for the tribit it sounds much better right out of the box with stock preset. So if you hear comparison videos online like I did, the tribit is just going to sound better, hands down, but doesn't have a ton of room to get better (from my experience)From here I'm comparing using my posted eq for soundcore b2+ and Alan Ross eq for tribit. Keep in mind I'm no audiophile nor do I know the terminology that well.The sound is pretty similar. What jumps or to me is that in things like rock music, the soundcore has like this noise. I'm not sure if muddy is the word, but it sounds like some sounds can just run together, doesn't sound super clean. It doesn't sound awful, just switching back and forth with the tribit, it's noticable. The tribit on the other hand just doesn't have that... It's like it's just not there, it's cleaner. But when listening to volume around 60%+ I can hear the tribit distorting, which doesn't happen on the soundcore.On louder volumes, that muddy or whatever sound on the soundcore kinda makes it feel full, kinda like a concert or something. When the tribit is turned all the way up, I mean it doesn't sound bad, but it sounds a little more empty. It's hard to explain, but that's all I can do. I don't know if it is, but it makes the soundcore sound a lot louder. It's more fun to sing along to at high volumes(drowns out my own voice more lol)My suggestion is if this is for outdoor use/you wanna jam out at high volume and sing along to, get the soundcore. If you want cleaner music for lower volumes especially inside, get the tribit.The both pump it crazy amounts of bass. Since I'm using mine virtually 100% outdoor, the soundcore is what I'm keeping","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AGUC7ZJPKZD6VBLUFWETB2ILOJDA","is_verified":true,"helpful_count":3,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:00","page":1,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=1","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=2","asin":"B09PMYTJD2","page":2,"pages":107,"reviews":[{"id":"R3A5OMLEB9E0OA","title":"4.0 out of 5 stars Heavy, and no phone calls, but music is great","author":"Dman","rating":4,"content":"I struggled between getting this Tribit Stormbox, or the W-King 80w, for months. I got this tribit instead of the W, since I have had and still have 4 or 5 ? Tribit devices (from earbuds to Stormbox Micro 2), and their sound is always good, they dont lie about how long their devices will play for, they dont lie about bass, their usb ports have NEVER gone out on me because they were loose or cheaply made/applied, and their tech support is as good as Anker is (top 2 support companies on Amazon says me and many others), and also the Tribit was 10w louder, lol.Anyway, the 1st thing I did with this was charge it, 2nd was play music on it.Most of my music I have is mids/high type, and this didnt disappoint me much about a softer bass. BUT, for those musicians who I do like with lots of bass, I was thinking: man, this is kinda low bass. THEN I remembered there was a Bass Boost button! And man, when you hit that thing, it is perfect (to my ears, and for no$5k setup mind you). The Bass Boost REALLY does boost the bass, without drowning out the mids and highs. Dont ask me how the do it, but they do.The wireless reaction time from my phone is instantaneous on this boombox (unlike the micro 2, which has about a .5 second delay).I have been trying to get my computer speakers to work on my tv because there isnt any bass since the speaker bar wireless bass/rears went out, so I hooked this Tribit boombox to my TV ! LOL Funny thing is, is that it actually works, even though I still have the speaker bar hooked into my tv. It takes a few minutes to get the speaker bar and the Tribit to sound evenly (since I have the Tribit next to my bed between my tv with speaker bars and the Tribit acting as bass and Left Rear, lol), but once it does man does it sound good. There is a little delay when my tv is paired with the Tribit, but I know its from me having an old tv, with wireless 3.x or 4.0 max, and also with 2 sound bars hooked up to it (man I wish my 1st sound bar bass/rear didnt go out on me. I cant afford another $700 to $1100 for just a sound bar bass and rear).Anyway, this Tribit is 'almost' what I was looking for, so here comes the Negs/Wishes.]There is NO Remote control. Why not? Because we should be able to stand up every time we change the channel, or the next song is blaringly loud, or too soft, or we actually want to have a conversation with someone next to us and its too loud? Very big missed chance here, assuming we will just use our phones to sound up/down? You have to find the right loudness on both the Tribit and the whatever-it-is you are doing on the phone to have to turn it up/down also? What about when we are on a call, and cant turn the Tribit off, higher or lower? Oh, just turn your music off from the phone you are talking on! Right.......When I turn the Tribit lights off, I dont want to have to turn them off EVERY time I adjust the volume on it. Big mistake having the lights tuned to the Tribit sound up/down (when you physically have to get up, go to the Tribit box, find the sound button, turn it up or down, go back to where you were and see if it is loud enough or not, and keep doing that all day/night long? What about when you arent using your phone, and have music on a usb thumb drive? Way too many scenarios where a remote control would have upped this a star. No way. Another reason why a remote is good in these situations. On, Off, Up, Down sound, turn lights off completely (heck, put a light bar on the remote, so we can see if it is topping out or not), Last song, Next song. Not much to ask for, right? A remote control goes a LONG way on a limited product like this.Did I say this thing is heavy? It really is. I had an older product like this, with more features, that weighed 1/2 or less than this Tribit. A carrying strap would have been nice! Or a bag? Or something, even rubber handle over the plastic would make hauling this around much nicer.Did I say Limited? Yes, I did. This tribit does 2 things, play music from app and lights. Thats it. No Radio (I know, only us old folk listen to the radio). No cd player. No Time/Day/Date etc (would be nice to be able to use this as an Alarm clock. USB port for thumb drives? Port for sd/micro sdhc cards?Power bank? What device is NOT more portable for a power bank? Or even less pricey? I have a 5 hour bank charger I got for $30 that will power my phone longer than this thing when it is not plugged in, lol. Although, I did say they never lie about their products run time, and 30 hours IS a long time, so maybe a power bank is ok, except most of us have our phones in our hands, on a 1/4 pound or less charger if need be, not laying next to a digital dj, heh. Seems this was just one of those Checkbox 'features' because there arent any features (mostly because that would require a remote control for? maybe).AUX In? Hello, phones dont have a 3.5mm port anymore. Or are we supposed to tie ourselves to the Tribit, yet again, and carry a 3.5mm to usb-c cable around? Maybe we could put it in the Tribit carry bag...Oh, wait, there isnt one. Heh.Overall, for what I use it for, its almost perfect. And it seems W-K is going down this road now also with their new lineup (I was choosing between this and the squared W-K back before the new sleeker W-K came out). Except for a remote control, just to turn up or lower volume, and turn it on off (basically a remote that has the buttons on top of the Stormbox, this thing is almost perfect for me, except when I have to lug it somewhere else in the room. Tribit does 2 things VERY well, and those are Sound quality which this has, and real Time mentioned on how long it runs, which is usually on the lower side rather than the higher side. And Tech Support, so 3 things. I havent needed support for this Stormbox, so its 2 for now.Recommended?Yes. If you are strong enough to lug this thing around, just want to play great sounding music outside while you sit, or do yardwork, or have lots of parties. Oh, also if you want to use it for your tv speakers instead of the tinny sounding wimpy ones that come with tv's nowadays, lol.I almost gave it 5 stars, it is that good, but w/o a remote control and very limited use, I just cant give it a 5.","timestamp":"Reviewed in the United States June 30, 2023","profile_id":"AH5TKVDNNG6H27AILTCIDTCUCXEQ","is_verified":true,"helpful_count":24,"product_attributes":""},{"id":"R2CEBO9M8ZDN0S","title":"5.0 out of 5 stars A MOVIE THEATER SPEAKER to have at home.","author":"Terry Wilkerson, Jr.","rating":5,"content":"The media could not be loaded. The packaging and the expedient of the arrival of my speaker arrived on time and were in great condition. I wasn't expecting all of the box and foam that came inside this to keep it well protected. I love that.Now, this is my second introduction to Tribit and I really love this company and this speaker specifically I really, really love beyond infinity. I wish I could give this speaker more than 5 stars because this is amazing.I had my first Tribit StormBox Blast delivered on June 23 for my personal testing since I mostly use the speakers I have (Tribit and JBL) for movies and very little for music and the second one I got on June 30 this year (2024). Let me tell you that the performance of just 1 Tribit StormBox Blast is out of this world. When I was testing my speaker inside of my house at 50% volume within ear shot, oh my God. This speaker is a literal movie theater speaker and that is mostly because of the XBass button on the top of it and even without it on it still gives off that impression. I was testing the Alien: Romulus teaser trailer since that is the best option to use and when I went to the theaters a month before I got this speaker, I remembered the sound and everything when they showed the preview for it and it sounds exactly like the theatrical experience. I am not exaggerating when this speaker was literally shaking my room, with or without my door closed and that I could feel the wind from it. I do not believe it is advertised as a movie theater speaker but it is indeed that. Amazing job Tribit. I suppose that the size of the speaker is why it able to do that but I digress.I love bright colors and the appearance of the LED lights I love and this speaker is very easy to use. As you can see, I have put a video of my 1st speaker at the time and the connectivity of this speaker is 150 feet and I could hear the music and dialog from movies from that far away as if you were a little bit closer to it. It does start cutting out when you are pass the 150 ft. mark but if you have your phone connected to it, I suggest leaving it by the speaker and go the distance you want to go. I had to be at least 200 ft plus and I could hear everything very clearly and I had the speaker at max volume in order for that to work and the phone in the idea I mentioned. It really makes up the size for this speaker and the speaker is 12 pounds but is not heavy to me at all.I test and watch only movies with my speakers and now I have a second one of this speaker and I love it. Godzilla Minus One I tested when I watched the movie for the first time and yeah this is a movie theater speaker and I didn't see that movie in theaters but I know that is what that sounds like. Transformers 2007 I remember every sound when I saw that in theaters and that is exactly how it sounds and even more so. This speaker cost $200 but here on Amazon you can get a 40% discount and it bumps it to $160 to $170 depending on your shipping prefence. This is the best speaker I have ever gotten and do not intend on getting any other speaker. This speaker does have 30 hours of battery life as advertised but it is mostly due to the LED lights being shut off. With the lights it 24 hours or almost less. I watched three 2 hour movies and the Tribit app, in which you can customize the volume for this speaker, the battery was still at 70% or 50% left and that was with the lights and not plugged in. This is the best speaker I have ever purchased and have and I would highly recommend it. Especially if you love movies like me or if you really love music like me also. I wish there was more to elaborate on but this speaker is a BEAST.","timestamp":"Reviewed in the United States July 8, 2024","profile_id":"AEGNH2USRR4LWRJMJHPQ2XGPZ6BA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R37HN5S0QF9JGH","title":"4.0 out of 5 stars Sounds Like A $500 JBL Boombox, Can't Be Used In The Shower","author":"Chase","rating":4,"content":"TLDR: Loud as hell, sounds great, plastics feel cheap, not so good at low volume, cannot handle prolonged splashes and sprays. Buy if you want something loud and cheap, don't buy for your shower or outdoor adventures.I bought this speaker due to its high rankings among various reviewers, and am blown away by the sound quality for a speaker around 1/3 the price of its closest competitor (the JBL Boombox series).My friends and I did a side-by-side sound test of the Tribit Stormbox Blast vs a JBL Boombox 2 and found them to be nearly indistinguishable at high volume. Both speakers play loud enough to be uncomfortable for extended indoor use and experience no noticeable distortion or clipping at maximum volume. Default EQ settings of the Tribit vs the JBL are different but both speakers allow for enough customization to suit most users' needs.To sound that good for 1/3 the cost, however, some cuts did have to be made. The two most noticeable are the build quality of the speaker and its low-volume performance. The Tribit speaker is heavy and feels as bulky as it sounds, but is constructed out of cheap-feeling plastic compared to the \"luxurious\" fabric and rubber overwrap on the JBL Boombox. This makes the speaker easier to dry, put stickers on, or attach third-party mounts to but does look and feel cheap.Low-volume performance is also significantly worse than that of the JBL, mostly due to the Tribit only having 16 volume levels. The gaps between them at low volumes are HUGE compared to those on smaller speakers (think five or six levels on something you could fit in your hand) and I personally find many situations where the only volume options are too quiet or too loud for low-volume use. This can be combatted by disabling Bluetooth absolute volume on your source device or using a source which does not support absolute volume (AUX input or older Bluetooth device). Both the Tribit and the JBL sound less clear and refined at lower volume than most smaller speakers, this is not a design flaw but rather an inherent property of speaker sizing.Another major drawback of the Tribit speaker compared to its more expensive competitors is its poor water resistance. The speaker is rated at IPX7 and can be submerged in water for short periods of time but will malfunction if exposed to splashes or spray for an extended period of time (use outdoors in the rain, inside a shower enclosure, etc). This malfunction usually involves the speaker quickly increasing to maximum volume while the controls fail to respond to inputs and appears to be caused by the use of a paper-based adhesive gasket to secure the control panel's rubber insert into the speaker body. For my use case this is a HUGE drawback but is something I am willing to deal with given the speaker's incredible performance as a high-volume boombox.Other aspects of the speaker mostly work as advertised. I have used the app to update firmware and it has worked without issue. Stereo mode works as well, with no apparent audio delay and full synchronization of the controls and lighting between the speakers. The lack of aptX support for a device with Bluetooth 5.3 hardware is quite unusual but I cannot hear a difference in audio quality, at least when streaming music through Spotify on a run-of-the-mill Android phone. I have yet to fully test battery life but the advertised figures appear accurate, at least based off the battery level shown in the app.In conclusion, I would recommend this speaker to anyone looking for a LOUD Bluetooth speaker, assuming your use case won't involve getting the speaker very wet. If you need a speaker which can be continuously used in wet environments, consider the JBL Boombox instead.Notes:- Ingress protection ratings are cumulative (e.g. a device rated at IPX5 is also rated at IPX4 and so on) only through level 6. Although most devices which can handle short-term submersion can also handle continuous splashes and sprays, it is possible to create one which cannot. Tribit is not making incorrect claims about the water resistance of their speaker (The Stormbox Blast does appear to meet IPX7 standards) but is rather advertising it in a way which may be misleading to some consumers.- Several of the issues with this speaker could be addressed through a firmware update, adding support for aptX Bluetooth audio, increasing the number of volume levels, etc. Given that the speaker has already received several firmware updates and is relatively new, I expect Tribit to improve on its functionality through future updates.- The water resistance of the speaker could be massively enhanced with some modifications. Several teardowns and analyses are available on the Internet as of the writing of this review, and the speaker is designed well from a water-resistance standpoint minus the issues with the control panel. I personally believe that a \"control panel protector\" could be installed on the top of the speaker and that this would allow it to handle splashes and sprays without issue.- The built-in power supply inside the speaker is massively convenient (makes the charger MUCH smaller than that of the JBL boombox) and is powerful enough to run the speaker at maximum volume continuously. Some other competitors (namely the Anker Soundcore Motion Boom Plus) do not have enough input power capacity to keep up with sustained high-volume use while plugged in. This is a big plus for the Tribit if your speaker will be used in a gym, dance studio, party house, or other situation where it'll rarely see low-volume or battery-operated use.- Most Bluetooth speakers which are covered in lights look cheap and tacky. Tribit does their lighting well, it is not obnoxious and can be turned off if desired. Several other reviewers have seen this as an issue but I personally have no problem with it.","timestamp":"Reviewed in the United States November 13, 2022","profile_id":"AGA6HJKPR346HRGADEFB22LP7V3A","is_verified":true,"helpful_count":141,"product_attributes":""},{"id":"R2LZYYK47I4DRR","title":"4.0 out of 5 stars Good value speaker!","author":"ShaneR","rating":4,"content":"I wanted a portable speaker that is well built, has good battery life, and quality sound. After watching some YouTube reviews I decided on the Tribit Stormbox Blast. My hope was that it would sound very comparable to the JBL Boombox since I've heard that one in person and was super impressed with the sound quality. While the Tribit sounds good, it's not at the same level of performance as the JBL especially at lower volumes. After reading so many positive reviews I had higher expectations on how it would sound. I feel the clarity and bass are much better with the JBL. With that said, the price point of the Tribit is substantially less which was a deciding factor in my purchase. Overall, the Tribit is a good value and I wanted to share my experience for those who might be comparing these two speakers.","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AGOMHDUWM2OYCJ6VOYTA5TCBCNSA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RW1HEZ92G23Z1","title":"5.0 out of 5 stars The perfect speaker","author":"Kit","rating":5,"content":"I spent so much reaserch trying to find the bestseller for the best value, and all my research kept pointing to this speaker. It was so strongly recommended it made me skeptical, but when I bought it and listened to it for the first time I became a believer. The bass you get for the size is the best I've ever heard, and the max volume on thise device is more than I've ever needed. The battery life is probably the best part, because I've never had to charge it after a single extended use case, I was able to get multiple hour long sessions out of the device which far beats any other speaker I've ever owned which only have enough juice for a couple hours.","timestamp":"Reviewed in the United States August 13, 2024","profile_id":"AERN57C3NFEDCXUEORU2KYD6MCEA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R2J2HF89YTEDJM","title":"5.0 out of 5 stars Will not disappoint!!","author":"Penni Moldovan","rating":5,"content":"I was on the fence about this purchase seeing as there are so many comparable options that are much more money, but I am thrilled that I went with this! It's cheaper than most but totally worth it! Appearance is top notch! Performance is right on! It is very easy to use! It's durability is impeccable! The size is perfect! Most of all it's portability is everything I needed seeing as I'm constantly on the move (around the yard, in the shop, in the house, camping, bonfires, kids games, family parties, everywhere!)","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AFARUQJ3HW7AGWCNJPN4EN5PP2NA","is_verified":true,"product_attributes":""},{"id":"R2FYXBW1NG5O27","title":"5.0 out of 5 stars Great Portable Powerhouse !","author":"Dj Mez ...","rating":5,"content":"Great sounding unit even at high volumes doesn’t distort made well solid portable device the DB lights are great can be turn off if you prefer battery life is great also has a timer feature that turns the unit off when not in use unit does have some weight as expected but not a problem overall very happy would buy again & recommend","timestamp":"Reviewed in the United States August 29, 2024","profile_id":"AGC42BUGERO35QERWKRFDJ3YYIAQ","is_verified":true,"product_attributes":""},{"id":"R2KZ6TK53LQEME","title":"5.0 out of 5 stars Love it!","author":"Meli S","rating":5,"content":"Purchased a JBL prior to this speaker and Tribit was head and shoulders better. Clear & loud, good bass too. Love how the lights indicate you’ve reached max volume vs JBL the sound would dip to tell you it can’t go louder.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AECNF2ACONMIYZDV34CUJFCFP6WQ","is_verified":true,"product_attributes":""},{"id":"R1QJZ8X07P9USA","title":"5.0 out of 5 stars Best bang for buck!","author":"Ross Martin Photography","rating":5,"content":"I have the little Marshall Emberton II which I love for indoor use, but needed something for outdoors that had more bass and overall volume capability. The first time I fired up the Tribit StormBox Blast at the pickle ball court I was stunned by the full, distortion-free sound, deep and full bass, well balanced across the frequency spectrum. Great clarity without being harsh and vocals were excellent, not lost in the mix. It was as loud as we would want in a public setting yet was only at 60%. Later on my back patio it again performed superbly, nearly equal to a set of decent bookshelf speakers. Highly recommended, I don’t think it’s possible to do better at this price level after I tested 8 different portable bluetooth speakers recently.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AFEZLTMVXTWBOPZORNPQLBIYPBMA","is_verified":true,"product_attributes":""},{"id":"R2OMRN8REUTZEE","title":"5.0 out of 5 stars Wow - hard to beat","author":"Bayleaf","rating":5,"content":"Blew my expectations out of the water. I listen to a lot of genres, including EDM, small speakers never sound great for the baseline in EDM, this one sounds pretty good. I haven't turned it up real loud, but the bass at a reasonable volume is incredibly good.","timestamp":"Reviewed in the United States August 28, 2024","profile_id":"AF7WHX7MHJFNHP57PHJMZBQ6YCHA","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:02","page":2,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=2","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=3","asin":"B09PMYTJD2","page":3,"pages":107,"reviews":[{"id":"R1OC6YL10QZ57F","title":"4.0 out of 5 stars Not 30 hours at full volume","author":"Javy","rating":4,"content":"First off I preface this by saying I kept this because I do like it. Its not good at full volume, its trying to be loud but you end up turning it down slightly. I was excited about the 30 hour battery life. It is non existent at full volume. I got about two hours. If the volume is at 50% or less, you should get at minimum 6 - 8 hours as I got that when I used it on the beach. As far as being waterproof, I can say its definitely splash proof. I used water to wash out the sand from the subs. I enjoyed it except for the 30 hour claim I wish hey were honest about it instead of bragging about it like that's the norm and the full volume aspect sucks. Buy it if you can live with that.","timestamp":"Reviewed in the United States July 21, 2024","profile_id":"AETB5LBTPI4TSF6BEQCWFAJIQBAA","is_verified":true,"product_attributes":""},{"id":"RD83JM4737ATH","title":"5.0 out of 5 stars Top sound, hats off","author":"Just a player","rating":5,"content":"I write reviews. But this time I can't say anything.In short.I worked as sound engineer in a studio for 6yrs. (never do that if you don't want to die young). I know all the shortcomings of a general consumer BT speaker. This one literally blew my mind. It's amazing what they can do this days. Just lie down on your bed, set this speaker against the wall in front of you, by your feet, and close your eyes. Don't ramp up the volume. Put on a record of Nina Simone, or something like that. You will see.Cheers!","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AGTM7GAE4SB45EQCVO32PN3TQUIQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R3NQK0E2XKBW0L","title":"5.0 out of 5 stars Great sound quality","author":"Michael Donegan","rating":5,"content":"All I can say about this speaker is that for the price,build quality sound quality battery life plus the app so you can adjust it to however you like listening to music,me personally I don't think any other brand out there including JBL can come close to this speaker.I have the JBL boombox the original one paid over 400 bucks 4 years ago for it,gave 150 for the stormbox blast and it's hand's down a better sounding speaker than my JBL I highly recommend the tribit to anyone not wanting to spend a ton of money because you want go wrong with this on.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AEO4THELRMQLVWBR3REAVGXTFSQA","is_verified":true,"product_attributes":""},{"id":"R36WXX5RMJOB1R","title":"5.0 out of 5 stars Unbelievably awesome sound!","author":"Kindle Customer","rating":5,"content":"Absolutely the best sounding Bluetooth speaker that I have ever heard hands down!The death of the bass actually makes vocals sound amazing!It makes JBL extremes sound horrible and best of all the lights are phenomenal!If you need a speaker get this one!","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AFHU7IK6JCVYC36TVF6KMO6DELWQ","is_verified":true,"product_attributes":""},{"id":"R1KEPSWHJ1ZKCJ","title":"5.0 out of 5 stars Calidad en sonido","author":"Alex","rating":5,"content":"Exactamente lo q andaba buscando, excelente calidad de sonido, es la mejor relación calidad/ precio que haya podido encontrar. Muy feliz con mi compra","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AEVR6POEF6ZQFNO2ATDZO6TSQVIA","is_verified":true,"product_attributes":""},{"id":"RMU96WM25TN7E","title":"5.0 out of 5 stars lots of good features","author":"MW","rating":5,"content":"The main reason I bought it was I think it has the most durable charging system available for non removable battery. The mico and type C just won't last like this one will. The sound and range are great for the price range too! Can't ask for more. I don't see anyone being disappointed.","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AGYKZEE4MQWQWW4QAJS7R4FPIBUA","is_verified":true,"product_attributes":""},{"id":"R4N1ATYTFH3UB","title":"5.0 out of 5 stars Best that I have played or have had","author":"Myrphy30","rating":5,"content":"This thing is amazing there is nothing I can say that's actually bad about it it's an amazing boom box I put two in back seat just for the fun everyone ask what subs do I have when I show them it's just the the boom box they are like yeah right now.way if u like the bump u can't go wrong it's a beast of it's own get one of u don't have one !!!!","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AHWLIDKWYLGBIQBL5ESOXCFHQLKA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R26J59AFEVFO2H","title":"5.0 out of 5 stars Impressive sound and good battery life","author":"Megatron","rating":5,"content":"Over all I really love this! Sound is great at low or high volumes. High volume is LOUD! Love waterproof aspects of this. We use it on our back porch and it has not skipped a beat no matter the southern USA heat or storms. My only suggestion would be the ability to further dim the lighting on the front. Not much more than bright and off. But I am being VERY picky to get to that. Definitely would buy again. Great for the beach/pool also! Easily loud enough to play music outside for birthday party.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AHVSEWR63IPIVR6JMYDIDCBS5VWQ","is_verified":true,"product_attributes":""},{"id":"R1NH2JI2VQU9HD","title":"5.0 out of 5 stars Big hit!","author":"my5nardis","rating":5,"content":"My son bought this first. We liked it so much that we had to get our own. We use this all the time. Around the house, the beach, and my son takes it to football practice to listen to in the locker room. It connected so easily. It sounds great and it’s easy to carry around.","timestamp":"Reviewed in the United States August 13, 2024","profile_id":"AHMK4ZHGE5P7VFB4VWUEWSKHF7JA","is_verified":true,"product_attributes":""},{"id":"R14X2ZIS4GK5CS","title":"5.0 out of 5 stars INSANE BASS","author":"Amazon Customer","rating":5,"content":"This thing shakes the walls in my bathroom when I play loud music with bass (on xtra bass mode). Great for house parties or outdoor activities. It is NOT what I would consider \"portable\" as it is very heavy and big. It can be moved around but not great for hiking or anything like that. Good for pool/indoor parties, outdoor practice/workouts, etc.","timestamp":"Reviewed in the United States August 5, 2024","profile_id":"AGH5XAJCNRG3UEOSU4NLHB4KKJJQ","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:05","page":3,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=3","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=4","asin":"B09PMYTJD2","page":4,"pages":107,"reviews":[{"id":"RSSC68V5SGPTS","title":"5.0 out of 5 stars Blew my socks off absolute power house","author":"Lance Simon","rating":5,"content":"I can’t stop smiling this thing amazes me it’s so loud and absolutely pounds for its size and at first I didn’t care for the design just bought it because I researched the heck out of these speakers to find the best one under 200$ and once I turned it on I loved it and it’s very heavy which I like I’m big on sound quality and although it’s not considered top of the line to some I think it’s second to none for its size and price just buy it you’ll love it it’s amazing","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AGNJZFQE2HNVCYRHF6P3JTCCF7LQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RUQSG5ZUMXB8D","title":"5.0 out of 5 stars Great Bass, Good Battery","author":"jw1802","rating":5,"content":"Great sound and battery life","timestamp":"Reviewed in the United States September 6, 2024","profile_id":"AFU23D5Y5VOXHS6QA4M36AAZNIMQ","is_verified":true,"product_attributes":""},{"id":"R5CJNHEH7HKNO","title":"5.0 out of 5 stars It works great!","author":"James Griffith","rating":5,"content":"It is a beast that really puts out the sound..the extra bass is bad to the bone! All i can say is buy one and crank that bad boy up!","timestamp":"Reviewed in the United States August 18, 2024","profile_id":"AELM4CAWQTAOBRFVCM23XAW5TOVQ","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RWH9U3W5UQ8FY","title":"4.0 out of 5 stars Good sounding bluetooth speaker. Worth the $$$","author":"eric","rating":4,"content":"Just received this bad boy today. Turned it on turned on the xbass button. Downloaded the mobile app and straight to listening some 90s r&b hip hop mixes and i must say im blown away by the overall sound and aspects of this bluetooth speaker. Chose the rock setting on the equalizer for now no complaints. Ive been researching bluetooth speakers for about a week now. Put it in my save for later for $199 because im waiting for my beats pill xl recall money for $329. And then yesterday i saw that they lowered the price to $150 for 24 hrs so i pulled the trigger and glad i did. Still playing around with the eq customization","timestamp":"Reviewed in the United States July 13, 2024","profile_id":"AHBA2ZNYZLINCA4IEDLZOB7AEZFA","is_verified":true,"product_attributes":""},{"id":"R210VG03GUPL4G","title":"5.0 out of 5 stars Quality","author":"John T.","rating":5,"content":"It has more power than I imagined. Great looking, great sound . The bass is awesome. Very satisfied. Thanks for a user friendly, high quality sound speaker.","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AE53BZLBWCUWDJO3RICTT3RJHG4A","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R31R54V3YVDVS2","title":"5.0 out of 5 stars Beastly Box with great low frequencies. App EQ availability is a plus","author":"Vic","rating":5,"content":"The media could not be loaded. Over the years I’ve own many speakers from small to large. I was also a nightclub stagehand and sound guy for years and now with technology getting better and better everything that you use to have to pay an arm and leg for you can get for a fair price. I always wanted to get a bluetooth speaker that has it all, this one is for sure “bang for your buck”. A great value for sure. I’ve had it for about 2 months and I hope it’ll last. Time will tell, but I’m still smiling from the day I took it out of the box. I listen to music everywhere and when my living space tv’s sound got dull this added so much life back to the experiences while watching shows and films. I’m thinking to myself if this was out a half decade before it would of been an easier decision to not spend sixteen hundred on a home theatre system.Out of the box the EQs are not for everyone, pretty good for what they are. Being able to adjust it is a smart move on the company’s part. I included pictures of a universal “U” shape eq setting if you think the “music” or “xbass” eqs are lacking in the highs. this will bring the out bass without drowning out everything else. It’s a nice balance for most genres that need the low and high end to shine (dance, hip hop, latin, meditation, rock).Weighs about 12-15lbs.The battery life claims are probably based on lights off with volume on lowest setting, which isn’t a lie but useless, unless you’re in a sound proof room.With 2 nights of full sleep without interruption I get about a good 16 hours on 30% volume on charge with lights off on my u shape eq with heavy bass before the low battery warning comes on.Updates through the app are easy and simple. The lights are fun but basic with only two settings. Hopefully they add more later. I love this speaker and have nothing to really complain about. I don’t mind the look, feel, weight, size, or anything about it, but the low battery warning has me a little annoyed. I’ll let you know the reason.My wife has high anxiety and we play relaxing sleep beats or sleep frequencies for her to doze off to most nights. So this is a heads up for anyone who wants to use this to bed. When the battery is low, It will constantly let you know with a voice warning that will interrupt your sleep. It a nice feature to have but I got annoyed because for people who use it for sleep like I do you’ll be rudely awaken to shut it off or plug it in. It’s not adjustable in the app. I’ve ask the manufacturer if they’ll include it in the future, and they just stated it’s built in for the user to know the battery is low. My guess is it’s to prolong the battery and keep it from draining all the way for future fails. Not a big deal still a great speaker with lots to love. I have taken it out to the parties, parks and beaches(where my last favorite speaker the 70w w-king x11 would be competing for space, especially against crowds and waves sounds) I am actually going to buy a second one to have stereo pairing. I think the sounds for the price would be great and more portable then a jbl party box 100.(Also try to produce music on the side check out it out on Spotify, Apple Music and here on Amazon Music. MAZARxSKUNK )","timestamp":"Reviewed in the United States December 19, 2022","profile_id":"AGGG2F4RAAUKZ6RGRZDK7FXRP2ZA","is_verified":true,"helpful_count":65,"product_attributes":""},{"id":"R2J2CZ6OY9ZTMX","title":"5.0 out of 5 stars Very impressive","author":"Me","rating":5,"content":"Recommend over Sony products hands down. Very strong sound. Highly recommend","timestamp":"Reviewed in the United States August 30, 2024","profile_id":"AGSY5VOMWZAU6LTAJL4ECWJNE4FQ","is_verified":true,"product_attributes":""},{"id":"R27PYPDK3106FD","title":"4.0 out of 5 stars Excellent sound for the price","author":"Lawrence Gladnick","rating":4,"content":"You will not get better sound that is this loud for the price. The speaker is an excellent value. I've always had JBL products which are great and do sound slightly better but for 3 to 4 times the price. I tried the soundcore which was great but didn't have the thump this speaker has. It is very heavy as other reviews stated so use case is very important. If you want a portable speaker to go on hikes this is not the speaker. It loses 1 Star for looks. It is not the best looking speaker.","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AGS7AWTHRMFGXLEOCTX7567HK5ZA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"RKKW2IP2ZTRW2","title":"5.0 out of 5 stars Power…Lots of power and bass…👍🏾","author":"Kilbert Ruffin","rating":5,"content":"I use this product for backyard, parties, picnics, and everything else that you can use for music great product by Tribit👍🏾","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AHYQJM4J55AE5HTGDQN4MR4P6WRQ","is_verified":true,"product_attributes":""},{"id":"RN6463Y9YIR2D","title":"5.0 out of 5 stars OUTSTANDING!","author":"John Cowens","rating":5,"content":"This speaker system is incredible! Sound quality is near perfect. Crank up the volume and get blown away without distortion. I love it!","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AHNF6IFEWLS2NERP5HPYE7J2XNVA","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:06","page":4,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=4","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=5","asin":"B09PMYTJD2","page":5,"pages":107,"reviews":[{"id":"R2XOBZQ6PTKTQ9","title":"5.0 out of 5 stars I'm impressed","author":"mullo2012","rating":5,"content":"The sound of this Tribit speaker is out of this world, 5 star I give it all the way.","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AHOEVQJW7ZJ6YR2WXVHUWG5ZEBRA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R3O1NN5V41U7WQ","title":"5.0 out of 5 stars Excellet sound ->Great value. This speaker sound and looks great.","author":"Brian Alan LeBlanc","rating":5,"content":"My wife wanted a new bluetooth speaker that had great sound, was portable and simple to use to replace her ($200) Bose-mini that stopped working. I have a $500 Bose speaker and the Tribit StormBox Blast Portable Speaker sounds pretty close to the output of my Bose that cost 2.5 times as much. I'm very impressed with the Bass and quality of sound. It's simple to use, has a charging port for your phone, etc. For $200, this delivers, so don't hesitate to buy it. Can't vouch for longevity, but it's a solid speaker with a bit of weight to it, but for the battery life it provides, I'll gladly live with it......or my wife will!","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AHMCQ7ZR2QY22ZWIGPFB7UBYRFEA","is_verified":true,"product_attributes":""},{"id":"R2EVLJGC8WIJAM","title":"5.0 out of 5 stars Great Sound with Power","author":"Danny C","rating":5,"content":"Great speaker if your picky! When it comes to portable sound, I have to say I'm inexperienced. I have my house full of speakers and amps, and only two small blue tooth speakers I rarely use. I needed something I could use in the garage and to take camping once in a while. Something with decent sound and some good bass. I found it. It took three tries including 2 returns, but I did it. This speaker fits the bill. Very good sound and lots of bass. I know there are better boom boxes out there, but for 160.00 this box surprised me. It ticked off all the wants. The only drawbacks are its weight of 12 pounds and no shoulder strap. It only charges up with 110 a/c. Other than those small gripes, it's a winner. Oh, the 90 watts is very loud and clean.","timestamp":"Reviewed in the United States June 19, 2024","profile_id":"AHVKUGQW6E6ZDF4GY4BKI4Z6TRKA","is_verified":true,"product_attributes":""},{"id":"R1T8V3SWXBZDY","title":"5.0 out of 5 stars Surprisingly great sound","author":"Donn Burns","rating":5,"content":"Excellent sound and range, well built/solid, easy to connect to phones, and beautiful LED lights...","timestamp":"Reviewed in the United States August 24, 2024","profile_id":"AEBG4TVTEJANPC4QAPDHXT7JRLAQ","is_verified":true,"product_attributes":""},{"id":"R3GSAFD7NII8M2","title":"5.0 out of 5 stars Nice","author":"Jonathan Krueger","rating":5,"content":"This is a nice ass speaker. Loud. Kinda heavy, but lasts forever and is LOUD.","timestamp":"Reviewed in the United States August 27, 2024","profile_id":"AGFAABRNHHMMIBAPVH7R3W6V3LSA","is_verified":true,"product_attributes":""},{"id":"R1Y4S8B1INUZE4","title":"5.0 out of 5 stars Sound","author":"John Szymkowicz","rating":5,"content":"Sounded great while golfing.","timestamp":"Reviewed in the United States August 31, 2024","profile_id":"AG2JVOZUL2OSYJC6RC7SNRENM45A","is_verified":true,"product_attributes":""},{"id":"R3HY59XKGFTYC","title":"4.0 out of 5 stars Provides excellent sound and bass....","author":"Richard","rating":4,"content":"Needed a shop speaker , after all the reviews this was ideal for use... Fills a huge garage with clean sound all the way through and powerful enough to still hear in a very busy LOUD shop, not disappointed !!!!! Will also be bringing this to my camp as i will pick up another !!! Price per sound it was a great deal.....","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AEHUHFW27ATV6ZECWPH3L5RCOGDA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R1ELSYEC5GSOY","title":"4.0 out of 5 stars Nice","author":"Scott","rating":4,"content":"Wish it was a bit louder. Good sound","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AEGZ54WQUERW66DEWABCTUZFIYMA","is_verified":true,"product_attributes":""},{"id":"RWPG3KX9EJRPD","title":"5.0 out of 5 stars AI did not help me write this review, but it's true.","author":"Michael J Veschio","rating":5,"content":"The media could not be loaded. The Tribit StormBox Blast is a sonic powerhouse that defies its size, unleashing an earth-shaking bass that will leave your jaw on the floor. This beast of a Bluetooth speaker doesn't just play music; it commands attention with thunderous lows, crystal-clear highs, and a volume that could drown out a jet engine. Built like a tank and armed with mesmerizing RGB lights, the StormBox Blast transforms any space into an electrifying audio experience. Whether you're throwing the ultimate party or simply craving chest-rattling bass, this speaker is nothing short of a portable sound explosion.","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AGPB6MKPLPWCUJ4SFVNZ6SVFYNMQ","is_verified":true,"product_attributes":""},{"id":"R10V0XMWYU58EE","title":"5.0 out of 5 stars Best bundle deal for your money","author":"Johnny Camacho","rating":5,"content":"I bought the bundle it came with the Tribit storm box and the little speaker that kinda looks like the pill by Beats by Dre. Anyways great deal great sound take my word for it I’m a Dj when I say it sound quality is really good I mean it. And you can link them together in stereo mode. Check out the YouTube reviews I think this little bundle Bangs!!!!","timestamp":"Reviewed in the United States July 10, 2024","profile_id":"AEWQ22BOMYFZ2OXA634THGS6FAVQ","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:07","page":5,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=5","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=6","asin":"B09PMYTJD2","page":6,"pages":107,"reviews":[{"id":"ROCCN93DO2NGM","title":"5.0 out of 5 stars Outstanding sound and volume","author":"Amazon Customer","rating":5,"content":"I’ve now had this for close to two years and use it frequently. The battery last pretty well depending on the volume. I’m always surprised at how loud and clear it can be, and I rarely crank it even in pretty large spaces with people. The sound is very good overall including having good bass, and I’m someone who has subwoofers in my home/vehicle/boat. It made a slight rattle with one woofer one time but it was extremely cold, probably 10 degrees Fahrenheit. Outside of that I’ve used it in lots of cold weather during Michigan winters. I’ve also used it at a lot of tailgate parties around dozens of other tailgaters and it was loud enough to drown most other stuff out when needed. Overall I love it!","timestamp":"Reviewed in the United States June 11, 2024","profile_id":"AFVFQLGZUC4UHRKMHMJDVLM6RCBQ","is_verified":true,"product_attributes":""},{"id":"R2WC2WCML2XSRA","title":"5.0 out of 5 stars UPDATE: The sound is very good, bass is superb, controlable.","author":"bobj90","rating":5,"content":"i USED THIS OUTDOORS IN THE MIDDLE OF MY YARD AND THE BASS STILL SOUNDED punchy. Most speakers loose bass because they do not provide enough power. The Tribit has the power needed.This is the first BT speaker in it price range that has blown me away! I like my JBL Extremes but would trade them for this any day.Battery life is not what is advertised for any volume above 20%. For the sound that it puts out at 40%, this is understandable. It maintains the bass up until ~80%, then loses some to prevent distortion. It is LOUD at 3/4 volume level.One thing I like about Tribit speakers is the designed ability for the speaker to be tilted back. This prevents any sound interference from bouncing off the flat surface this may set down on while playing. It makes a difference.The X-bass button is really not needed with this speaker and a decent music source. The bass punches with zero distortion at most sane listening levels. People complain about weight...really? This thing puts 90w of very good sound quality at volume. That means a heavy battery and speaker magnets. I like the lights which can be turned off. It pairs easily with all my devices.These can be paired according to the manual, I do not have a second one to test this. I do NOT use the app, I just use an MP3 player app with good EQ. I do not know if the app is required to pair two of these. Two of these paired is all anyone one would need to throw a house party.","timestamp":"Reviewed in the United States April 4, 2024","profile_id":"AG2LCLUMWAG5OXMTYYZIMIBTBVWA","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R2JHF7HRXV0K82","title":"5.0 out of 5 stars It took me about 5 minutes to fall in love with this speaker","author":"JC-Austin","rating":5,"content":"The 'bang for your buck' with this speaker is incredible. It just arrived today and I haven't stopped listening to it. The bass it puts out is just incredible. Pop, rap, and country all sound incredible both inside and out. Highly recommended!","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AHZMDLCA24OXSO3MWL6AEEF2LFFA","is_verified":true,"product_attributes":""},{"id":"R2ITQXMM7YAZD0","title":"5.0 out of 5 stars Impressive!","author":"Monica H.","rating":5,"content":"Worth every penny! Excellent sound quality and LOUD, with more bass than you could imagine.","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AFOHZT576VLDFZIMDM5CPCZOWEJQ","is_verified":true,"product_attributes":""},{"id":"R1S06Q8TXTPNAE","title":"4.0 out of 5 stars Update: Battery bad","author":"Chris Chesher","rating":4,"content":"Worked great for the first couple months but then the battery won’t charge at all and only powers on if plugged into an outlet. The unit is only 3 months old. They should last longer than that. I would not recommend the Tribit Stormblast.Update: I contacted support, they sent me a new unit. Fingers crossed that the battery lasts on this one. Great customer service, no hassle at all which is far and few between these days. Thanks","timestamp":"Reviewed in the United States June 23, 2024","profile_id":"AFJLUWB3GEMO3SKZ66MNZRU33PQA","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"RIT5FM9JRCNI","title":"5.0 out of 5 stars Excellent","author":"Nano","rating":5,"content":"Good sound with great clarity and above all great sound powerrrrrr.","timestamp":"Reviewed in the United States August 20, 2024","profile_id":"AEUHKYPLRLYKNTER4LQDI6XI6DNQ","is_verified":true,"product_attributes":""},{"id":"RI6CFM0PDP2P","title":"5.0 out of 5 stars Great sound quality with excellent bass boost","author":"Emma Hignite","rating":5,"content":"The bass boost is the best for the price. Very user friendly and excellent connectivity. The only negative is the weight. It is not easy to Carry when you have other things to also carry.","timestamp":"Reviewed in the United States July 30, 2024","profile_id":"AGSFTUUCXEJTQH27VLF4JCB2KRSA","is_verified":true,"product_attributes":""},{"id":"R16NGJ100SS4QV","title":"4.0 out of 5 stars Great room filling sound!","author":"daa69","rating":4,"content":"Sound is pretty good for a speaker this size. Weight is nowhere near as bad as some reviews make it out to be, u can carry without an issue, and you can always figure out a strap for it, i used one from a wking d7, which this is only slightly heavier than, use your imagination! I would say this one is better indoors and placed in the right place, gotta experiment, outdoors is ok but if out in the wide open you lose that bass reflection, but that would be the same with any speaker. I don't care about lights, wife likes them, whatever! The app is kind of lackluster, I don't even use it, i have an eq in my phone that works through Spotify so no need. Biggest disappointment for me is the battery, they claim 30hrs, we all know not to ever expect that, however, i used 80% after 12hrs at about the 50% volume, with xbass on, half the time was with lights on. There's no situation i can see myself playing this thing at a much lower volume in order to get close to the 30hrs. All in all, i would say it's a decent speaker, probably one of the best in this category of total portability, you can realistically take it anywhere, whereas the next step up is like a pathfinder or something which is much more bulky and much less portable. I'm ok with it at the $150 mark but at the suggested $199 my opinion drops a little bit, however, for the price of one jbl you can have two of these and you're gonna be a much more satisfied listener! Update, picked up a second one, sounds pretty dang good, especially in a decent size room, you can have a pretty good house party with these things, i set them up diagonal from each other in the corners, facing each other, completely fills the room, and the bass reverb is awesome, you can definitely feel it!","timestamp":"Reviewed in the United States December 24, 2023","profile_id":"AHJUKLY33QDOC47SQWLMOXMHHVEA","is_verified":true,"helpful_count":3,"product_attributes":""},{"id":"RFLO6TKW8YGEQ","title":"5.0 out of 5 stars Great speaker","author":"siouxzanne","rating":5,"content":"Excellent speaker great bass though I ordered 2 and one speaker the battery would not charge.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AH2JLKFCTWGTG7FLYJQK4O32XT4Q","is_verified":true,"product_attributes":""},{"id":"R3VNSQKGCI0XSV","title":"5.0 out of 5 stars Nice!","author":"Mert","rating":5,"content":"I,m very impressed with the sound and its built like a tank. The lights are cool, but if don't want them on, just push a button and they're off. The controls are easy to use and the battery will last all day. I'm very happy with my Tribit StormBox.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AGXD7KVULOEAMC7BE7VCOE3U73UQ","is_verified":true,"helpful_count":1,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:08","page":6,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=6","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=7","asin":"B09PMYTJD2","page":7,"pages":107,"reviews":[{"id":"R2BHU5KJFIVNO6","title":"5.0 out of 5 stars Awesome!","author":"Renauldo Hawkins","rating":5,"content":"This speaker is amazing! Tested it against a Bose Soundtouch 20 ($400 speaker) and it beat it in clarity, bass, and volume. Simply amazing!","timestamp":"Reviewed in the United States July 29, 2024","profile_id":"AHQC4Q3MJE5HR3IV2T65Q6F5W62Q","is_verified":true,"product_attributes":""},{"id":"R51Z65I8OSWJ8","title":"5.0 out of 5 stars Like it so much that I own two.","author":"David Cox","rating":5,"content":"Love this item!! Sounds great! Great battery life. No connectivity issues at all. Like it so much that I actually own two. It’s not a lightweight though.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AFMIFDS6XP36OTN7YOPQ7BETTJHA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R11JXENB7E0A9E","title":"5.0 out of 5 stars sound","author":"Tom","rating":5,"content":"awesome sound","timestamp":"Reviewed in the United States August 19, 2024","profile_id":"AFSC6OVA7GTX5QGDRJIMW7RP7PYQ","is_verified":true,"product_attributes":""},{"id":"R1CNAMA2II6CGX","title":"5.0 out of 5 stars Unbelievable sound","author":"D. Redwine","rating":5,"content":"I am still in disbelief at the quality of sound that comes from this portable speaker. I was not prepared to be this impressed. You better believe it is heavy though. IF you are looking for something light, this is not it. If you are looking for unbelievable sound from a portable speaker then this is your ticket. Of course the amazing sound and impressive battery life are heavy. But man, what a speaker!","timestamp":"Reviewed in the United States June 28, 2024","profile_id":"AED56HPMVMJY37XSDINMI2LPKZRA","is_verified":true,"product_attributes":""},{"id":"R29WKXRG4IXW1X","title":"5.0 out of 5 stars Nice sound","author":"J. L.","rating":5,"content":"Awesome bass. I wish I had two of these.","timestamp":"Reviewed in the United States August 11, 2024","profile_id":"AHZ3DS33JNGEKRUNFOKCGC5FQ5HQ","is_verified":true,"product_attributes":""},{"id":"RL4TVTCHOYPQZ","title":"5.0 out of 5 stars Impressive","author":"Twin#two","rating":5,"content":"Product:Great price- impressed my husband. Great quality sound. easy to use . It is a little heavy but for the quality of sound it’s worth it.Shipping is a concern. Beware!They shipped it in its original box- just placed a shipping label directly on it. I’m lucky I live in a honest neighborhood.Overall, I’m extremely happy with this purchase. We have been looking for a sound system for 6 monthsVery pleased with product- not the shipping method","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AE6RNGE4R23PE3EOH3CKV4YATELQ","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R3GXJG36GZIOMA","title":"5.0 out of 5 stars It’s a great speakers","author":"Kenneth","rating":5,"content":"I mean brands like these… You’ll never get wrong on getting any of these speakers it’s just depends on your budget really but any of these speakers are great in their own way.","timestamp":"Reviewed in the United States July 16, 2024","profile_id":"AFOUBFKDEOXENP3NDO2SOPOA36VA","is_verified":true,"product_attributes":""},{"id":"R3CWRZVPEGCGF1","title":"4.0 out of 5 stars Wow","author":"Adventurer","rating":4,"content":"Amazing bass. Just wish there was a physical input for audio instead of just bluetooth.","timestamp":"Reviewed in the United States August 1, 2024","profile_id":"AFFM6VMBQRWPTFFYAPXZVWDSG2XA","is_verified":true,"product_attributes":""},{"id":"R4YF106HU3JZI","title":"5.0 out of 5 stars Amazing","author":"Joseph harris","rating":5,"content":"I had a problem with the battery and the company fixed the problem immediately I highly recommend this speaker not only is the speaker excellent the company stands behind what they put out","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AFWVBYZQV2OS4PNUXWGDJHNCXRBQ","is_verified":true,"product_attributes":""},{"id":"RK9TAGZ3LKJ3","title":"5.0 out of 5 stars Arrived next day","author":"JGReen","rating":5,"content":"Quality product,1 day shipping","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AEZJRYLZ6RQGVKQTFPQFY4CA4ODQ","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:09","page":7,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=7","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=8","asin":"B09PMYTJD2","page":8,"pages":107,"reviews":[{"id":"R3LTT3WIA44GYK","title":"3.0 out of 5 stars Sounds good, looks like dairy air.","author":"Mr Difficult","rating":3,"content":"This sounds very good for the price. It's the sonic bargain of Bluetooth right now, truly. Useable app EQ (which you'll need for it to sound it's best, flashy lights, and at least as portable as a medium dog with a handle on it (it's super heavy, for no perceivable benefit to sound relative to other decent-sounding speakers). Nothing this size is ever going to sound truly amazing, but what does come out is relatively impressive - nice job engineers. It does not sound good enough to excuse how hard it is to look at it. It's ugly. Ugly. Alpha. Foxtrot. It is definitely a box, and it has a little boom, but calling it a boombox is an insult to the likes of a JVC RC-M90. This whole class of speakers look like the interior of a 92 Camaro, but this one is . . . extra. Extra big, extra bulky, extra tacky plastic. This thing ought to give me prize tickets when I push play. How about we lose the lights (it would sound as good without inducing seizures) and pay for some designers that didn't spend thirty years at Fischer Price wishing they could work in black.","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AH4IK33PEHKRAWZCXKDSIJDENERQ","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R1B4PKLL3LXYVW","title":"5.0 out of 5 stars Amazing sound…..","author":"SouthernLi","rating":5,"content":"Awesome portable speaker. Amazing sound, cool lights, price point was just right for us. Gave to my hubby for Father’s Day & he’s loving it so far. Tribit is a good brand for the money. Bought a smaller Tribit speaker about seven years ago & when the sound on it started to go, we got this speaker. Does have some weight to it like an old school boombox but you won’t be disappointed with this speaker.","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AGY6LDCUIQRQXSRFN56XCTPLFI5A","is_verified":true,"product_attributes":""},{"id":"R1XKDWEJGKZJQH","title":"5.0 out of 5 stars Awesome speakers for EDM music with amazing bass!","author":"D. McEntire","rating":5,"content":"I am a huge EDM fan and love the bass many of the tracks have. The speakers I was using in my garage just really didn't cut it, so I started doing some research and came across this one and decided to give it a try.Honestly, I wasn't sure what to expect because I've never heard of this company, but I am so glad I did. The speaker sounded pretty good when I first powered it up and paired it. I thought it would have more bass but was happy with what I heard. But then I saw the \"Xbass\" button on the top and after pressing that -- MAGIC happened and the music flowed with clarity and deep bass like I haven't heard before in a small portable speaker setup.It really has impressed me and sounds amazing, and the LEDs are also fun. I do recommend installing the app and linking it to the speakers, because the 2nd LED option I think is better visually, but that's my opinion of the color patterns.I've been using it for a while now and the battery is still over 95% so I have no idea how long this will last but it's clearly a long time!I'm glad I bought this one and will be getting one for my brother for his birthday.","timestamp":"Reviewed in the United States March 13, 2024","profile_id":"AEKP7K7G62IHTOPZ6NID5XK6GJ7A","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R3PHITV2XDUZ0A","title":"5.0 out of 5 stars best sounding toughest BT speakers I have had the pleasure to use","author":"Lois Kamla","rating":5,"content":"I found them to be a bit heavy but then you have to expect that with a battery pack and run time like this !every thing thing else about them is a hit above the rest, they have the best sound for there price range and even above it the base boost really works !! and they are tough as the hubs of hell, I had one fly off the roof of my CANAM at about 30 MPH on a sharp corner when I realized what happened and picked it up there was only minor scratches and it plays just fine today.only other thing that might make em better is to also have a USB charging capability.these are with out a doubt the best BT speakers I have ever owned and Iv had a few.I will be buying more of these, just waiting for the USB charging model.Jeff...","timestamp":"Reviewed in the United States May 11, 2024","profile_id":"AE7C643U7DBGHVY35EZJXMZF2KCQ","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"R3N3VLP49J4C5","title":"5.0 out of 5 stars Amazing For the $$$","author":"Brent James Pourciau","rating":5,"content":"Ok let me first start off by saying I generally put a ridiculous amount of researching multiple brands and different variations of products before purchasing it. Now with that said I can confidently say I made the right choice. I had never heard of Tribit but the reviews outweighed all else so I got it during a lighting deal. Now I already own a Bose sound link and a Bose mini sound link an both of those sound quite good for their size, as expected for a name like Bose…so yesterday after my speaker that sat on the charger 2 nites prior finally got turned on an I was greeted with a pleasant power up cycle of musical key notes instead of the typical bleep, I went into Bluetooth on my iPhone an there it we’d already in there I guess on 1st time pairs at goes into pairing mode so ya super easy…then I connected it to the app I downloaded out the Apple Store which allows you to have a custom EQ or several presets including the X bass feature which is certainly noticeable depending on the song. You can change the synced light show in there see the power status remaining snd so on…I saw a prompt to upgrade to the latest firmware ED. So I did very simple an fast! Now onto the sound I’ll make this easy coming from a musician an audiophile, the Mids are good not great but very exceptional the lows are pretty impressive for a Bluetooth speaker the Highs are well above average for a speaker in this price range and class . I played it for About 2 plus hours steady with the light show an making changes all throughout an at power off it still had 83% remaining, an I was romping it! To sum up I believe I made the right choice…I can’t see where I would find a more powerful great sounding relaxing or partying up Bluetooth speaker anywhere else for this price and be just as happy. If you’ve never really trusted in reviews before let me assure ya I’m extremely scrutinizing of products before purchasing’ don’t worry about researching any further if this is the type of product your looking for fun at the beach or Chilling at home then believe me when I say your search is over! There are many speaker types out there that look similar to this and I’m glad I got this one! Hope This helps your decision making.. God Bless","timestamp":"Reviewed in the United States June 6, 2023","profile_id":"AF7C2UJ4JJUFTF7EF5MFSLYYOU6Q","is_verified":true,"helpful_count":32,"product_attributes":""},{"id":"R29WJB922A1FY8","title":"5.0 out of 5 stars I'm keeping it anyway.","author":"Amazon Customer","rating":5,"content":"The media could not be loaded. I speaker shopped for a while. Small space so I need hard hitting base and I won't compromise on a full range dynamic sound either. Some of these, even highly rated or well known names, just can't give you what you need in a compact speaker. SUFFER NO MORE my fellow audiophiles this, hits on all levels. I was looking at Bose, Klipsch Nakamichi and so on but it was comments made in a Harman Kardin review that led me here. I've never heard this quality in such a small package. I had to order it twice. Not to have 2 of them but because the first one\"Got lost\" about half a mile away on a warm March evening. Long story and not mine to tell lol. Took it out of the box and it Bluetoothed right up. All devices with ease. The auxiliary works too. The sound, dynamic IS the word I would use to describe it. Outstanding sound. Beyond any portable speaker I have ever personally heard. Unbelievable. Buy this one if you're an audiophile, it will not disappoint you. Get this, I like it enough I'm not going to return it just because the lights don't work. I could care less tell you the truth. And this one was tough enough to get delivered.Get this speaker. I paid 150 with a 40 coupon. Worth every stinkin penny yes, even without the lights. Every penny.","timestamp":"Reviewed in the United States March 10, 2024","profile_id":"AFE6MS77NW3KA6VXEBLTX3DNIIPQ","is_verified":true,"helpful_count":6,"product_attributes":""},{"id":"RJY2NHU4RQMZ7","title":"5.0 out of 5 stars Loud, quality sound to fill your next party or outdoor boogie","author":"Forrest Ruby","rating":5,"content":"At first glance this thing looks a little cheesy. The rainbow light show on the front is a major feature of this boombox and I was hesitant to get it, despite the rave reviews about the quality and loudness of the sound it produces, because it doesn't look like something a man in his 30s would own. Having taking it camping, adventuring, and partying all over the last six months I can say honestly the light show is an attraction about this thing. The rainbow lights dance to the music and fill a dark space with some much needed energy, and it can be changed to solid colors that will change occasionally (though you don't control that), or you can turn them off entirely.That out of the way, let's talk sound. This boombox is loud, and it will easily fill a gathering of a couple dozen people in or outdoors. The bass is really powerful as well and it really takes the energy up a notch when people can feel the bass. It can be boosted as well if that is your preference, and I haven't yet found a loudness at which either the speaker drivers or the woofer plates bleed or cackle. This is a solid device that will deliver you very good sounding playback with the added benefit of powerful bass and an entertaining light show.It is deceptively heavy, because of the sizable rechargeable non-removable battery but the carry handle is built right into the frame for ease of movement. For the price of this thing you are putting yourself in the same range as comparable BT speakers from name brands that sell for 50-100% more. Coming across the review for Tribit on PC Mag was a great find, and I'm glad I gave this brand and box a try. My friends are converts as well and two others have already bought smaller models for their own use. I am a fan and will be proselytizing the gospel of Tribit","timestamp":"Reviewed in the United States October 25, 2023","profile_id":"AFMNVB43FKDWT6OVRHWZCWJZMPYA","is_verified":true,"helpful_count":14,"product_attributes":""},{"id":"R2ZXEY7IFNEG53","title":"5.0 out of 5 stars Its heavy and loud","author":"Keon B. Billings","rating":5,"content":"I was skeptical about the battery, life claims, and about the alleged base that this thing puts out. I can now officially say humbly and with respect that this thing delivers even more so than some reviewers claimed. The base is impressively deep and rich given the size of the speakers, and the battery life went for several hours for me without losing volume. I cannot attest to its acclaimed battery life, but it ran several hour for me, and I am more than happy with its performance.Don't go getting any bright ideas this single speaker can power your house party by itself fill the entire room with sound, etc. etc. It is definitely loud, it definitely have a lot of base for its size, and the battery life is impressive. However, please be realistic in your expectations. When you blast any system, no matter who makes it, Bose, JBL, Sony, beats, it doesn't matter. The higher you push the volume, the more battery it uses, and the shorter your playtime will be. That's just a basic fact of electronics and battery life.That said, this unknown company Tribit have a gem on their hands with this speaker box. I highly recommend it.As for the weight of this thing, I can only assume that it's weight is due to the charge circuit and electronics is inside the unit. Most portable units have a single USB connection that charges the device from an external charge adapter or some other unit plugged into the wall. In the case of this device, all those electronics are packaged inside the unit and seeing that it's enclosed, I'm pretty sure they use more beefy components than normal. That plus the accompanying batteries I believe added up to the weight. Knowing this information, I am more than happy because now I don't have to look for a charger adapter to charge my Bluetooth speaker because it's already inside, I just need to plug it in.If you have not already figured it out, I highly recommend the speaker. It's plenty loud, it's got lots of headroom for highs and lows, and they have great battery life. What more could you possibly want from a Bluetooth speaker?","timestamp":"Reviewed in the United States September 10, 2023","profile_id":"AGCEJWEO2GNQKVVNEHML3KYRUVXQ","is_verified":true,"helpful_count":15,"product_attributes":""},{"id":"R3TCCRG5UOR1YY","title":"5.0 out of 5 stars Sonido delicioso 😋","author":"Tiene un sonido muy bueno. Aún no he probado la autonomía de la batería.","rating":5,"content":"Un producto muy bueno. Ideal para escuchar música con lujo de detalles","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AFQOPXNG3ICBXGM567Y6QXFDVFEA","is_verified":true,"product_attributes":""},{"id":"R4PYEVVHRSF6Z","title":"5.0 out of 5 stars Nice","author":"Chuck","rating":5,"content":"I was pleasantly surprised at the quality of this speaker. The sound was loud and clear. Great for the outdoor patio!","timestamp":"Reviewed in the United States July 12, 2024","profile_id":"AFATDWQWTK35IV5WUFIU4QMK6IPQ","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:11","page":8,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=8","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=9","asin":"B09PMYTJD2","page":9,"pages":107,"reviews":[{"id":"R1IBQUYFKUTOTM","title":"5.0 out of 5 stars sounds clean and nice","author":"Herald Acosta","rating":5,"content":"very good quality","timestamp":"Reviewed in the United States July 28, 2024","profile_id":"AFGDDBLK5NE7SWEZCSC4ZN6SLRCQ","is_verified":true,"product_attributes":""},{"id":"R108O7KLI0M71L","title":"5.0 out of 5 stars Best boombox under $400","author":"Conner R.","rating":5,"content":"Easily the best value speaker, beats everything in this price range","timestamp":"Reviewed in the United States July 17, 2024","profile_id":"AE6OGMYEZ2UY3UB6PSS7GR4CNEZA","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R12VZZ5WLNUC8M","title":"5.0 out of 5 stars good","author":"tango","rating":5,"content":"Great sound, very natural, nothing to complain about at this price","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AFNU2XOWVXAKUVQ7DTMMWRG34YYQ","is_verified":true,"product_attributes":""},{"id":"R3G81LJAUISFTC","title":"5.0 out of 5 stars Tribit Stormbox Blast Portable Speaker","author":"Vera Thompson","rating":5,"content":"I love it as I have the little handy travel one and that is great! I was looking for a bigger portable stereo for my home with good sound and came across this Tribit and said can't go wrong here!! The sound for me is great and I LOVE the lights as extra entertainment. The charge period last quite a long time which is fantastic!! Definitely recommend this product. I took out a 2 year warranty just in case it was worth it.","timestamp":"Reviewed in the United States June 5, 2024","profile_id":"AFOKMSUUVBVXKOBSDZBTS7XCQJWA","is_verified":true,"product_attributes":""},{"id":"R3VXJ1CUO5TNNL","title":"5.0 out of 5 stars Great product","author":"Tammy","rating":5,"content":"Love it has all the parts","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AEGBBGRXZSYCESPGV7OOS7XW35PQ","is_verified":true,"product_attributes":""},{"id":"RQY6LLP2DFJ5V","title":"5.0 out of 5 stars Music","author":"Amazon Customer","rating":5,"content":"Lights and sound👍Entertainment","timestamp":"Reviewed in the United States July 20, 2024","profile_id":"AHHEL2WPN2RV7MXI7Q65KPZOLJTQ","is_verified":true,"product_attributes":""},{"id":"R3B10QDCYONG2J","title":"5.0 out of 5 stars Great Speaker","author":"Amazon Customer","rating":5,"content":"We have had this for a few months and use it for everything. Music around the house, on the beach, the pool. Sounds and bass is really great for a portable speake.","timestamp":"Reviewed in the United States June 27, 2024","profile_id":"AF3DVU77HLHBMQPF4UN5HVS4SDQA","is_verified":true,"product_attributes":""},{"id":"R2C5TFV5KQBM4J","title":"5.0 out of 5 stars Totally Rocks the House!","author":"T. C.","rating":5,"content":"Pairs very easily with my Galaxy S22 ultra. Has plenty of bass to spare, The phone app works well to customize the sound anyway you might like. It gets plenty loud inside and in smallish areas outside. It even sounds good with audio books.","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AGSHTYINM5WUN4AVWI7B3UPV2IQA","is_verified":true,"product_attributes":""},{"id":"R3AW2AY9OC2FO5","title":"5.0 out of 5 stars This thing THUMPS!","author":"Dirk Hicks","rating":5,"content":"The media could not be loaded. I was shopping for a replacement for my 7 year old Altec Lansing speaker and Reddit told me this was the bees knees. Well, +1 for Reddit because after this heavy beast arrived today, I paired it up less than 5 minutes after it came out the box and spent the next 4 hours jamming outside with my wife, kids and neighbors. I even had to text a link to my neighbor for him to check it out too. No regrets on this purchase. I only hope it last nearly as long as my Altec Lansing did.","timestamp":"Reviewed in the United States June 6, 2024","profile_id":"AFDW5D7OJ5NGC5TWKGWUAQOAU3PQ","is_verified":true,"product_attributes":""},{"id":"R21B93YK9RYCJB","title":"5.0 out of 5 stars Worth every penny!","author":"Christopher Moore","rating":5,"content":"Picked this up for my then 3 1/2 yr old Son because he loves music. 7 months later and it still sounds new. Amazing sound as well! It actually thumps. Clear vocals etc. LONG battery life! It’s never gone dead on us. And it has taken his abuse!","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AFU4YNKF7LKCBK5GHDSXQBSE6B3Q","is_verified":true,"helpful_count":2,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:12","page":9,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=9","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=10","asin":"B09PMYTJD2","page":10,"pages":1,"reviews":[{"id":"R19UIG762PMLPD","title":"5.0 out of 5 stars Impressive","author":"Amazon Customer","rating":5,"content":"Great speaker for the price","timestamp":"Reviewed in the United States July 14, 2024","profile_id":"AG3W2O2RJVG6ULR7EDWWRXXNXPKA","is_verified":true,"product_attributes":""},{"id":"RQ0KAAABTX2OS","title":"4.0 out of 5 stars Great Sound - Some Limitations","author":"Troy Dvorak","rating":4,"content":"If you want power and great sound in a small package, Tribit knocks it out of the park. I now own two of their products and am very impressed. That is the very most important thing, of course, when you buy stereo equipment. There is an app you can download that has an EQ which is nice.Sadly, the unit is VERY heavy. What in the world is in there? Second, there are only two lighting options on the unit. So I downloaded the app...only the same two options. Both options are bright and way to busy (multiple colors that sync to the beat). Tribit desperately needs to revamp this to keep up with brands like JBL and Sony. Their Bluetooth speakers allow for wonderful, adjustable ambient lighting. The Stormbox lighting is clearly designed for 14 year old kids having a party (or older people who enjoy inducing their own seizures LOL). Fortunately, there is a third option...OFF.Because the app did not offer any more lighting options, and because I use the EQ in my music app, I deleted the app.Overall, for sound quality, I highly recommend this. For those complaining that there is not enough bass, use the EQ feature on your music app or the Tribit app. You will be just fine.For portability, I do not because of the weight. The lights are also very annoying.Finally, for those complaining that there is no radio, try reading the product information before you buy!!","timestamp":"Reviewed in the United States October 15, 2023","profile_id":"AH4F6BGQJMB6XW5TJLLUM55BQV7Q","is_verified":true,"helpful_count":4,"product_attributes":""},{"id":"R2GLIORS2U2BND","title":"5.0 out of 5 stars Really great speaker!","author":"Miranda Buckley","rating":5,"content":"I was not expecting this good of a speaker for the price. The lights are kind of adorable, and it’s crazy that it’s waterproof and had charge ports. The bass is really good, sound quality is good, not excellent, but pretty damned good. Way cooler of a device than I was even expecting.","timestamp":"Reviewed in the United States June 12, 2024","profile_id":"AG7W5FGCN2RQXJNDTNAEMMVEDAFQ","is_verified":true,"product_attributes":""},{"id":"R1YO65AWTWLOB5","title":"4.0 out of 5 stars Big Sound, heavy Package: A review of the Tribit StormBox Blast Portable Speaker","author":"Tina","rating":4,"content":"The Tribit StormBox Blast Portable Speaker delivers excellent bass sound, perfect for my garage gym. It can also get really loud, which I prefer during workouts. However, the label \"portable\" seems misleading because it's as heavy as a brick. Fortunately, this isn't an issue since I don't plan on moving it around. It didn't arrive charged, but I paired it quickly after charging. I also appreciate that it uses a power cord instead of running on batteries.","timestamp":"Reviewed in the United States April 17, 2024","profile_id":"AE52VF2GBW3JHCXMMTFTTJNWKLBA","is_verified":true,"product_attributes":""},{"id":"R2A2XBDC3SQL7K","title":"5.0 out of 5 stars Great sound for the money, and good app!!","author":"Cody Cooper","rating":5,"content":"The media could not be loaded. I have been very impressed with Tribit after buying a Stormbox last summer for my eScooter. I have wanted to buy a larger portable Bluetooth speaker for a while that was water resistant but JBL is very expensive. I wanted to replace my 4 Flip5s with one big speaker, my batteries are shot on those, but after over 5 years, they did very well. This Tribiy delivers. It sounds great, the bass button is awesome, really fills a room and it gets LOUD. I wish the sound went more directions like JBLs, but what does come out sounds amazing. Played with it a few hours and hasn't moved off 100% battery life. I also like the light show, there are two options or you can turn it off, side lights indicate volume. I know it's not loud in my video but the volume isn't even at 30% and it's much louder in person, I wanted to show off the lights lol. I love the buttons, the center circle is multi function and you can skip back and forth, play/pause with one button, and the volume buttons are dedicated. The app is awesome because it has all that functionality as well as access to preset equalizers and the ability to make your own. Super easy to set up and learn the functions. You can also use it to charge electronics of the usb-C on the back which will be very handy. I bought the carrying case and it basically covers enough to carry it by strap, which is awesome. I wish it had a compartment to put the charging cord in but I doubt you'll need to charge it during a day or night of use. Very impressed again, Tribit!","timestamp":"Reviewed in the United States October 13, 2023","profile_id":"AG3X3DTHFNGI4XS7WYA6QOXM3ZUQ","is_verified":true,"helpful_count":10,"product_attributes":""},{"id":"R1ETA2URW8F7Z","title":"5.0 out of 5 stars Good Product","author":"Leo","rating":5,"content":"Very good sound.","timestamp":"Reviewed in the United States July 1, 2024","profile_id":"AENAPJJYOJ7TR4MZAJG3YFTUB56Q","is_verified":true,"product_attributes":""},{"id":"R327YT3BDZYU7P","title":"3.0 out of 5 stars Decent product for basic use","author":"Boxranger","rating":3,"content":"I liked the weight and construction of the unit as well as the connection options. Easily portable and has some heft to it. Very easy to get setup and working. Good bass and has an Xtra bass boost button which adds decent bass. Probably good for young folks looking to bang around with easily portable sound that can hold up to a lot of use. However, I was seriously disappointed in the mids and highs from this unit. If I had listened to it prior to buying I would not have purchased. Admittedly, I am picky about sound quality. In this case I relied on the reviews about the sound quality and learned my lesson. My version of good clean, balanced sound is not the same as others.","timestamp":"Reviewed in the United States July 22, 2024","profile_id":"AFI2XHUXHAEC2UEKHBCVQFFN2ZNA","is_verified":true,"product_attributes":""},{"id":"R1XWYTWY3KZHT4","title":"5.0 out of 5 stars Exceptionally good 🔊","author":"T","rating":5,"content":"This speaker is absolutely perfect. It sounds exactly like listening to the music over headphones, with no unnatural bass or treble, and everything is crystal clear and fills the room. I have a smaller Tribit speaker that I love, and that's what led me to see what else they offered when I started looking for a larger speaker - it is exactly what I wanted. It fills a large area when I use it in the backyard and also sounds clear at the lowest volume when I use it like I would a smaller speaker. Tribit, you rock!","timestamp":"Reviewed in the United States April 8, 2024","profile_id":"AH76KIHCL4ZFNLMG7ERZYHEIVW5Q","is_verified":true,"helpful_count":1,"product_attributes":""},{"id":"R1VG7FOEEHQUJJ","title":"5.0 out of 5 stars 🫠","author":"SumtingSumwhere","rating":5,"content":"The media could not be loaded. OMFG.Listen, you've been comparing speakers for a good bit now... It's time that you settle this once and for all. Tribit Stormbox Blast is your speaker. PERIOD.By continuing to compare other speakers to this one, you are LITERALLY wasting your life away. You will not find a better speaker in this category, something better simply doesn't exist... There is absolutely no comparison out there that could rival Tribit, this will blow your mind.If you're a music producer, welcome to a new experience for your productions... This is amazing and works with any DAW as well as it is the newest Buetooth version which eliminates latency and provides extremely high quality audio transfer.Just buy it. It sounds amazing. Trust me.","timestamp":"Reviewed in the United States April 12, 2024","profile_id":"AH5RKH5FKM3D5RDTEZXJVDRZIYEQ","is_verified":true,"helpful_count":2,"product_attributes":""},{"id":"RQAC8XTGY3I9T","title":"4.0 out of 5 stars 4/5 star","author":"unlisted","rating":4,"content":"Great sound would be 5/5 but controls are limited without phone access.","timestamp":"Reviewed in the United States June 3, 2024","profile_id":"AG7NKFXCXRC3Z3DHA2ZXXCOQ2YXQ","is_verified":true,"product_attributes":""}],"page_type":"Question","asin_in_url":"B09PMYTJD2","product_name":"Tribit StormBox Blast Portable Speaker: 90W Loud Stereo Sound with XBass, IPX7 Waterproof Bluetooth Speaker with LED Light, PowerBank, Bluetooth 5.3&TWS, Custom EQ, 30H Playtime for Outdoor","parse_status_code":12000},"created_at":"2024-09-11 22:57:56","updated_at":"2024-09-11 22:58:13","page":10,"url":"https://www.amazon.com/product-reviews/B09PMYTJD2?reviewerType=all_reviews&pageNumber=10","job_id":"7239769163101637633","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-11 22:57:56","domain":"com","geo_location":null,"id":"7239769163101637633","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B09PMYTJD2","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-11 22:58:13","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7239769163101637633","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7239769163101637633/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7239769163101637633/results/1/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/2/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/3/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/4/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/5/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/6/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/7/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/8/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/9/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/10/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/11/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/12/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/13/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/14/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/15/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/16/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/17/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/18/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/19/content","http://data.oxylabs.io/v1/queries/7239769163101637633/results/20/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7239769163101637633/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7239769163101637633/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/16/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/17/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/18/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/19/content?type=raw","http://data.oxylabs.io/v1/queries/7239769163101637633/results/20/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7239769163101637633/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7239769163101637633/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/16/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/17/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/18/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/19/content?type=parsed","http://data.oxylabs.io/v1/queries/7239769163101637633/results/20/content?type=parsed"],"method":"GET"}]}}