{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=1","asin":"B099TJGJ91","page":1,"pages":777,"reviews":[{"id":"R1VLF39D9VE7FP","title":"5.0 out of 5 stars Clear sound and portable","author":"Pia Sareen","rating":5,"content":"I'm absolutely loving my new Bose SoundLink Flex Bluetooth Speaker! Here's what I like:- Portable: This speaker is so compact and lightweight, making it perfect for travel, outdoor adventures, or pool parties.- Clear sound: The audio quality is exceptional, with crisp highs and deep bass that impresses every time.- Long battery life: Up to 12 hours of playtime means I can enjoy my favorite tunes all day long.- Stylish: The Stone Blue color looks sleek and modern, fitting in perfectly with my outdoor decor.- Microphone: The built-in mic makes hands-free calls and voice assistant interactions a breeze.What I like least:- None! This speaker exceeded my expectations in every way.This Bose SoundLink Flex Speaker is a must-have for anyone seeking a reliable, high-quality portable speaker. Its durability, sound quality, and versatility make it perfect for any setting. I highly recommend. Value for money.","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AFJ5257WTRMSPHS5NSC2CVRXIJVA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Stone Blue"},{"id":"R178SB5RANHLM7","title":"5.0 out of 5 stars Big Sound, Easy Connection, Small Size","author":"Jalapeño 023","rating":5,"content":"I’ve had this speaker for about six weeks and have only positive thoughts. The sound can blast through my house or back yard, it holds a charge, as since the first charge, I have only hooked it up one time. It announces how much charge is remaining and what it is connected to when you power it up. It connects quickly. I really enjoy the Blue Stone color. I have used it all over the house including at the end of the shower (not in the water as it is NOT waterproof). The size makes it easy to put in a bag to carry and it feels like it is well made (not fragile). I am considering buying another one because apparently you can connect them together within range!I bought it for $99 during Prime Days, but even at regular price $130 I think, it is a great deal. If I have any issues in the future, I will update this, but so far SOOOO GOOD!","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AF5LQJHZHDXWVQRLZQPO2FWKSBMQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Stone Blue"},{"id":"R2LQYVEK3JWJW2","title":"5.0 out of 5 stars Great clear and powerful speaker","author":"LilliesofTruth","rating":5,"content":"The sound quality is absolutely exceptional, delivering rich, clear audio that fills the room effortlessly. Whether I'm listening to my favorite music, catching up on podcasts, or enjoying movie nights, the speaker amplifies every sound with incredible depth and clarity. The design is sleek and modern, making it a stylish addition to my home decor, and it is super portable, allowing me to take it along for outdoor gatherings without any hassle. Setup was a breeze, and the Bluetooth connectivity works flawlessly with my devices. I even got a cute matching accessory holder to carry it like a handbag. Worth the money!","timestamp":"Reviewed in the United States July 31, 2024","profile_id":"AGER2OA4FJUBXTG4D47RSLLBPTMA","is_verified":true,"helpful_count":14,"product_attributes":"Color: White Smoke"},{"id":"R3T58CJGN9U85E","title":"5.0 out of 5 stars This is the ONE!","author":"Bryan A. Currie","rating":5,"content":"I had a sonos that crashed out. Wanted to replace my portable waterproof speaker with something good. This Bose is amazing. Tough, durable, waterproof. Sounds amazing. Perfect for the dock on the lake or the board on the beach. My prior Bose speaker was finicky with connectivity, but this one connects immediately. No problems, long battery. Great value and excellent sound for the small size!","timestamp":"Reviewed in the United States August 9, 2024","profile_id":"AFGN4GW4C2QMSKXB576QGKU4VPSQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R2TB41OYEQ665X","title":"5.0 out of 5 stars Simply great.","author":"Jake","rating":5,"content":"I have thoroughly enjoyed my entire ownership of this speaker.Time of writing this review is roughly 8 months after purchase, having used this speaker practically every single day since. This was a replacement for a very well-loved but somewhat lacking B&O (P3?) oval-shaped speaker that inspired of few of my must-have features.My key requirements in purchasing a speaker at this price point were:- Punchy, solid bass, with high accuracy, clear playback throughout most of the volume range- Relatively attractive, understated, simple design with ergonomic and intuitive controls- Easily oriented for high quality playback in a variety of different situations (facing sideways, upwards, at angles)- Long-lasting battery without any obnoxious constant playback interruptions informing you of battery life remainingThis speaker delivers on all of these.The bass is incredibly clear, with no horrible warbling and distortion that’s very common with dozens of other similar speakers. The audio playback is very crisp and clear, with no noticeable quality losses. I’m sure it’s not perfect, but it’s more than adequate for 95%+ of people. Even at low volumes, the quality is still extremely high. There is a usable, enjoyable sound at every volume level.The design is simple, but handsome. It does not look obnoxious or out of place anywhere. It is just the right size, not too large to pop into a bag, and not too small as to have low-power drivers with poor sound. Very easy to transport. The squared design makes it very stable on most surfaces, but is still rounded enough not to get caught on things. The controls are very easy to understand, even the multi-device Bluetooth cycling and syncing. I have no complaints.The speaker works well for playback in nearly any position, especially when placed on a table or other nice playback surface. It can be placed facing upward, and the speaker enhances playback for all-around sound. When placed horizontally, the same happens for directional playback. Very impressive stability in a wide variety of situations. Some would consider the lack of a lanyard or string to be a downside for this point, but there is massive benefits to keeping this speaker on a surface.The battery life is incredible. Vastly longer than I had really expected for this speaker. With my personal usage (middle volume range, 2-3 uses a day for 30 to 60 minutes at a time), I usually recharge every 1-2 weeks. Not sure what exactly that equates to in real playback time, but I still find it impressive. The speaker will notify you at 20% and 10% battery level, which is exactly what I wanted. Many other speakers will interrupt playback at 75%, 50%, etc. I’ve not experienced any noticeable battery decay during my ownership, but I have only fully depleted and nearly fully recharged the entire time, with no “filling up” in between.Downsides do exist, but most are inconsequential for me.- The audible indicators that inform you of which device you are connected to can sometimes feel a bit sluggish, especially with long device names.- I feel the price point is still a bit on the high side for the value, but I feel I’ve more than gotten my money’s worth. I just like a good deal.- Volume occasionally spikes very high in certain scenarios when switching between devices, but is fairly easily turned down after a quick scare.I would highly recommend this speaker to anyone in the market for a speaker at this price point. This is an especially good deal on sale. If you’re still reading at this point, just get the damn thing on the way.","timestamp":"Reviewed in the United States May 4, 2024","profile_id":"AHZBIFMKWWZHILYEIYOSP4AIA37Q","is_verified":true,"helpful_count":255,"product_attributes":"Color: Black"},{"id":"R3ROA7AIPUTWTJ","title":"5.0 out of 5 stars Superior Sound Quality in a Compact Design","author":"Brandon","rating":5,"content":"The Bose Soundlink Flex Bluetooth Portable Speaker offers exceptional sound quality in a sleek and compact design. The speaker delivers rich, clear audio with deep bass, making it perfect for both indoor and outdoor use. The battery life is impressive and the Bluetooth connectivity is seamless. The speaker is also durable and water-resistant, ideal for taking on the go. If you want a portable speaker with premium sound quality, this one from Bose is an excellent choice.","timestamp":"Reviewed in the United States August 7, 2024","profile_id":"AFQ2RJJY4FMBW4LFKJTH4YCBL25Q","is_verified":true,"helpful_count":9,"product_attributes":"Color: Stone Blue"},{"id":"R3N5UYTNS8D2V6","title":"4.0 out of 5 stars Small speaker, big sound, travel friendly","author":"jonathan lopez","rating":4,"content":"Got this lil thing for Prime Day for only $99. I’m not going to lie, I had low expectations and planned on returning it. After opening it and setting it up, I got to see what the hype was about. Took me a couple hours of listening to figure out if it was a bang for my buck or a waste of money.I currently have the first UE Megaboom that I use daily that I bought back in 2016. It’s loud, has bass and can fill a room. Sadly, the charge isn’t exactly reliable so I was looking for something new. The Bose Link Flex definitely has a great quality sound. It will definitely fill a room. I like to use mine in the shower and acoustically in the shower the bass just sounds amazing!! Speaker actually fell off the shelf from the bass and survived the fall.Now, I listen to just about every genre of music. I found it to sound best with Latin music. Vocals are super clear. When it came to rap music (or music with lots of bass) I found it to sound perfectly balanced when the volume was at about 75%. Above that you’ll definitely still get volume but the bass will take a seat back. I’m used to the UE Megaboom that has 360 sound. While the Bose Link Flex will fill a room, the sound seems more straight forward depending if you want to stand it up or lay it down.Bose App is decent. Doesn’t really have any equalizer setting on there if that’s what you’re loooking for.I got this because it is small enough to pack in a carry on and not take up too much space in my bag. Might I add, it’s almost the same size as my iPhone 14 Pro Max . I can easily carry both in one hand. Easy to say, I’m going to keep this speaker with me. Now let’s see if the battery life is legit. I’ll check back in.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AF35A3ETTRWH62AWEWFQ2GO27VJA","is_verified":true,"helpful_count":26,"product_attributes":"Color: Cypress Green"},{"id":"R2Y3WBHYS3U0M4","title":"5.0 out of 5 stars A premium speaker in a sturdy package.","author":"Reviewer MHM 3-5","rating":5,"content":"I bought this speaker because I wanted a way to listen to music while grilling in my backyard. I had no expectations of it being a “party” speaker or anything of the like.But my goodness. This speaker punched above the weight I expected and what reviewers claim. They say it’s good for less than 10 people. Probably true if in an enclosed space.Outside, standing in the corner of my backyard about 40+ feet away, the speaker volume is at about 60-70% and with the air conditioner droning on I can still hear this speaker, and the vocals are clear, the instruments are clear, and there’s even some punch of the bass. It’s so much more potent than I expected.I actually bought a second one (the one pictured) so I could utilize Party Mode and Stereo Mode, and then these are far better than they have any right to be. The bass shook through the house at about 40% volume, to the extent that my wife actually asked me to return one and get some noise cancelling headphones if I wanted to be blaring music all day. 😂So (for now), I’m obliging and returning one, but honestly, I don’t want to. One of these speakers are great. Two make a great portable stereo system.Now for the feature set. Key selling points for me were:1. Durability. It’s made of steel and silicone, is rated to withstand a dunk in water and dust. You can enjoy this in the yard, on your workbench, swimming, shower, etc. I live in high desert, and the wind blew over these speakers from a table to the ground and they didn’t have a single dent or scratch. Which leads me to…2. The device has sensors built in that detect its positioning, so the sound quality was maintained even if it’s on its back, side, or face down. None of the other products that compete in this segment offer that function to my knowledge.3. Unlike other products that I considered, this sounded good right out of the box. Anker (Soundcore) offers some great competition in this segment, but needs the EQ tweaked to shine. They’re not bad by any means, but I wanted things to just be simple. Power on and go without fuss. Bose delivered that.There are similar products for sure. Ultimate Ears will also let you pair two portables to create a stereo, but it lacked the intelligence that this speaker did.We already covered Soundcore. Tweak with the EQ, save some money, you’ll likely be happy.These speakers do often go on sale, and I purchased mine used (like new) and refurbished respectively. The “Used” unit was actually brand new from Amazon, broke the seals on the box and everything. Far as I could tell, the speaker just rolled around in someone’s trunk unopened before returning. The box had some cosmetic damage but no dents, broken seals, and all accessories were obviously also unopened.Refurbished unit came straight from Bose. Also came with all accessories and literature, just a box that was labeled “Refurbished”. Warranty on refurbished or new are 1 year regardless.I bring this up to encourage you to save some money, reduce some e-waste, and buy secondhand like I did. No judgments if you want to go new of course! But I got 2 speakers, one that was new in reality, essentially $100 off the set, and I didn’t miss out on anything in terms of product or warranty.$150 is pricey for a speaker, but $103 for a Bose speaker is not. Especially one that can literally go for a swim.Four criticisms I’d like y’all to know. First, compression above about 75% volume. Your bass will flatline above this point to maintain clarity of the track as a whole. In reality, that just means you go from a slightly warm tone to a very neutral tone of sound profile. No big deal unless you’re blasting EDM, Hip-Hop, the like. As I said, this little 20W speaker carries enough punch that 70% was more than enough to fill my backyard.Second criticism is no biggie for me, but worth bringing up for those shopping the competition. I didn’t want to fuss with an EQ, but competitors do have them to fine tune your sound. Consequentially, the app is basically useless beyond seeing your battery life and an option on how to do party mode (not required).Third criticism is truly a nitpick, but why do I have two apps for my Bose products? Why do I need one for headphones and one for speakers? Wish Bose would put all their portable speakers and headphones into one app. You could easily knock out criticisms 3-4 by just putting this speaker into the Bose Music app, like my QuietComfort Headphones, and this VERY speaker's big brother, the Soundlink Flex Max, is already there. Why the heck is the Soundlink Flex not in Bose Music, with a basic EQ like the others?Fourth, this uses outdated Bluetooth. No big deal. Pairs easily. But don’t expect to watch movies or game off of this. Latency is too high.Anyhow, enough of that. Go buy one. Or better yet, two. You won’t be disappointed.","timestamp":"Reviewed in the United States July 2, 2024","profile_id":"AH5F7QHDE5VKRAMBN43A5WPU4ADQ","is_verified":true,"helpful_count":121,"product_attributes":"Color: Black"},{"id":"RTTQUD9NY9L3G","title":"5.0 out of 5 stars Way better than expected!","author":"Rich","rating":5,"content":"The last time I tried Bose speakers was about 25 years ago and I swore them off completely because I didn't like their signature sound. After reading all of the glowing reviews and watching many, many speaker reviews on YT, I decided to give the Soundlink Flex a try as a replacement for my aging Sony SRS-X3. I initially purchased the Beosound A1 (2nd Gen), which has superior mid and high sound quality IMO, but had to return because the it was very underpowered. Where the Flex can easily fill a 500 sq ft space, the A1 provided incredibly low sound at a distance of 15 ft. The Flex puts out more bass, if not more than the A1, and the bass offers more punch at lower Hz than the A1. The overall sound is great for the price but would be really nice if the app included an equalizer to help push up the mids and highs.Prior to purchasing the Flex on Amazon and trying to save a buck, I bought the Flex SE from Costco thinking it was the same product that was just repackaged. After 15 minutes of trying to use as a speakerphone, I finally figured out that the SE does not have a built-in microphone and therefore cannot be used as a speakerphone. So, I immediately returned the SE and bought the non-SE here.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AHWOBQMLF2N4Z4TCEPMHAL4ASVHQ","is_verified":true,"product_attributes":"Color: White Smoke"},{"id":"R3TVEXDLBORXWI","title":"5.0 out of 5 stars 5 Million Stars!! ⭐⭐⭐⭐⭐","author":"Caitriona Gillespie","rating":5,"content":"OMG this is the best speaker which is not a huge floor speaker (over 1 foot high) that is part of a massive speaker system. The sound quality is truly impressive for a speaker of any size, & I think that if I bought another one, which I'm seriously considering, it would rival my Kenwood stereo system, which has two floor speakers that are over a foot high each, & the Kenwood amplifier, & the Kenwood 5-CD player. All that stuff is so big that it needs its own cabinet & takes up several feet of floor space. I don't know how the geniuses at Bose have done it, but they have somehow packed all that sound into a speaker less than half the size of a loaf of bread that is also a very appealing shade of lilac that goes with my décor. The Bluetooth connection works perfectly every time, even though I don't have the newest phone out there. I'm so in love with this speaker, the only complaint I have is purely aesthetic & easily fixed- the fabric loop attached to this beautiful lilac speaker is, for some unknown reason, an entirely ridiculous shade of brilliant orange, which clashes hideously with everything. I solved this problem with a dark purple Sharpie marker. That is the only complaint I have. While this speaker comes without any instructions on how to set it up, the set up is so easy, even when you're not a technology person, that I set it up myself with no help in under a minute. I plugged it in, turned it on, turned the volume all the way up- for some idiotic reason, it comes with the volume all the way down- & then turned on the Bluetooth on my phone & had it search for Bluetooth devices. My phone found the speaker very quickly, paired with it without issue, & started playing. One important thing to know is that when you leave the range of the speaker for an extended period of time, like when I leave for work & take my phone with me, the speaker will turn that connection off, so that when I get home & want to use my speaker again, I need to go over to the speaker with my phone & push the power button once. The speaker will say how much battery power is left & that it is now connected to my phone- I don't turn the Bluetooth off on my phone when I leave the house. I recommend turning the speaker all the way up & then controlling the volume through your phone, which is what I do. I think that's the easiest way to do it. One charge of the battery lasts a long time- at least 12 hours, so that part's great as well. Just buy it already, you won't regret it. It'll beat the pants off of all of your other speakers, even if you already have a nice set of Bose speakers.","timestamp":"Reviewed in the United States June 15, 2024","profile_id":"AGKOCRUHY2FG2ZHWTZRUH5JYIFBA","is_verified":true,"helpful_count":26,"product_attributes":"Color: Chilled Lilac"}],"page_type":"Question","asin_in_url":"B099TJGJ91","product_name":"Bose SoundLink Flex Bluetooth Speaker, Portable Speaker with Microphone, Wireless Waterproof Speaker for Travel, Outdoor and Pool Use, Black","parse_status_code":12000},"created_at":"2024-09-11 22:36:01","updated_at":"2024-09-11 22:36:04","page":1,"url":"https://www.amazon.com/product-reviews/B099TJGJ91?reviewerType=all_reviews&pageNumber=1","job_id":"7239763646438471681","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-11 22:36:01","domain":"com","geo_location":null,"id":"7239763646438471681","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B099TJGJ91","source":"amazon_reviews","start_page":1,"status":"faulted","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-11 22:36:42","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7239763646438471681","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7239763646438471681/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7239763646438471681/results/1/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/2/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/3/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/4/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/5/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/6/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/7/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/8/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/9/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/10/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/11/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/12/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/13/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/14/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/15/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/16/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/17/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/18/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/19/content","http://data.oxylabs.io/v1/queries/7239763646438471681/results/20/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7239763646438471681/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7239763646438471681/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/16/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/17/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/18/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/19/content?type=raw","http://data.oxylabs.io/v1/queries/7239763646438471681/results/20/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7239763646438471681/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7239763646438471681/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/16/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/17/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/18/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/19/content?type=parsed","http://data.oxylabs.io/v1/queries/7239763646438471681/results/20/content?type=parsed"],"method":"GET"}]}}