{"results":[{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=1","asin":"B07P39MLKH","page":1,"pages":731,"reviews":[{"id":"R2PF2WLR41KJR6","title":"5.0 out of 5 stars Great for Audiophiles on a Budget","author":"Caleb Roden","rating":5,"content":"This is the best speaker for the money out there. I have owned this for 3 years and have taken it everywhere, never missing a beat… (Yes pun)…The sound quality on this is pretty good out of the box but some EQ’ing on the app makes this really come alive with a vibrant sound. I cannot emphasize enough how much improvement a makes for this portable speaker. For me, this really loves a V shaped EQ as the mids are pretty forward and dominant out of the box. The hardware itself is great but the tuning is pretty average out of the box. If you don’t mind dialing it in yourself, it is well worth the 5-10 minutes it takes to set it and forget it. This has a pretty wide range for such a moderately sized speaker. This speaker boasts a generous capacity for bass and has excellent sound separation. It seems to have 2 mid-range drivers, 2 high range, and one “sub.” I initially used this as a little soundbar for my desktop pc but now it is my daily driver. I have used it nearly every day for 3 years and it has been rocksteady the whole while. The battery life is still excellent too.Back to the EQ, this benefits from a bit of extra sub bass, generous mid bass amplification and moderate upper mids and treble. With that set up, this little guy really becomes vibrant.Being a smaller speaker, the bass is obviously going to be somewhat limited but for the size it is surprisingly present. I would describe the bass as present, clean, and generally responsive.For durability I may not be the best person to ask because I’m generally pretty protective of this thing but it has been in a backpack hundreds of times and even dropped a few slight drops. Other than a small dent from one such drop there is no real sign of wear.All in all I would highly recommend this speaker for anyone who wants the best possible sound quality for the money!","timestamp":"Reviewed in the United States July 5, 2024","profile_id":"AGVTW4JTHAFPLMM6EQNFZ5XAL6IQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R1QXBHCR4TIS7G","title":"5.0 out of 5 stars Sounds very good with app/EQ","author":"von Diesel","rating":5,"content":"Out of the box, the sound lacks bass and some highs. Downloading the app and tweaking the EQ makes these speakers really sing. I put on some Steely Dan and played with the EQ for 5 minutes and then they were good to go. They remember the previous EQ setting when you next use them, so you don't have to adjust every time.I bought two so I could pair them into stereo mode. They sound good and produce stereo sound alone, but two together is quite impressive.These are replacing an old pair of JBL Flip 4's. The Flips were fine, but the battery life was fading. I would use them at moderate volume about an hour per day, and I would have to charge twice a week. The new Motion+ are a bit larger, louder, sound better, and the battery life is 2-3X longer.Overall excellent speakers for the price so far. No Bluetooth connection problems and they seem to be solid and high quality. Highly recommended if you're willing to get the Soundcore app and tweak the EQ for a few minutes. I uploaded a photo of my settings. Try making yours similar to mine and see how it goes.","timestamp":"Reviewed in the United States February 19, 2024","profile_id":"AGHBCHZUKT423NPUVBUDNJRJUQ7Q","is_verified":true,"helpful_count":14,"product_attributes":"Color: Black"},{"id":"RP27U3MZYB2O1","title":"5.0 out of 5 stars Great sounding speaker from a small package","author":"Alby","rating":5,"content":"The speakers sound surprisingly good given how small they are. Decent base if backed against a wall, blutetooth connectivity works without dropping out, a single recharge seems to last a long time. And water resistant too, which is handy and I use them in the kitchen. No complaints, a great speaker in a small package for a reasonable price.","timestamp":"Reviewed in the United States August 23, 2024","profile_id":"AG5KYWEJU5OUCUAGPUJ6TL27ILEA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3I7YEMYIPDPT3","title":"4.0 out of 5 stars Great Speaker, has some fixable issues","author":"CheezyWeezle","rating":4,"content":"The speaker itself is very good, has a lot of power for the size and I can usually crank it up to 100% without any clipping and almost no distortion if any at all (after adjusting the EQ settings... more on that later). The layout of the drivers and the fact that there are 5 of them in this tiny package absolutely fills the sound stage and the DSP does a very good job of balancing the power between them all. The battery lasts quite a while: long enough for a day trip or party multiple times over, and it doesn't seem to lose much charge when unused for a few days at a time. The portability is fine, it is a bit heavy and decently large, so you won't be putting it in your pocket and can't really comfortably hold it in your hands for more than a few minutes, but that's probably not what you would be buying a speaker like this for anyways.That said, I do have a few issues, some of which are major and should be extremely easy to fix (and I honestly am surprised that anyone in this day and age would leave these features out), these issues being that 1. Every time you turn on the speaker, it defaults to it's god awful \"Bass Up\" aka \"Destroy the sound quality\" EQ that makes everything sound TERRIBLE. When I first got this speaker, turned it on, and played something, I heard the awful cacophony and immediately turned the speaker off and put it back in the box, ready to return it. Then I remembered I read a review that said the default EQ was awful and that the app allows you to change it, and changing it to anything other than the \"Bass Up\" or \"Bass Off\" (Bass off sounds like the awful cacophony but without any bass) makes this speaker absolutely shine. The problem with this solution? You HAVE to have it connected to your phone, and you HAVE to use the app to change the EQ, EVERY SINGLE TIME YOU TURN ON THE SPEAKER. On the speaker itself, you can switch between \"Bass Up\" and \"Bass Off\", but you cannot set a default EQ, you cannot save a custom EQ from the 9-band custom EQ, and you cannot disable the \"Bass Up\" from being defaulted on every time you turn on the speaker. Because the speaker sounds so awful out of the box, I have given 4 stars in the \"Sound Quality\" feature, but if you change the EQ the sound quality goes up to 5 stars for sure.Another rather large issue is that it is currently impossible to use the speaker over Bluetooth with Windows 10. The device will only show up as \"Unknown device\" if it even shows up at all, and if you manage to connect to it, it will indeed name itself to Soundcore Motion+ but it does not recognize it as an audio device and you cannot use it to play sounds through. For me, this isn't a huge deal because I use the aux input when using the speaker with my computer, but I can image that this issue would impact others rather significantly.The other issues I have had are rather minor. For example, if you have the Volume Sync bluetooth feature enabled, you can only change the volume in it's predefined steps, so if one notch is too quiet, and the next notch up is too loud, you just have to deal with it and choose quiet or loud (If you disable Volume Sync, you can granularly change the volume through the Soundcore app, but then the speaker volume is independent of your device volume). Another one is that I feel that the rubber stopper that covers the ports has a rather clunky design, and while I appreciate that it is rather large to accommodate the waterproof feature, I feel like it sticks out quite a lot and gets in the way if you want to use an aux or charge it while you are using it. Also, I had a very bad experience with the firmware update, as it apparently must have at least 50% battery remaining (remember, it has a rather beefy battery and absolutely did not come anywhere near needing 50% battery, I'd say 15-20% is a more realistic limit) and also apparently takes an exorbitantly long time to update the firmware (about 15 minutes to install, I had already downloaded the measly 36MB update before it would have made a difference) while neglecting to tell you that it is going to take that long until AFTER you have already starting the update and cannot cancel it without risking bricking the thing. If I had any warning that it was going to take more than a minute, I would have waited until later so I could have used it during my break at work, instead of waiting for it to update.Now to round it off with a few more good things about the device: it turns on quickly and automatically connects to my phone instantly. It takes about 3 seconds to turn on and another second or two to connect via bluetooth. It also does NOT play any sort of sound when changing or maxing out the volume, a feature I absolutely despise in other speakers. You can also charge the speaker while using it. The Bluetooth 5.0 features are quite nice as well. The build quality is fantastic; it feels extremely solid and looks like it could take a beating.TL;DR: The speaker is great, sounds great, and has great battery life, but it has a few caveats in the feature functionality, such as poor EQ out of the box and a bug causing incompatibility with bluetooth connection to Windows 10.","timestamp":"Reviewed in the United States April 3, 2020","profile_id":"AFUPIW4BXLOBZXBG7CEP235UWBFA","is_verified":true,"helpful_count":15,"product_attributes":"Color: Black"},{"id":"RSATCQM413XZR","title":"5.0 out of 5 stars BT connection problem : But GREAT CUSTOEMR SERVICE & Problem Solved","author":"Alex Y. Yoon","rating":5,"content":"UPDATE : 10/21/2020Problem Solved. Anker/Soundcore has contacted me and they have resolved the problem for me.A great company and products. As long as there is a good customer service and they can guaranty their products, I can buy their products without worries. Thanks AnkerUPDATE : 10/11/2020I have been using this for few days. Initially, I have connected to my 3 devices. my laptop, amazon fire and my cell phone. supposedly, when I turn on soundcore, it should be automatically connect to the previous device. That it does. however, the main problem is that while playing, the music gets cut off, trying to connect to my other two devices. So basically, either I have to turn off my two other device bluetooth features or keep reconnecting the main device which is my laptop to listen to music.I have many other Anker/soundcore bluetooth speakers but none of them has this sort of problem, except this Motion + which is very strange to me.so, I have to return the product and lower the stars from 5 to 1 stars.other complain is the bass. I am not a bass head, but surprisingly it does lack a lot of bass compared to my previous speakers, Earfun. Mid and high are pretty good, but bass is still bit weak.lastly, battery life does not come close to what it advertises. about 30% less than what it advertises.bit of disappointment.===============================================I always have been a big fan of Anker for many years. I believe that I have bought at least 50 products from them since five years ago. Before this purchase, I had Earfun bluetooth speakers. I bought two of them to use as stereo home system. They worked great and sounded even better.....for about two weeks and a half. then, one of them went kaputt. No power, no charging, just simply dead without any reason whatsoever.so, I had to look for another one.I always had my eyes on this Soundcore Motion + because of a lot of good reviews in youtube and I normally trust their quality and customer service.Fortunately, this one was on deal of the day at $69.99 So I picked it up right away.Just by the weight, it is heavy and I could tell that this has a lot of battery to play for a long time and it just felt good in my hand. Everything looked substantial and fit & finish was top notch.As for the sound quality, Yes, it is good. very refined high and clear mid/vocal along with decent bass. (but bit weak compared to mid/high)However, what made me to give 5 stars was the soundcore app. I was able to control the frequencies with my phone soundcore app. That was a huge point because not all music can be played at same frequency setting.However, I don't think that this motion + can produce 30 watts as advertised. it seems a lot low.....but it is okay. Loud enough.I know that it is the first day and normally I always am eager to put my review on Amazon. Just like the Earfun, perhaps in a week or two, it might go bad. If so, then I will update my review. But my initial impression is very impressive.Thanks Soundcore.","timestamp":"Reviewed in the United States October 7, 2020","profile_id":"AGGIR5S4YQMG4IKWU3A7K3BQ56ZA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R2X1CXYBRBG5SZ","title":"5.0 out of 5 stars very well made","author":"Lawrence Blanche","rating":5,"content":"This is an awesome little speaker, for a low price. great bass, fidelity, and volume for its size, especially when you use the app which allows you to adjust the tone via the graphic equalizer on your smart phone. it also has an 1/8\" input for analog sources. The Bluetooth from my phone was perfect, and I plugged in my old ipod at the beach, and it worked flawlessly. It sounds as good as or better than my wife's $200 Bose brick.","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AEOYCM6CLUZIB72BE67ASSMNCDGA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2QOAJU0QZKQ4P","title":"5.0 out of 5 stars Such a beautiful speaker that sounds really amazing; especially for it's size!!!","author":"thegrudge","rating":5,"content":"This is such a beautiful speaker that sounds really amazing; especially for it's size!!! I haven't updated the firmware on any of the 3 Motion Pluses that I bought or downloaded the app yet; so my review is what I think of them straight out of the box. Anyway, when I first spotted these things on Amazon, I just knew that I had to have one (and then 2 more after I got 1 of them).Pros:1) Really really great sound out of these things even with the BassUp feature \"OFF\".2) For larger rooms turning \"ON\" the BassUp features helps just enough with the bass in larger rooms without bogging down the sound.3) Tight punchy bass with or without the BassUp feature \"ON\".4) Mids & highs sound fantastic, very clear with great instrument separation.5) Pairing 2 speakers together makes these sound even better for increased stereo separation and fullness of sound—and the BassUp feature isn't needed as much when using 2 speakers.6) Beautiful design, it's the best looking speaker that Anker has made to date, in my opinion.7) IPX7 rated...so it's completely waterproof.8) USB-C charging and cable (I think that the first charging time on one of mine was about 3.5 hours but charge faster with a better socket adapter, or so I hear).9) Still has an 3.5mm stereo auxiliary jack and supplied cable.10) Battery level indicator shows up on my iPod even without Soundcore Motion application installed.11) Decent battery life (12 hours) however, one of mine, so far (haven't tested the others yet), has exceeded the 12 hour mark. I listen to it just below half volume and this is usually enough volume for me.12) This speaker sounds better and is louder than the Soundcore Pro (the most comparable equivalent to this speaker).13) You can turn the BassUp feature \"ON\" and \"OFF\" with this Motion Plus speaker but you can't do that with the Soundcore Pro.14) There is an application download for this speaker that I hear has some nice features on it but you can still pair it up with another speaker to get a right & left channel stereo paring without the app.—totally unlike the JBL flip 4s and JBLs which require their app to get their pair speakers out of \"Party Mode\".15) It's a little wider physically than the Soundcore Pro and the Boost so the stereo separation is still a little better than other models, even without having to pair it to another speaker,POTENTIAL cons but ONLY if these things are important to you (they are usually NOT a problem for me):1) Although, it has good battery life the Soundcore Pro (another Anker model) has an 8000 milliamp battery (18 hours of battery life) and this one is only a 6700 milliamp battery. It might have been nice to get a little bit of a bigger battery in the Motion but it's not that disappointing to me that we didn't.2) The Soundcore Pro has a standard USB port so you can charge your phone from the speaker. (This is not important to me as I would rather just carry an extra Anker battery charging bank to charge my phone rather than use the speaker's battery.)3) It doesn't have quite as much bass as the Soundcore Pro—if you're primarily into really heavy bass, which I am NOT. This is NOT a con for me personally because I think that the Motion Plus has the perfect amount of bass with or without the BassUp turned \"ON\". I found that I always needed to EQ down the bass on the Soundcore Pro to get it where I personally liked it. I don't have to do that with this speaker.4) This speaker is larger or wider than the Soundcore Pro and the Boost; so if you're looking for something really small, this speaker might not be quite as easy to carry around as the Boost or Pro. (This is not a problem for me at all though; I actually like this feature a lot.)5) No multi light battery indicator on the actual speaker itself—but the power button does start flashing red when batteries are getting low. (It would have been nice to have battery level lights on the speaker but I am still okay with it showing up just on the iPod and/or on the application.)6) Has sizable quantized volume increases for every click of the volume button however, these increases are NOT nearly as bad as the larger jumps in volume on the Soundcore Pro.Only 3 of these potential cons represented any problem for me:* the battery play time* no battery level indicator lights on speaker* the sizable volume increasesHowever, these issues still haven't seemed to have been that big of a deal so far because I get more than the expected battery time because the speaker is loud enough so I can just listen to it at lower volumes and get longer battery life that way. Also, I can track battery levels on my device and/or application so this isn't much of an issue with me. And as far as the sizable volume increase, I seem to be able to micro adjust them when using my finger along the slider (at least with the newer iPods and iPhones, older ones seem a bit more jumpy).Anyway, this is a really great speaker and I highly recommend it!!!NOTE: If you like your mids and highs scaled back some, then I would highly recommend the Soundcore Boost and if you really like a lot of bass with a dip in the mids, I would then recommend the Soundcore Pro. All 3 of these are good speakers though.","timestamp":"Reviewed in the United States January 30, 2020","profile_id":"AGZ5Q5UNZ5WCHTCT5TX3DWABJIMQ","is_verified":true,"helpful_count":23,"product_attributes":"Color: Black"},{"id":"R19XDNHSZB3ZH1","title":"5.0 out of 5 stars The Audiophiles Choice","author":"Russell B.","rating":5,"content":"The Soundcore Motion+ is an elegant design with excellent ergonomics that elevates this speaker above & beyond. It feels substantial in your hand and well built. The volume controls located on the top of the speaker are perfectly centered between the bass drivers on either side, and the front passive radiator which allows for easy navigation. Technically, the Motion+ excels with an AKM DSP featuring active crossovers for its four amps, each with its own dedicated power supply, silk dome tweeters (which I believe are Scan-Speak design), bass drivers with large neodymium magnets coupled to two passive radiators and USB-C charging. It’s a brilliant design that is supremely executed. Hats off to the sound engineers that collaborated on this speaker! Once you’ve unboxed and charged your Motion+ you’ll want to update the firmware and set up the custom EQ. To do that you’ll have to download the app. To use Ankers Soundcore App, you’ll have to accept giving up a huge amount of personal data analytics, so I chose to install the app on a tablet. Just beware. The Soundcore Motion+ will save your custom eq setting, however, you’ll want to delete the Soundcore app and re download it to verify that the settings are correct. The app will lower the sliders if they’re in between whole dB’s. Once it’s dialed in, you shouldn’t have to open the Soundcore app again. You'll want to refrain from pushing the bass up button on the top left of the speaker, since that bumps you off your Custom eq setting. The only way to get back to your saved eq preset is from the Soundcore app. I set the 9 bands of equalization all below flat to give the digital amplifiers extra headroom, keeping any audible distortion at bay. See attached photo. Since this speaker isn’t a three way and audible distortion is most prevalent at 1kHz, I set that band to -5 dB. Next is the lower and higher mid ranges at 700 Hz and 5kHz which I set to -4dB. 500Hz and 8kHz are at -3dB while 300Hz and 12kHz are at -2dB. Lastly, keeping the bass strong, I’ve set 80 & 150Hz at -1dB. So how does it sound? It’s airy and open projecting a surprisingly effective stereo image thanks to its silk dome tweeters mounted at the outside corners and tilted at a 15* angle. It’s balanced and capable with all genres of music from EDM to jazz, reggae to heavy metal. Horns, piano and vocals are beautifully rendered by the tweeters, juxtaposed by the bass capabilities of this speakers dual passive radiators. On Spotify, Amazon and Apple Music under shared playlists is my favorite titled:Epic House-Dance Music 4 The Soul.Some stand out tracks from Epic House-Dance Music 4 The Soul that sound fantastic on the Motion+ are:“Angels (Feat. Nora Jones) Thievery Corporation Remix” Wax Poetic- Norah’s voice floats around the room, amazing stereo separation. “Lips Like Sugar (Way Out West Remix Edit)-Echo & The Bunnymen- Punchy drums combined with some killer bass lines and melodic synth combined with sexy lyrics and a memorable rhythm guitar, this track sounds great blasted all the way! “Radiation Ruling the Nation(Protection)- Massive Attack. Even at max the on purpose distortion in this track sounds so authoritative! “I Want You (John Morales M+M Main Mix)-Marvin Gaye. This 9:36 long Masterpiece, highlighted by bongos, piano and saxophone are easily distinguished in the mix, throw in Marvin’s amazing tone, and man is this song better than the original? I think so. An analog 3.5mm jack is provided for those times when Bluetooth is not an option, however sound quality is best when left in the digital domain given the Motion+’s DSP. Speaker placement is important for the Soundcore Motion+ to sound it’s best. A solid surface such as a granite counter top, placed near a back wall, or corner placement can help accentuate the low end punch of the Motion+. A helpful hint is to hover the speaker in whatever area you’ve chosen and place the speaker when the bass moves your hand the most. Placing the speaker just inches one way or another can have a dramatic effect! This speaker excels indoors in moderate sized rooms, and can sometimes struggle in larger rooms or when played outside. The Motion+ puts out some serious SPL’s for such a small device. Have The Motion+’s USB-C plugged into power along with using the speakers volume control not the source device when you’re seeking the loudest output. The longer I live with this speaker the more I appreciate it. It’s an attractive design that’s understated yet compelling. For example, the power button glows white while powered on and changes to a blinking red when the speaker is running out of juice. In this state it automatically plays at a reduced volume until plugged in. Once plugged in to a charger via the USB-C port, the Motion+ increases in volume and continues to play while charging. Nice touch! I purchased a second Motion+ and my observations are that something magical happens with this speaker between the 3rd and 4th charging cycle. Keep that in mind when listening to yours. Critical listening should happen after the Motion+ is played for 30+ hours. In regards to Bluetooth connectivity, I highly recommend having a dedicated music source other than your phone. That awesome playlist playing from your phone while your phone is blowing up? It’ll be paused by the speaker from all the notifications.I modded mine, see photo, by super glueing a convex item over the bass up button, ensuring my speaker will always sound good! :-)The Soundcore Motion+ is a technical marvel of inspired engineering. I am consistently blown away by its performance. Highly recommended!","timestamp":"Reviewed in the United States September 10, 2019","profile_id":"AF67AQ42X5P3EYLUS6XXSDRTBORQ","is_verified":true,"helpful_count":166,"product_attributes":"Color: Black"},{"id":"R1CSRVU64OQJD8","title":"4.0 out of 5 stars You have questions, I have answers","author":"TazandSteve","rating":4,"content":"This is going to be long winded, but I'll likely answer a lot of your questionsMy intended purpose was to replace an aging Bose SoundLink Mini 1 that I was using for music in my garage gym. The SoundLink mini is an impressive speaker when it's size is taken into account. They provide a deep, full sound and produce great bass, but struggle when turned up much past 60% (at least mine does, but it is old). What I wanted was a speaker that could get louder while still producing a quality sound. I found that in the Motion+.When I first unboxed it, I noticed that it is heavy and has a very solid build. It is, however, it's not beautiful. The rubberized outside feels good and feels like quality and there are two rubber feet on the bottom to keep it in place.When first powered up you are greeted with the power up and pairing tones. They are honestly less annoying than others I have heard, though I know of no way to disable them.Pairing was VERY fast and straightforward and I can get a good distance away (I didn't measure though) without hiccups.It comes out of the box with Bass Up mode enabled. Listen... Bass Up mode sucks. It honestly should be called Treble Down mode. Yes it increases the bass, but not as much as you can in the custom EQ.I played a few songs in Bass Up mode just to see what I heard and as stated above, did NOT like it. I then played with the provided EQ settings in the app. I think if you are going to choose a canned EQ setting from the Soundcore app, the \"heavy\" one is decent. After that I played with the \"custom\" EQ settings and the speaker really started to come to life.Once you settle on an EQ setting you like, the SPEAKER retains those settings. So even if you pair it with a different device it will still play with your EQ settings.Now, I also have a built in EQ on my OnePlus 6T and decided to try that. First I turned off the custom EQ settings on the speaker (best way to do that is to hit the BassUp button on the speaker twice. Once turns on the BassUp profile and a second one turns BassUp off, reverting to \"bassoff\" mode). My OnePlus EQ has some \"general enhancements\" setting that I applied and I played with the sliders and it sounded pretty awesome. Then, I applied my custom Soundcore app's EQ on top of that and WOW! One EQ was awesome and two were even better.My next major test will be to try the speaker from different sources. I have access to a couple Samsung S9s, some android tablets, etc. I don't own any iPhones so I can't test that out. I'll update my review after doing more testing.I played with it for a few hours yesterday and even played it a bit in my car on the way to work this morning. I did find that the sound actually seemed to change slightly after playing a while. I don't know if speaker break-in is real or not, but I believe that the bass has become fuller and warmer after a few hours use. I'll update on this aspect as well.I am eclectic when it comes to music so I'll give a quick rundown of the types I've tried and what I thought.- Country music: I played several Chris Stapleton songs and I felt this showcased the speaker the absolute best. All the instrumentation came through warm and clear.- Heavy Metal: This is a WIDE genre and will likely be what is most often played on this speaker (it's for my gym, remember?). I found that \"industrial metal\" (Rammstein, NIN, etc.) needed a little massaging in the EQ to separate sounds better, but sounded great afterward. I ended up leaving these minor adjustments in place because they helped all the other music too. Atreyu, FFDP, Volbeat, etc all sounded powerful, loud and full.- Rap: Honestly, on day one I was ready to say that this speaker just sucks for beat driven hip hop music. However, after playing with the settings and letting it \"break in\" (if that's a thing) I was wrong. For example, I recently played \"come and see me\" by Ludacris which relies heavily on a bass line that varries from low, to really low with some thumps thrown in. I could hear all the deep frequencies, the slightly higher bass tones, and the periodic thumps moved my speaker. After that I threw on UGK's \"Gravy\" which also relies heavily on bass and it sounded fantastic.Now, how about that bass, since that's why most of you are here. This speaker is able to play really low frequencies, but it will NOT \"hit you in your chest\". You will hear all the bass, but you wont feel the bass... why? Because it's a freaking portable bluetooth speaker, not your home theater system, your bookshelf system, or your car stereo. If you want to FEEL the bass in your chest or whatever, you'll need to pony up for a speaker with enough size to resonate those sound waves. Doing so, you'll likely lose a lot in portability and whatnot. However, I have heard that the \"w-king D8\" is a good bass head speaker. Check out some YouTube reviews (or just order it, it's super cheap).Another thing to note is that the high frequencies are capable of getting louder than the low frequencies. As you crank this up, the bass will reach a point where there just isn't enough room inside the enclosure. People say you \"lose bass\" as you increase volume, but you don't, you just stop increasing bass at a certain point while the treble keeps on going. I've ran mine at somewhere near 90% volume and I can tell you that the drivers are still increasing their work, because the speaker basically starts having as seizure. It's just that there isn't any more space inside to resonate the waves.The reason, and the ONLY reason this isn't getting a full five stars from me is that my speaker farts. Yes... you read that right but only when cranked to uncomfortable levels and bass heavy music. There are a couple possible reasons for this. I could be asking for the passive radiators to do too much (I have two EQs, after all). It could just be the way it's designed (although I have read a TON of reviews on here and Reddit and never seen anyone mention this). Or my unit is defective somehow. Think about that last one though. If I DO have a defective unit, and my review is still this good, what does that tell you?I will reach out to Anker/Soundcore support just to ask some questions because their support is amazing. I've had other products from them and they provide the absolute best support I've ever received.To end (for now), this speaker really should be an automatic buy if you are looking for a portable BT speaker with high end sound under $100. If you are looking for \"slap you in the lungs\" bass, get something LARGER. I don't care what brand it is you can't get more real bass out of a package this size... physics is physics.","timestamp":"Reviewed in the United States August 7, 2020","profile_id":"AHWVSZSTGXPDVPTOWARPP5H5QPQA","is_verified":true,"helpful_count":193,"product_attributes":"Color: Black"},{"id":"RNUN8GDHN4LUE","title":"4.0 out of 5 stars High-Res is a Gimmick. SBC only on Shield 2019 Pro. better raw than Sony SRS-XB32 though","author":"SpeedingCheetah","rating":4,"content":"Don't fall for the label of \"High-Res Audio\" that many brands are putting on their speakers or headphones. At least Sony has grounds to say so kinda, as they support LDAC codec which is far better quality and resolution than even AptX.(LDAC 32bit/96kHz/990kbps vs AptX 16bit/48kHz/352kbps). And I don't think they mean High-Res for the AUX jack, as that audio is processed by the source DAC, not the speaker. This Anker does have AptX, but not the actual \"High-Res\" version AptX HD. (AptX has been around since BT early days btw. Since the very early 90's and AptX HD was out in 2009....and yet, u rarely see them on BT speakers despite their proven superior audio quality.I can get this speaker to connect to my Pixel 3 via AptX and it does sound surprisingly good for its size.It will only pair via SBC on my 2019 Nvidia Shield Pro. (SBC 16bit/44.1kHz/328kbps max)I tried a Sony SRS-XB32. That paired and used LDAC fine. However, it would have dropouts and pops every 30 sec or so.I have 2 sets of different Sony headphones, they use LDAC with no drop outs at all, but a Fiio BTR3 with LDAC that does cut out.I guess Shield is is picky.My main use for this speaker, is to replace a 10yr old Bose Soundlink 1 Bluetooth 2.0 speaker.I read this is a BT 5.0 speaker, and my 3 BT devices, the Shield, laptop and Pixel 3 are the same.I use this for my laptop(via Aux mostly) and recently my new Shield for late night TV watching when my large sound system is disruptive to my apartment neighbors or asleep roomates.Having 2 BT devices paired to this speaker at once(my laptop via BT and my Shield for example), when ever one devices makes a sound, the speaker will go silent for about 3 secs, then play the other source. It auto switching back to the other device it seems is harder for it as it pauses for much longer, 6 secs or so. Most of the time, i have to pause, or restart playback on the previous device to get sound to play. It is a little bit more gracefull when switching from the AUX source and the BT, but it still is a bit of a pause and fade in/out for a few secs. Best to mute or just disconnect the other source, to avoid your main source being interrupted constantly.The Bass Up default sound profile, is a tad muddy sounding, but had good sounding lows, for a speaker of this size. Turning it off, makes it sound too cheap and flat though. At least one can use the Smartphone app, (if you pair it to your phone) to use other profiles or a custom EQ. I am still playing with the EQ.Overall sound, i would say lacks some clarity and definition from the Bose Soundlink 1, but it has far better lows. Was hoping the \"tweeters\" this Anker has would be closest to the Bose, not quite it seems. (Bose does make very good products, but are overpriced. But i got the Soundlink speaker years ago at a Goodwill for $5...sooo....)Compare to the Sony SRS-XB32, which is a more expensive speaker, this Anker has better raw sound to me. Overall more clarity, definition, and more separation.Bass is tad deeper sounding up close, the Sony has a different design and seemed to output the deeper lows more front wise and could be heard better further away in that aspect. When using LDAC however, the Sony shines, despite the difference in no tweeters and different drivers. The Sony, however, only supports SBC and LDAC for some reason, so if i wanted to use my laptop via BT, it uses SBC. (The Sony also, if u have a AUX cable plugged in , it is locked to AUX mode, can't use BT unless you unplug cable...make it not usable for me.)Using the EQ in the Anker Sound core app, to make it more my taste, I really do like the sound this speaker produces, however, doing so, I can very much hear the poor quality and compression of SBC codec when playing music vids from my Emby Media Server from my Shield. Source audio files are FLAC or WAV. It really too bad this thing wont pair using AptX. Using my phone and AptX, it is much better sound. Laptop also will connect via AptX and sounds great too, but not as great as when using AUX of course, but, good enough that i may decide to ditch my Creative USB sound card that is eating up one of the 2 usb ports on the laptop.The USB C jack on this Anker is welcome, coming from a AC to DC adapter Barrel plug to charge.The top buttons are pretty much invisible on this thing. They blend in to much and are quite small, hard to find by feel alone as well.The power button on the side has a LED in it, so that is easy to find, but i would prefer power on the top along with the other buttons.Gotta give this speaker a bit more time to get adjusted to.It had a 15% off coupon sale when i purchased it here, so it makes it even more worth the lower cost than the Sony...but, it still is a disappointment for use as I mainly wanted with my Shield with AptX.EDIT: After a week of using this speaker, discovered some more quirks.The speaker does NOT remember the volume settings after you or it auto shuts off.This is especially annoying for use of AUX, as the volume is way to low and u have to press the Vol up button several times each time the speaker is powered up.The EQ you set in the app, does not function when using AUX.There is NO low battery notification at all. Only the power button LED blink red when u try to turn it on, then it turns off. No way to know the battery status while in use or at power up. (the Sony speaker had an option to announce battery level at each power on and, by default, had verbal battery low notifications on the speaker, several before it finally would die.) So unless you have this paired to a supported phone at all times and monitor via the app the battery charge, you have no idea on battery level. (those BT battery level in the phones OS is often very delayed and inaccurate in my experience with other battery powered BT devices)Battery life could be better for a speaker this size and weight. I have a much smaller Soundcore 2, and that is years old and lasts hours longer than this speaker. (Not a big deal for me, as I can just leave this speaker plugged into usb power from my hub most of the time.)","timestamp":"Reviewed in the United States January 21, 2020","profile_id":"AH7QQTSSML3TTGZK3PRZLC454YTA","is_verified":true,"helpful_count":54,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:21","page":1,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=1","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=2","asin":"B07P39MLKH","page":2,"pages":731,"reviews":[{"id":"R23A70EO7RCL99","title":"5.0 out of 5 stars This is it. Look no further !!","author":"Joseph C","rating":5,"content":"Bought 5 different brands in the past 6 months. Only one takes first place and with no compromise. Crisp clear sound, Heavy base , great mid range. Plus a dedicated equalizer. All this in a nice neat package. I’m not interested in battery life, so my opinion on that is open. The initial parring is quick and easy. The control buttons respond quickly. When you first turn it on it doesn’t shout “ blue tooth on”. For 70 dollars you will not find a better unit. It can compete with a unit that is twice the price.Once again , it’s a Job well done !!","timestamp":"Reviewed in the United States August 9, 2024","profile_id":"AEWWQRYIV3XHR6HRM6YALMVX6DPQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R22DABV4J0JVSY","title":"5.0 out of 5 stars Best Bluetooth Speaker","author":"Flux","rating":5,"content":"Purchased the speaker back in March 2020, and the device still works flawlessly. I even got it wet numerous times and it's still running without an issue.The design and the size is great, and so is the sound quality. I highly recommend this portable speaker","timestamp":"Reviewed in the United States September 3, 2024","profile_id":"AG7VBPNFJYQPOL5GJF6EWP7J6PNQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2KSIPHE6QT31B","title":"5.0 out of 5 stars Replaced My UE Speaker","author":"Stacy R. Wiley","rating":5,"content":"Awesome, Awesome, Awesome! A friend who is a music sound technician recommended this one and it is impressive! I adjusted the EQ for more banging base and it's wonderful. I purchase this one with a $20 off coupon for $80. Think I will just add another unit to have surround sound anywhere I take them.","timestamp":"Reviewed in the United States August 22, 2024","profile_id":"AHZTH6VRUASH3PP6OHC4NURQLKTA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2XJD2H0R604QM","title":"5.0 out of 5 stars This speaker won, out of many - I LOVE this speaker","author":"Michael C.","rating":5,"content":"As you can see from the attached pictures, I tested a good number of speakers. I was in search of a speaker around $100 or less that sounded good and would fit in a suitcase for airplane travel, and used indoors in hotel rooms and cruise ship cabins. I didn't closely check dimensions and mistakenly bought a few that turned out to be too large for that purpose. I was also targeting speakers with aux inputs and power bank capabilities so I would be able to use and simultaneously charge an aptX LL bluetooth receiver. This speaker didn't have the power bank functionality, but as it turns out, I don't need it (explained below).I have a choosy ear, and once equalized with the Soundcore app this Motion+ speaker sounded better at medium to low volumes than all of the others, including the Soundcore Motion Boom, and even the larger speakers you see in the pics. The sound out of the box was not great. The app's equalizer presets were not great either. I had to do a custom EQ to get the sound the way I liked it. The beauty with these Soundcore products is that the equalizer settings stay with the speaker. They are not specific to your phone. My only complaint with the app is that you cannot save multiple custom equalizer presets with the Motion+ like you can when using the app with the Motion Boom. Why the interfaces need to be different between the two speakers is beyond me.I do believe I noticed a difference with the aptX HD Audio. I could enable/disable that option in the phone's Bluetooth setting. With it on I can hear a little bit more fidelity. Of course, MP3s and streaming audio are not great sources for testing this sort of thing. I still heard a positive difference.HUGE BONUS (for me) that I didn't know about and don't see advertised anywhere on the product page. This thing supports aptX LL (low latency)! That must just come with the other Qualcomm aptX stuff. I use aptX LL to extend my whole home audio system to \"dumb\" speakers. I had purchased a tiny aptX LL receiver to plug into this speaker via the aux input, but now I don't need it!The Motion Boom was a close second, sounding better than the rest (once equalized) but losing to the Motion+ for my use case. The Motion Boom could get a little lower, and likely louder (not tested), but the Motion+ was punchier and had a better sounding low-end overall (once equalized). I'd say the Motion Boom is probably better for outdoor, high-volume listening. I already have a larger, less portable outdoor speaker that I'm happy with, so I returned the Motion Boom. I was disappointed that the Motion Boom didn't have an aux input, and I thought the soundstage was rather narrow with the treble changing pretty drastically as you walk past the front of the speaker. If I needed an outdoor speaker I'd definitely be trying out the Motion Boom Plus.I can't comment in detail on all of the other speakers I tried, but notable contenders were the Tribit XSound Mega which had surprising bass for its size, and the W-King X-10 which sounds pretty good loud but not so much at lower volumes. It's also rather large for a suitcase. The rest sounded like crap out of the box, to me, with little to no low end. Some had an app where I may have been able to make them sound better, but I did not try.I'm very happy with this speaker so far!","timestamp":"Reviewed in the United States January 21, 2023","profile_id":"AHHFOMVDJROC4MMFD23LOD5KDMOA","is_verified":true,"helpful_count":44,"product_attributes":"Color: Black"},{"id":"R2QLZOVM80GV5S","title":"5.0 out of 5 stars Nice Small Bluetooth Speaker","author":"K. Thomas","rating":5,"content":"This is fairly small but slightly heavy Bluetooth Speaker. It has a rubber coating and excellent sound especially at this price. Would highly recommend if looking for a smallish speaker with good sound. No this will rock your whole house but is excellent for one room. I listen to a lot of sports radio and use this in the garage for entertainment. Good value","timestamp":"Reviewed in the United States August 15, 2024","profile_id":"AFSLOZ7CC7JLHW4KXXOUXGZBDD4Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R8DUUUEX4F7VT","title":"5.0 out of 5 stars Well worth the price tag!!!","author":"manny","rating":5,"content":"I was looking for a speaker to fill my bathroom with music. I didn't want anything crazy. I was pleasantly surprised by how great this little thing sounds. Of course there are better sounding speakers out there but for the price this little thing punches above it's weight. If you're looking for bass this isn't it but it does have a great balance . I will consider this brand when I purchase speakers again","timestamp":"Reviewed in the United States August 11, 2024","profile_id":"AGD6CEQIWNZNR2X4VOT7KVRPDUYQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R6RXRMP7F42X6","title":"5.0 out of 5 stars As of 7/22, the best $100 speaker on the market!","author":"Joey Kot","rating":5,"content":"TL version:great sound with the companion app to balance the speakers EQ and take advantage of its balanced drivers.$100 is an absolute steal for the size (just short of the keys section of your keyboard) and sound with great dispersion, sound stage and bass impact [with the EQ tweeked]Excellent for a cheap sound bar solution as the voice clarity rivals my center channel speaker, absolutely shocking me tbh.First let me say i own an absurd amount of bluetooth speakers, everything from $20 pharmacy brands to the mega-sounding Aiwa Exos9. So when I saw anker get into the speaker game a few years back i figured it wouldn't be great - but not bad either. For the most part the soundcore line has been that, but has made considerable improvements over the years. some, like the soundcore 2 to 3 jump was not. the motion boom to motion boom +: Very much. I held off on the motion+ (this model) for a while and ended up getting it on prime day super cheap. While my wife wasn't happy to see another speaker sitting around... i sure am.Without seeming too full of myself, lets just say at 40 my hearing is well above that of a normal teenager let alone anyone my age. Because of this I've wedged my way into testing groups and other audio testing, my electrical engineering degree doesn't hurt either.. now on to the motion plus:its a unique size to be honest, its larger than what the price range would indicate, bigger than a bosemini for instance, smaller than an aiwa exos 3 but carries a price tag of $100-$120 USD which puts it into a questionable scenario based on suspicion alone. it has a weight that makes it feel well built, and a coating that to me says it doesnt. The coating is this rubberish coating that over time does wear out and become smooth (ala the soundcore 2 has), but its not a turn off. i don't expect an aluminum finish for these acoustics or price. The buttons are standard it seems on all soundcore speakers, up/down, bluetooth/tws, multi B button. this speaker also sports a Bass-UP button that i suggest you never use. it resets the EQ sound profiled to Bass-up and pressing the button again resets it to original. as features go, would be nice to see a scrolling EQ when this is pressed even if there is no visual aide to indicate where youre at. nitpicking folks, at its finest! Sound wise this thing shines. its frequency range is top to bottom for anyone to hear, and the soundstage disperses sound in leveled sweet spots from about 3 feet on a desk, about 12 feet out you start to loose the distinction but not the sound. this is above average for this sided speaker and i found myself using it more in situations where a smaller speaker wouldn't work. During my tests battery life was on par to what is listed as 12 hours, although like with all speakers the type and level of listening matters. I'm tempted to buy another and line them up next to my mid-sized go to pick, Aiwa's Exos 3... even though that device is larger slightly theres considerable comparisons. what might set the motion+ apart is its forward firing sub driver and open air port in the back, which puzzles me as to how it has a reflex port in the rear AND an ipx7 rating. you can bet im going to take this apart soon to find out... just as soon as i take a break from enjoying the sound of this thing during work. final conclusion is pretty straight forward, the negatives are few with the battery life being maybe, maybe a stretch the only down fall of this speaker. simply put, you will not find a speaker at one hundred dollars to replicate this sound. period. probably ever.","timestamp":"Reviewed in the United States July 21, 2022","profile_id":"AEU4QM6M252IYJLVIARY3YHJ3KHA","is_verified":true,"helpful_count":28,"product_attributes":"Color: Black"},{"id":"R104NRVAJCWY4K","title":"5.0 out of 5 stars Inexpensive and Good Sound","author":"DG","rating":5,"content":"I use this for computer and play from tablet while working. This is not a name brand like Bose, Bowers or Sonos. I have those as well. But a better value. The reasons are below after using for a while.1. Unlike others the multiple drivers produce stereo sound. The expensive brands BT speakers will tell you that it doesn't matter when two speakers are in close proximity. But if you are on a desk where the speaker is located, you will hear the clear difference a stereo speaker makes. You do not need to take the hassle of pairing in TWS fashion.2. Produces clean sound. I am not an audiophile but have decent ears being a former musician. Even the newer products from the company are falling for market gimmicks to attract customers. This is a slightly older model but still better. May be you get BT 5.0 instead of 5.3. I could care less.3. You can adjust the sound profile through the app.For the things I didn't like -- the USB and Aux input had a heavy rubberized cover that was unpleasant to move for charging and input. It is there for weather protection I get that. I cut it off to keep the ports open. It stays on my desk, not shower. A minor thing and not a product fault.","timestamp":"Reviewed in the United States June 8, 2024","profile_id":"AGDUMDFJA76JQFTYJFTTCTDE7MZA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2VI2VX8GNGL3P","title":"5.0 out of 5 stars Great speaker!","author":"Amelia","rating":5,"content":"I love this speaker! It has a sleek design so it’s not an eye sore. It feels extremely durable because it’s a little heavier than most portable speakers. So if you want something more lightweight then I’d go for a different soundcore speaker. The sound is great once you change it up in the custom EQ on the soundcore app. I think one problem I’m having is that it’s not staying on the custom EQ when after I turn it off and turn it back on.","timestamp":"Reviewed in the United States August 2, 2024","profile_id":"AFTPXFZCJEEF24BNJMCKXSYWM2OA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R21Q806M0ZPMJ7","title":"4.0 out of 5 stars Heavy","author":"Snoopsister","rating":4,"content":"The size is perfect for what I needed. And the sound is excellent That being said, I am returning it. It weighs almost 3 lb and it's just way too heavy. Yes, the sound is excellent. But it's too heavy to carry around with me. I just feel like it's weight makes it inconvenient. (I had an excellent one from Axess that died last month. It was slightly larger, but the sound was excellent even when I turned it up to blast, and it weighed less than a lb. It was light and very convenient to take anywhere. I would recommend it over this one.","timestamp":"Reviewed in the United States July 19, 2024","profile_id":"AGDXA7ENBD6IBIGMAV6USIKPGCYA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:23","page":2,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=2","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=3","asin":"B07P39MLKH","page":3,"pages":731,"reviews":[{"id":"R2Z4G7YU22UY5E","title":"4.0 out of 5 stars Not good for stereo but decent for the price in a small speaker.","author":"JD and MD","rating":4,"content":"Full disclosure: I am a musician and recording professional, so I may be a bit more critical or discerning than the average consumer. That said, I hope this review will help anyone else on a similar quest. I was on the search for a pair of bluetooth speakers to connect in stereo for use in our yard or home. I purchased 2 JBL Xtreme (first edition) at $150 a piece, so $300 for the pair. I had issues with connectivity and could only use them if they were within 5 feet of each other. The sound was decent and plenty loud, but too hyped up in the bass. They made a lot of songs sound muffled or too boomy. The JBL app has no options for EQ so you’re basically stuck with what you get if you want to use multiple devices to connect.I then looked around and found some great reviews on these Motion+ speakers and liked the price point, plus the fact that I could use a custom EQ. They also use bluetooth 5.0 so I thought it would be better for connectivity. So I ordered 2. Turns out stereo connectivity was only better by about a foot or two! Same issue as the JBLs! Dang. I guess that’s just what you get when pairing multiple speakers. I live in Portland, OR, so we are not rural, but our yard is a half acre and I didn’t think I’d have this much of a problem with interference. Funny how speaker manufacturers all advertise up to 30 feet, but have a disclaimer about it depending on other mysterious factors. Like living in city?The custom EQ was nice for the motion plus speakers, but with some caveats. First off, you are starting with a sound that is so boxy and mid focused, I just wonder what the heck they were thinking. With the default EQ setting, these were absolutely horrible sounding. By cutting some mids, I was able to get a decent sound (posted a picture of my settings) but still a bit boxy. The problem is, in stereo mode, only the master speaker changes with the EQ. This led to a lot of fiddling with connecting and disconnecting the individual speakers to try to get each one EQ’d the same as the other. After tons of back and forth I was able to get them sounding decent. I found cutting mids reduced the volume output, but sounded better than boosting low and high frequencies.The real problems came about when the Bluetooth connection started get really strange. Volume fluctuations and skipping like a cd that’s scratched. I had to leave my phone right next to the speaker to resolve the issue, but at about 10 or 15 feet away with no obstructions, there was definitely issues. I returned these after that, as the whole point was to have music filling up our large back yard with a decent sound, but have the phone on my person to be able to DJ tracks.I went to best buy today to try out some other options. I figured one bigger speaker would be a better solution at this point. The Ultimate Ears Hyperboom won...by a mile. That speaker is amazing sounding. Not sure why Amazon doesn’t sell these new, but for $399 that speaker kills the competition. My search is over. I just ordered one direct from UE.I feel bad for buying and returning speakers but hopefully this review will help someone else who is looking for the best sound for indoor and outdoor use. The bose pro system also sounded great but at $600 it wasn’t much better than the UE hyperboom....and with no 360 sound, I’d need two and I am definitely not willing to part with $1200 at this point and I want a more portable option as well.Good luck all you music lovers, and I highly recommend that JBL and Anker/Soundcore look into making something that will compete with UE’s Hyperboom. That speaker kills the JBL Boombox...and the JBL partybox lineup just sounds loud. No balanced sound, just loud. Sony’s lineup also sounded decent but a little lacking comparatively. If you’re like me, and like to hear/feel the sub frequencies, the Hyperboom is a clear winner. JBL boombox is next in line, but my wife hated the look of it.Long review here, but I saw there is a shortage of detailed and technical reviews for what I was looking to get, which is a big sound in an indoor/outdoor portable bluetooth speaker, for a reasonable price.","timestamp":"Reviewed in the United States September 7, 2020","profile_id":"AEZZMXVRUJAWYFY72SGSWECFPY6A","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"RICMATGLW44ZR","title":"4.0 out of 5 stars Beats the Doss Soundbox XL Hands Down, Freaking Awesome Sound","author":"Handy","rating":4,"content":"Update: 8-24-19I have now had this thing for a bit over a week and I can truly say that this is the bestportable speaker I have ever had. Battery life is awesome and music is great. Thanks Anker.Sooo, a couple of weeks ago I purchased the Doss Soundbox XL. I had been checking out reviews andI really thought that it would be the speaker for me. I was really excited to get it in my hands.But like finding out your Facebook date looks nothing like the pictures, it was a huge let down.I knew after the first 3 songs that it was nothing like I thought it would be. Very muddy sound,and super small sound window. It was like having a blanket thrown over it.After trying everything I could to fix it, I finally sent it back.As soon as I got the refund I ordered this, the Anker Soundcore Motion+, and waited impatientlyfor it to arrive and have now had it for a bit over 8 hours.I remember when I opened the Doss I was really surprised at how big it was, almost awkward.This was not the case with this speaker. Very nice package and a good weight to it.This thing is simplicity in it's self. Buttons are easy to find, just a momentary push on the powerbutton turns it on and into pairing mode. It starts in \"base up\" mode which was fine for me.Played my first song. Big smile, oh yea. Clear highs, very tight base that was clear and robust.Very nice sound stage. So I did the same thing as I did with the Doss, I took it all over the houseto hear how it sounds. Corners make this thing come alive. It truly is where this speaker wants to live.One thing I learned was that this speaker comes with the ability to play aptx and that Android8.0 or above has this option. This is a Bluetooth tech that allows the music to sound as much likeCD quality as possible using Bluetooth. Bluetooth data has to be compressed to send to the speakerand usually that causes sound quality issues. But this tech aims to fix this and seems to really work well.I then took this speaker with me to a building I'm working on and it's empty right now. It's a big100' x 100' building. It has a few small 8\" corners along the front of the building and I made that it'shome. Kicked up some tunes and got to work. All I can say is this thing simply blows me away in it'sability to project good sound even in such a large empty area. Of course, once I started using equipmentit cannot compete but dang. I would walk out and back into the building and it just sounded awesome.So, now for the only thing I don't like, and the only reason I gave it four stars.The app. Now the app it's self is not really the issue at all. It's the privacy agreementand all the things they make you allow to use it. It's off the charts. If you care anythingat all about your privacy then this app is a no go. And this is where things get ugly.See, you cannot update the firmware without the app. So in order to update the speakersfirmware, I have to accept some very ugly privacy conditions that I simply cannot agree to.Sadly, most people don't even read these anymore. They just click and play. No thought aboutall the stuff that is being sent to Anker in the background. And not just Anker, but all their affiliates.This is like a huge spiderweb of companies that we know nothing about.To get past this, I just installed it and then after getting the update, I just uninstalled it.It's weird, some of their speakers can be upgraded on your pc, but this one cannot.So Anker, please if you read any of these reviews, fix this so we can at least update the speakeron our computers at home without having to accept and agree to terms we don't like. Honestly,I should not have to allow you to have all that information just to use a equalizer and updater.So besides that one issue, this thing rocks like no tomorrow on virtually anything I played on it.And will be my go to portable speaker for as long as the thing will play.Thanks again to Oluv's Gadgets for reviewing this great speaker, I should have trusted your judgementin the first place.Enjoy : )","timestamp":"Reviewed in the United States August 20, 2019","profile_id":"AH5V4FGFB6RGWQGFJZAK5MGAHZUQ","is_verified":true,"helpful_count":31,"product_attributes":"Color: Black"},{"id":"R1EB8M1E8RTIXU","title":"5.0 out of 5 stars Probably the Best Speaker for this Price Range","author":"imyourpal","rating":5,"content":"I put this up for comparison vs my first generation JBL Xtreme and also the first generation Bose Soundlink Mini. Keep in mind that the Soundlink Mini is a smaller speaker and isn't necessarily in the same league, but price wise it is.Volume - JBL Xtreme takes it, Soundcore Motion+ comes in close second, Bose Soundlink Mini hard thirdSound quality - Both the JBL Xtreme and Bose Soundlink Mini had a clear emphasis on bass, to the point where unless you used a third-party equalizer it could get pretty muddy at times. Neither distorted at high volumes, but the DSP definitely showed it's limits. For a party, you might not really care, but for focused listening you'll notice it for sure. I believe that the Xtreme, while rated at 40W output, only gives 20W when played unplugged, but I could be wrong. Soundlink Mini has no wattage output as Bose generally doesn't provide that. Soundcore Motion+ has both speakers beat here - it's got a relatively flat DSP, and the app does have an equalizer that you can customize. Whether plugged in or not, it supposedly outputs it's full 30W. There's clear stereo separation on this speaker as well, and I think (but am not sure) that the JBL Xtreme has two tweeters as well. For this I'd go Soundcore Motion+ first, JBL Xtreme second, and Bose Soundlink Mini third.Size/Portability - JBL Xtreme is the largest but comes with straps, Soundcore Motion+ is second with no case/straps, and SoundLink Mini is smallest with optional cases. The Motion+ is actually pretty easy to transport in my gym bag and I definitely don't notice it there as much as the Xtreme. I'd go with the Motion+ for best overall portability.Inputs - All three speakers have bluetooth/AUX inputs, and the Xtreme takes it one step further with USB inputs. by sheer number of options, JBL Xtreme is first, followed by the Soundcore Motion+ as it has BT 5.0/USB C, and Soundlink Mini last.Weather-Proofing - JBL Xtreme and Soundcore are more or less tied here (waterproof/resistant, dust proof/resistant, have sealed flaps for the ports) while the Soundlink is meant for dry/temperate use only.Battery Life - Considering I've owned the Xtreme and the Soundlink Mini since they came out, their batteries have definitely deteriorated so they don't get the same amount of hours they used to get. I'd say that the Xtreme at it's peak gave me about 8 hours and the Soundlink about 6-8 as well. Motion+ is rated for 12 hours and I've been getting about 10-12 hours. Motion+ first, Xtreme second, Soundlink third.Charging - Both the Xtreme and Soundlink have their own proprietary chargers which can be incredibly inconvenient. Motion+ charges via USB-C and can be charged with some higher powered portable battery packs as well as wall warts, which make it the clear winner. The Xtreme does have the added benefit of providing power through it's USB ports which is handy in a pinch. You could attach something like the Moto Stream and run it off the Xtreme's battery while playing via AUX to have a better party speaker which is kinda neat. Motion+ first, Xtreme and Soundlink tied, with the Xtreme having a slight edge on being able to power other devices as well.App Support - Bonus or negative depending on your view. Bose doesn't have an app for it's first generation speaker so it's not considered. JBL's app is relatively simple, but doesn't provide any EQ for it's Xtreme. You can link another speaker to it, so long as it's supported by it's proprietary Connect... connection (note it does NOT work with Connect+ speakers, so you can't connect the Xtreme to the Xtreme2 which is a bummer). Soundcore app is simple as well, but includes a customizable EQ and allows for your speakers to connect to other Soundcore speakers. Overall I'd give it to the Soundcore Motion+ for it's customizable EQ.To me the contest is clearly between the Xtreme and the Motion+; the Soundlink just doesn't compare despite being priced similarly. I'd say the best overall speaker around this price range is definitely the Motion+ - it covers all of it's bases nicely and can match the Xtreme in enough categories while sounding better. If you can get this speaker for sub $90, then you got yourself a deal!","timestamp":"Reviewed in the United States September 30, 2019","profile_id":"AGIWDIAYZVC6JN52X4JMH3VXRUFA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"RYDPPP0EOIU0I","title":"5.0 out of 5 stars This thing is loud for it's size","author":"dude","rating":5,"content":"Wife loves it and it is plenty loud with little distortion. It packs a punch for its size and I'd buy again","timestamp":"Reviewed in the United States August 25, 2024","profile_id":"AFDUDHF2FTAV4QND73HMBB3XLVFA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R16NUT1LU9S2BB","title":"5.0 out of 5 stars Quality, Reliability, Great Value","author":"Amazon Customer","rating":5,"content":"Have been enjoying this speaker over a year. Never had any problems. I listen to most types of music with the exception of rap. Classical music with its many layers is where this speaker shines. It is easy to hear all the instruments with nothing being muffled. The unit charges quickly and lasts for at least eight hours. Fits nicely on a desk top. I mostly use it when sewing, and working out. Great value and highly recommend.","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AFNTZTM2F2MVBHSNISADHK3YX56Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2Z5HI05VLYHX","title":"5.0 out of 5 stars Almost perfect.","author":"Steel Horse","rating":5,"content":"No star deduction because it does everything as advertised and sounds great doing it, but it would be beyond ideal if it had an arc-hdmi in-put to couple up to my tv instead of the aux input which limits it’s interface with the tv. For a small tv in a small space it is ideal though. I also love jamming my music through it as its volume and sound quality are considerable considering its size.","timestamp":"Reviewed in the United States July 24, 2024","profile_id":"AEVKJR4HVIG2SSCZV4I2FESYTSWQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R323D0FEECY95M","title":"5.0 out of 5 stars Amazing Sound, quality build","author":"Trevis C.","rating":5,"content":"I bought several Bluetooth wireless speakers for the $20 ~ $50 range and this speaker is hands down the best sounding. Slightly larger and heavier than the others within that price range, but worth it. The bass is much deeper and just sounds better all the way around.","timestamp":"Reviewed in the United States August 6, 2024","profile_id":"AEE7P33HC6GTWRNNEX24MJSZIXJQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1E9O29TE9CVZY","title":"5.0 out of 5 stars Great speaker at a great place.","author":"James","rating":5,"content":"I use the speaker every day with my MacBook Air and it works great. The sound is really high quality and can get quite loud. It has a good bass and excellent treble. I can’t recommend this speaker enough.","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AGBWVKOV3LECXTNV3QYSLDF7QY5Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3CJPXMZZ90WFJ","title":"5.0 out of 5 stars Best HI-FI speaker.","author":"Carlos","rating":5,"content":"This speaker is amazing. For the world be buyer, you need the proper device that supports aptx hd codec. If not, you will not experience its full potential","timestamp":"Reviewed in the United States August 16, 2024","profile_id":"AFWCNLLUVWPY5PPGCLDSVMWAIW7Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1PB5Z68NBJVE2","title":"5.0 out of 5 stars Insane speaker","author":"Cody Welcher","rating":5,"content":"Has absolutely no business being as good as it is, but it do.","timestamp":"Reviewed in the United States August 26, 2024","profile_id":"AF2Z5PAHJVVOU3PQW34IO5LZFTFA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:24","page":3,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=3","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=4","asin":"B07P39MLKH","page":4,"pages":731,"reviews":[{"id":"R5YJ9IGH1AFCZ","title":"4.0 out of 5 stars Love it but has annoying cons","author":"Jon Rodriguez","rating":4,"content":"I bought this speaker after my tribit 20 to 30 dollar speakers died so I'll compare the anker with the tribit speaker.The anker is significantly louder, bigger and heavier. It has a led on the power button that is white when it's on or red when it is low on battery power. When you turn it on. It plays the usual anker jingle when powered on and off if you own any of their earbuds and headphones.What I like: it gets loud and it's clear. The bass is not feel it in your chest but it's pretty good better than the tribit for sure. I like the buttons on top, they are big and easy to press. The overall materials and heft to it just gives the impression of durability and good build quality. I also like how thick and big the rubber protector is on the usb c and output connectors section. Of course it's a usb c charging format.The middle of the road things:My tribit speaker lasted about 24 hours before needing to charge but would take 8 hours or more to charge. This one lasts for about 12 hours (haven't really tested it but seems about right plus or minus). However it takes usually 2 to 4 hours to charge back up so take note of that. It's not plug and play (I'll get into that in cons). Power button is smaller than the tribit and located on the side and not as easy to press.What I don't like:The bass button and feature is doodoo. It basically is there to make the default settings better which it does. However the default sound settings are horrible. This is not, I repeat not open up the box charge and play. You really need the soundcore app for this bad boy. It's vital that you go into the app and use the equalizer to make it sound good. Don't use the preset modes they are pretty bad too. there is an issue with that too. If you own any earbuds or headphones there are options to have multiple eq profiles(that you created) that you can switch between. This has 1 so you cannot switch between profiles depending on what your listening to which is perplexing to say the least. The other thing I don't like is the price.my tribit cost me 20 to 30 bucks. This shouldn't cost 100 bucks or 90 bucks at all. This should cost 60 to 75 bucks max regular price. It's louder yes but it really doesn't improve battery life, it's not plug and play and I don't care much about setting it up but just 1 eq profile? Really?In conclusion is it good? Yes. Does it have stupid cons? Yes is it worth full price hell no? Should you buy it? Hell yea but only if on sale not full price.","timestamp":"Reviewed in the United States October 12, 2023","profile_id":"AFSWTPDGR57E567Y5GSOJKRQUN3Q","is_verified":true,"helpful_count":10,"product_attributes":"Color: Black"},{"id":"R2G3VQW1K8ST8H","title":"4.0 out of 5 stars Quality changes with complex music","author":"AA","rating":4,"content":"Just like ALL devices with speakers, all the tests and YT reviewers all use SIMPLE audio to perform so-called tests… Providing the devices with the least stress possible.This particular device, actually does the best for its size with simple audio, HOWEVER with complex music such as Classical music or Metal, all the smaller devices completely fall apart. Why? The 2cent answer is because a piece of complex music requires reproduction of almost the entire frequency spectrum at the same time (think ALL the instruments at the same time), so that when a speaker’s suspension is moving to reproduce bass frequencies, it ALSO has to reproduce audio from a smaller wave at the center of the speaker… sound waves then crash into each other all over the place and this is called DISTORTION…The question is, does this one? At lower volumes, this SoundCore motion+ actually does very well, but this IS NOT for blasting, in fact I still have yet to come across another product of this size that does this well.As far as accuracy of sound, again, at low volumes it’s fantastic… at mid volumes it still outperforms everything in its size and price…If you like LOUD Complex music, there is NOTHING in this size that will do the trick.","timestamp":"Reviewed in the United States May 7, 2024","profile_id":"AEAN6TP6HQOIMBQELTJBK6ISXJWQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1B9GB35H5GHH2","title":"3.0 out of 5 stars Good but not great","author":"RPG Fan","rating":3,"content":"Soundcore Motion + is much much better than our JBL Flip 3. it’s s good upgrade, but it’s still not great.-it’s good, but not great, for 80s hard rock / metal and guitar instrumental 80s shreddy stuff, but only at low volume levels. I rate it 3/5 stars for 80s Hard Rock / Metal.-IMO this is not worth $80 that I paid for it. I wish I would have spent a little more for a Bose or Klipsch speaker instead. And I would have only paid around $30ish if I knew how it really sounds before I bought it. The YouTube videos make it sound much better than it actually sounds in person.+It sounds much better with Rap music than it does for Rock music. I listened to some old school Death Row records Gang Related sound track, some Warren G Regulate, some DPG Dog Food and some and Daz Dillingers Retaliation, Revenge and Get Back (these albums are VERY bass heavy) and it surprised me on how good it handled the heavy bass. I rate it 3.5/5 stars for Rap *at low volume.*+The build quality is excellent. It’s big and heavy and not cheap and light. It feels real solid - like something that will never break. I rate the build quality 5/5 stars.+1980s Hi Fi stereos like Sanyo or Fisher had a incredible / great sound. Klipsch 2.1 speakers for a PC is an incredible / great sound. But Soundcore Motion + isn’t even in the same realm of sound quality as those listed above. it’s “good” at low volume before it gets muddy at higher volume, but it’s still only good and not great.-I had to install a Soundcore app on my phone to get it to connect, this rubbed me the wrong way.. It’s stupid and the EQ is overrated and is a joke.Overall I give it 3/5 stars, and if I could do it over I wouldn’t buy this product again. I don’t hate it or anything like that, it’s fun to play around with and it does come in handy when I want to use it, but it’s just not worth the money I paid for it.","timestamp":"Reviewed in the United States June 29, 2024","profile_id":"AF47Q63GJELW6FOUVHCMDNFHT3VQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R1VJKNGN4MRIDC","title":"4.0 out of 5 stars Awesome","author":"T","rating":4,"content":"Awesome","timestamp":"Reviewed in the United States August 28, 2024","profile_id":"AHYHPYOOGWDOPOSF24GYHJ5GT4CQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2KIH28MRB63FM","title":"5.0 out of 5 stars Durable, great sound","author":"Vic","rating":5,"content":"This is my first bluetooth speaker. I am normally picky about my audio equipment and this has not disappointed. We watch movies with it on a laptop. Usually with a pair or Vanatoo Transparency Ones. It sounds really good for the price. It's heavy for it's size but it feels solid and high quality. My nitpick is I wish I could figure out how to turn off the \"on/off\" sound it makes. It's probably not annoying to most people but I just like to control sounds on my devices.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AHGZTEFUE4KGDINMOV6HUSFNQ2DQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1PNKUL0DF10R3","title":"5.0 out of 5 stars Fully has met my expectations thus far...","author":"Bruce A. Smith","rating":5,"content":"I was looking for something beefier than my Oontz 3 Ultra...not that I was ever really unhappy with that critter. It's just that, when you wanna win in the ring, sometime's you gotta go with a mid weight fighter, not the light weight.I will admit that I'm a bit of a snob when it comes to \"bass\". If I can't hear it or feel it, I'm left feeling empty. Especially at a lower volume setting. And, that's where the Oontz 3 disappointed me. Not so much with my new Anker Soundcore Motion Plus.I know, I know... it's not even really fair to compare the two because they shouldn't be in the same ring, throwing punches at each other. All I'm saying, is that if you want a bigger punch, with all of the flair included, I suggest the Anker option.Bear in mind however, that if you decide on the Motion +, you will surrender a round or two on the scoring card of \"portability\". Anker's Motion + is heavier and much larger. It still fits into my bookbag and laptop carrier okay, but there is a noticeable difference when trying to make room for it, and especially when lugging the bags around.With all this being said? I love this new ANKER speaker. And, I don't see myself ever going back to an Oontz Ultra. But, please remember that I am extremely picky when it comes to hearing AND feeling my music. If you're in the same boat as I am? Let the Anker be your new anchor. It'll keep you grounded in your music for sure.","timestamp":"Reviewed in the United States March 24, 2024","profile_id":"AHPNWBQKYZLBURPJM4PLAOGPKTEQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R1V3OET7FBY0K0","title":"5.0 out of 5 stars good service","author":"michael brauner","rating":5,"content":"The sound is Great and the Batt last long time","timestamp":"Reviewed in the United States August 21, 2024","profile_id":"AFDOC3FR622D64J6PUBT574467EA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3ID0AVHR9CW7C","title":"5.0 out of 5 stars Incredible Audio Quality","author":"SK","rating":5,"content":"This is easily the best Bluetooth speaker I've owned. The sound quality is incredible. When the bass boost is enabled, the bass is just about perfect (it's pretty underwhelming without the boost). I keep it plugged into power most of the time, so I can't speak to battery life. Bluetooth pairing was a little awkward with my laptop for some reason, but that's probably because I didn't read the manual.Is it worth the current price ($100)? If you're looking for something portable with great sound, definitely! If you're using it as a stationary speaker like I typically do, probably not.","timestamp":"Reviewed in the United States June 28, 2024","profile_id":"AGY7PIJOPNULNHIKZJKWJM2F5C4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R35AC0QGDC97WW","title":"4.0 out of 5 stars Pretty good but consider the EarFun UBOOM L too","author":"TazMan","rating":4,"content":"The Motion+ is a very good speaker at this price range. To get the best out of it look around on the internet for some EQ recommendations to start with. Keep in mind that every firmware update can affect the sound quality.I honestly wasn't that impressed with this speaker out of the box. I got it dialed in much better by using the EQ in the Soundcore app but there are still some frequencies that are overboosted that I can't tune out with the EQ and since I am using an IOS device Apple doesn't give me anything that will work with Amazon Music.Out out of the box I'd give it a 5/10 for its size. Dialed in I'd say closer to 8/10. I bought the EarFun Bluetooth Speaker UBOOM L at the same time. Basically, no EQ options for it as it doesn't have an app. You can choose sound modes which are for indoor or outdoor which seems to accentuate or attenuate the bass a bit. Out of the box this speaker sounded far better than the Motion+. Even with the Motion+ dialed in the best I could with the EQ the Uboom sounds better. I'd give it an 8.5 or 9/10. The best I've tried in this size group has to be the JBL Charge 5 WiFi.It costs twice as much as the Motion+ or Uboom but I caught it on sale and it was very close in price to the Motion+. It also has the best battery life of the 3.The Motion+ is a good option. The bass lacks compared to the other 2 I've mentioned but mids and highs are pretty good but there is a sort of a peak around 5k that makes it a bit shrill. The other 2 seem to extend better into the bass area.I'd give it a solid 4 out of 5 stars. It is clearly one of the best in this size group. I'd put it a #3 cost no object. I'd put it at #2 if cost is an object. The Uboom is #2 for best sound independent of price and #1 if cost is a significant driver. Best sound is JBL Charge 5 WiFi by a nose so #1 here. I'd put it #3 if cost is very important. If you can catch it on sale, It would be a tough decision between it and the Uboom.","timestamp":"Reviewed in the United States November 14, 2023","profile_id":"AGIWD5JTRA54MGAL4GGQ34HWTIMA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R33VIU0WU1MBEU","title":"5.0 out of 5 stars Excellent, But Revision/Firmware Differences Limit Functionality","author":"DMA","rating":5,"content":"I originally purchased this Soundcore Motion+ more than a year ago, and once I customized the EQ via the Soundcore app, I was super impressed with the sound quality. I never would have expected such (comparatively) impressive bass in conjunction with crisp, non-shrill highs from such a small enclosure. It has been a joy to use.After reading of how terrific these speakers sound when joined in pairs for the full left/right stereo effect, I purchased another from Amazon yesterday. Alas, after going through the pairing directions multiple times, I had no success in pairing the two speakers.In my research to find out the cause of the problem, I followed Anker's posted instructions on how to reset the speakers, delete the pairings from my phone, etc., but no luck. I then happened upon a post in Anker Community forum where the person had two speakers with two *different* firmware revisions, and they submitted a ticket to Anker to find out if the pairing should still work. Anker responded that: *no, in fact it won't*. When I doubled-checked my speakers, my older speaker (FCC ID ending in A3116) had a firmware revision of 45.xx, while the new one (FCC ID ending in A3116J) has a revision of 75.xx, so that is my issue. It is unclear if Anker would be able to update my older speaker's firmware at some point to match the new one, or if hardware enhancements might prevent this. Presently, though, I am unable to make use of stereo pairing of the two speakers, which is the entire reason I purchased the second Motion+.*Edit: I reached out to Anker support with this question, and they promptly responded that, yes, this is the case: the two versions actually contain different chipsets, and they will NOT pair with one another.****Edit: I originally knocked off one star for this issue, but I have now added it back, as I purchased another of the newer version speakers, and it pairs effortlessly with its twin. I will gift the older version to someone, since I don't need three units. They all sound wonderful, though.I would prefer that Anker make some distinction as to the different revisions of this product and perhaps add a disclaimer about the pairing issue between different versions. If not Anker, then perhaps Amazon could take the initiative and edit the item description. Should potentional buyers want to be able to take advantage of the stereo pairing feature, particularly if they already have a Motion+, I would recommend buying them in pairs to maximize the chances of getting the same hardware revision and firmware.Overall though, it's a fantastic little speaker with wonderful sound quality and sufficient battery life for my needs, and I would highly recommend it.","timestamp":"Reviewed in the United States June 9, 2023","profile_id":"AFEKQJBJSQZUOG54HQF6B7DBYZBQ","is_verified":true,"helpful_count":25,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:25","page":4,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=4","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=5","asin":"B07P39MLKH","page":5,"pages":731,"reviews":[{"id":"R3LQM8MQ0P8PLD","title":"5.0 out of 5 stars Works great, can leave plugged in!","author":"Ken","rating":5,"content":"I wanted a speaker/system I could throw up on a shelf in my large 30'x50' garage, I wanted to have it powered with a cord and I didn't want to have to turn it on by pushing a button every time I wanted to use it. It is so hard to find something that checks those boxes but this does. I have it sitting on a piece of wood on an old drill press in the corner about 8' in the air (16' ceilings), I have a usb-c cord plugged into a wall adapter and into the speaker, and I just leave it on all the time. When i'm going to work in my garage, I just open up blue tooth on my phone, connect to the speaker, and open up pandora and i'm good to go. With the volume all the way up it is pretty damn loud, i normally have the volume around 80%, and even if i'm welding or grinding, i can usually still hear it just fine. Awesome speaker!","timestamp":"Reviewed in the United States May 5, 2024","profile_id":"AH5JLXFPSXYFTACTEXWBU2UGUJ4A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2GH4AQZKUBPPH","title":"5.0 out of 5 stars For it's size, can't be beaten. One of my favorites.","author":"David Bryan","rating":5,"content":"I am a totally addicted to Bluetooth speakers and to quality sound. For the most part, you get what you pay for when you buy speakers. In the attached picture, you will see a lot of speakers. There are pros and cons to each one and each one serves a purpose. Here is some of what I've found on each one:Aiwa Exos 9 - This is a great speaker for a party or for camping. It is 200 watts and has an equalizer so that you can get the sound just like you want it. It is very loud, but will distort when you turn it all the way up. It is too large and usually unpractical for most situations.Harmon Kardon Go Play 2 - I like this speaker for indoor use. It is 100 watts and has some deep low end sound. It is heavy and pretty large. The main thing I don't like is that the battery won't last more than about 2 hours when you listen to it at a decent volume.Logitech Boombox - I have two of these and they were my go to speaker for about 5-6 years. The sound is very close to the Anker Soundcore Motion+, but these are quite a bit bigger. Also, I think the Anker Soundcore+ sounds a little better due to the equalizer on the Soundcore.JBL Xtreme (version 1) - This is currently one of my favorite speakers. I use it for listening to music on the beach or around the pool. It has more pronounced bass than the Xtreme 2. It sounds great and has no distortion at full volume and it gets loud. The Anker actually gets very close to as loud, but the Xtreme maintains its bass at it's highest volume and the Anker loses some of it's thump at full volume.Anker Soundcore Motion+ - This is also one on my favorite speakers. I love both the equalize and the volume. It does not distort at full volume, but does lose some bass. It sounds much larger than it's size which means you get a very portable loud speaker with great sound. I am so impressed with how much power this smaller speaker delivers. It is very versatile and will work for almost any occasion.Bose Soundlink Mini II - This speaker is amazing for its size. It is great at lower volumes for listening at home or around a pool. It's portability is hard to beat and it puts out amazing bass for its size. It just doesn't shine when you turn it up as it loses almost all of it's bass when you go past 60-70 percent volume.JBL Flip (version 1) - At one time, this speaker was considered amazing. It is loud for it's size. These days, I'm sure the newer versions are much better when it comes to sound quality. I use this speaker for white noise when I am staying at a hotel or on vacation.Overall, my new favorite speakers are the JBL Xtreme and the Anker Soundcore Motion+. They are both amazing and the JBL is slightly more powerful. The Anker's size, weight, equalizer and power make it more portable/convenient for most listening situations. In all of my years of buying speakers (and I own a lot more than just the ones in this pic), I haven't found a better value for the money. Even if you don't get it at the discounted price, it is huge bargain. If you're on the fence, go for it. You won't regret it!","timestamp":"Reviewed in the United States January 25, 2020","profile_id":"AGHOTCVPOKO5LDKFW4HTNXZUM7IQ","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R1VEN6LZ5QHBZ7","title":"5.0 out of 5 stars Great speaker","author":"Walter hughes","rating":5,"content":"Excellent sound quality .very loud a d holds a long charge","timestamp":"Reviewed in the United States August 8, 2024","profile_id":"AF73J2Y3UXQ7YNU3DJUMG25SM5QA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R56I69OFW1W11","title":"5.0 out of 5 stars Hail ! The New Junior Welterweight Champ!!!","author":"Gerald S. Brady","rating":5,"content":"I know a lot about and own several Bluetooth speakers. I own I think the largest \"party speaker\" that Anker makes the Rave, which is a very excellent product. I also own a W-King, also a very excellent product. I was using my W-King on my nightstand about 2 feet from my head. I had acquired a desire to upgrade the W-King with something perhaps more elegant and smaller and less utility looking. Eureka! I happened upon this heavenly creature of a Bluetooth speaker. The W-King currently costing $75 dollars is still the best bang for $75. If You are not so poor that you can't squeeze another $25 dollars out of your wallet, I very strongly suggest that you pull those rubber bands from around you wallet, let those moths escape and kerplunk down $100 and buy this box instead. I used my W-King as a reference point in my quest to hopefully replace it. The Motion+ is half the size of the W-King and sexy. It has the build quality and appearance of an Apple product ( Dr. Dre. Pill on illegal steroids.) Hold on to your hat ....... although smaller, this thing plays louder and clearer than the W-King, I mean actually. If I had not myself purchased this and blindfold tested this, I would swear that I was hearing a Bose Wave CD player. I had considered buying a second Motion+ but decided not to. Unless you have to realize the added dimension of stereo you'd be make something that sounds really good, sound really good and loud. I don't need that in my life. A second one of these would be a waste of money as you would always be listening to the two at a low volume setting. (Two of these could work out for you if you throw parties. Your guests would be wondering where is he hiding his towers and subwoofer ?) Thank You Anker !!!! This is a revision to my prior review. I previously stated that owning two of these would be a waste of money. At this time I would like to retract that statement as nonsense. I took the plunge and bought a second Motion+. My position on the matter now is that two of these make something that sounds good, sound better (probably something to do with increased power bandwidth using two). I have these installed on either side of my headboard. I sleep literally bathed in hi-fi. I sometimes sit on the other side of the room astounded that that sound is coming from those tiny drivers and passive radiators, (A coup de gras for Anker research & development and engineering.) However I should point out as some other reviewers have there. is a problem sometimes with bluetooth connectivity. I choose to call this phenomenon \"line of sight radio wave interference\". If you learn to live with this system, the problem will loom as minuscule. Also some reviewers have complained about the sound quality. I could only imagine that these people do not or don't know how to use the included Soundcore equalizer. ( With this, and any audio system a graphic equalizer is essential to optimize performance and sound quality.) Using Anker's or any good equalizer app plugin I can find nothing wrong with the sound of this box. ( What doe's anyone require from a box that's 9.5 by 3 inches and cost one hundred dollars and has a battery and is portable, and fits in your pocket if you wear a big coat ???!!!). Thank you Anker.","timestamp":"Reviewed in the United States July 10, 2020","profile_id":"AHC5KODBOLAH3V62W4MMUSNOH74A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R33O85NXA7P4Q1","title":"5.0 out of 5 stars App has an equalizer!!!","author":"Kevin Meffe","rating":5,"content":"This is all I need. Great sound at high or low volumes and for TV or music! Takes up very little space!The EQ and other balance settings are effective and easy to use!I've had this for about 3 weeks.","timestamp":"Reviewed in the United States July 18, 2024","profile_id":"AHPMITGIRRP3XNERQHW6LPPMNE7A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1D176JMJ3NBSO","title":"5.0 out of 5 stars Best customer service","author":"Amazon Customer","rating":5,"content":"This is a solid unit with good sound and surprisingly crisp bass. I had a problem and customer service went above and beyond to make it right","timestamp":"Reviewed in the United States July 23, 2024","profile_id":"AEPHDJYWZ7C5I3OROD3EOU2LTHDA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RT179HSU7O04H","title":"5.0 out of 5 stars Competition to more expensive brands","author":"Basilisk","rating":5,"content":"I was actually looking to buying similarly sized JBL speaker in my local shop.Luckily, done my research before doing that.JBL - no aux, very basic BT format SBC, rudimentary app, well extended and slightly uneven FR, sounds ok in person besides weird grain somewhere in highs, around 10Hz better bass extension. Price is 3X.Motion Plus - AptX HD and low latency mode, aux in, which I use a lot, can be connected to both my and my gf phones at the same time, 9 band EQ, a bit smaller than JBL, fits my hand well, wide sound dispersion, ok and easy to EQ stock sound and all that while being 70-80 bucks. No brainer.Sound.Sine sweeps by ear subjectively correlate with dips and peaks in RTings measurement from 400Hz and up.Some of FR unevenness can be addressed by EQ in Anker's app, though 4-6 band parametric EQ will solve all the major issues.EQ preset on my screenshot is made on the base of BassUP preset to make the stock FR closer to flat.Removes shouty peak at around 3KHz, zingy peak at approx. 5KHz, fills in some lower treble and air.Values in Db differ from what may appear reasonable by RTings graph - they're adjusted accordingly to my subjective perception during sine sweep runs (for instance, I pushed 2.5KHz down lower, then it \"supposed\" to be accordingly to graph).You can easily adjust value in Db to flatten FR accordingly to RTings graph.Stereo mode.It exists, it works and it is very easy to setup, which is awesome. I wasn't testing it thoroughly, but in my case there is a delay in starting the playback, so first couple of seconds of song are omitted.Since stock frequency response is still very decent, app is great and price is low, motion plus makes a great gift. Just bought third ).Great job, Soundcore!","timestamp":"Reviewed in the United States December 25, 2023","profile_id":"AEZ5UAGEHBGVY37VQCXNK2CWZR4Q","is_verified":true,"helpful_count":13,"product_attributes":"Color: Black"},{"id":"R2IIVN3WSFIFI","title":"5.0 out of 5 stars Wow! Soundcore Motion+ vs JBL","author":"Tammy W.","rating":5,"content":"I have to say, as far as bluetooth speakers go, I've always been a big JBL fan. I've had a JBL Xtreme, Flip 3, Flip 4, Clip 2 and Clip 3. Recently my Flip 4 battery began to die so I started researching replacements. My natural inclination was to get a Flip 5, which I did order from Amazon and eventually used for a comparison with the Motion+. I watched a bunch of You Tube video comparisons each proclaiming how good the Motion+ is. I also read a ton of comments on Amazon so I decided to order it. This thing is unbelievable for a $100 speaker! I have to say I was a bit skeptical, but it really lives up to all the positive ratings and comments. Based on the sound comparison with a Flip 5 (which may or may not really be fair), it blew the Flip 5 away. Probably a JBL Charge 4 or 5 would be a more fair comparison, but I don't have one so I can only speak to what I could actually compare. What I noticed: 1) Clarity - incredible clarity even at high volumes. At around 75-80%, JBL began to lose some clarity. Motion+ was still clear as a bell. 2) Stereo! JBL doesn't to my knowledge have any true stereo speakers. Motion+ actually plays in stereo (yea!) 3) Amazing bass for its size. It's not going to give you the same level of bass as, say, a Bose S1 Pro (which I also have), but you can't expect that it will. However, for its size, the bass is punchy, deep and clear. Make sure to use the bass boost function. 4) There's an equalizer app available for Android or iPhone. What a nice feature! 5) Other nice features: IPX7 water resistant and rugged shell - just like JBL. If you're looking for new speaker or even your first one - definitely at least give the Motion+ a try.UPDATE: I recently got my hands on a Bose Soundlink Color II and did a sound comparison. The Motion+ blew the Bose out of the water. I'm always tempted to try something new and see if it beats the Motion+, but so far nothing near this price can compare.Another comparison: I tried the Motion+ against the new Bose Soundlink Flex. While the actual sound of the Bose was superior and had some nice punchy bass, the Motion+ was louder and still held its own to the Bose. Morion+ wins it for outdoor use for sheer volume. I do think the Bose Flex wins for sound clarity and smoothness and would probably be better for indoor use.Update 7/23/2024: I just ordered another Soundcore Motion+ to pair two of them together. I'm very disappointed that you cannot pair on older version Motion+ with the new version. Soundcore: please fix this! In the meantime, I'm sending the new one back. My old one is still going strong after 3 years!","timestamp":"Reviewed in the United States April 20, 2021","profile_id":"AH6EWYO4Q4Y5DBPVIUT2NWNQZKOQ","is_verified":true,"helpful_count":9,"product_attributes":"Color: Black"},{"id":"R1BAKE32Y27O72","title":"5.0 out of 5 stars Honestly, the best Bluetooth speaker for the money, bar-none.","author":"Jason Boden","rating":5,"content":"Title says it all. I've used cheaper, more expensive, and this is the best all-around for my purposes. Great sound, tight, punchy bass that isn't overwhelming, and clear/articulate highs with mids that offer clarity but not any of that wooly quality you can sometimes get. My favorite Bluetooth speaker.","timestamp":"Reviewed in the United States July 5, 2024","profile_id":"AEWGCKKLCGXQR7Z43TACPG7VVJ7Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R36KTVX5KXGTOK","title":"5.0 out of 5 stars Great sound for the price, but not the most portable speaker","author":"Zachary G. Robbins","rating":5,"content":"I have been using the Anker Soundcore 2 for years. While that is perfectly acceptable for listening to podcasts indoors, the sound quality is lacking for music. And it's not loud enough to use outdoors without significant distortion. In the last year I've shifted back towards more music listening, and needed a speaker upgrade. There are a ton of options, and you could spend a lot more money if you wanted the absolute best sound quality. The reviews for the Soundcore Motion+ were generally good to very good, so I took a chance because I've had a great track record with Anker products. The other options I considered were the JBL Flip 6, JBL Charge 5, Ultimate Ears Boom 3, and Bose SoundLink Flex. I'm listing these for reference to the price range, quality, and size I was looking at before purchasing the Soundcore Motion+.Pros:-Overall excellent sound quality. I have never been one to buy the best quality speakers, but this sounds significantly better than the small speakers I've gathered over the years and probably better than my Subaru Crosstrek Sport 2021. It is not as good as my old school Aiwa and Sharp 3-piece stereo boomboxes, but it's pretty close. For reference I mostly listen to metal and rap, and I judge sound quality on how my favorite metal bands sound on different speakers.-The form factor is rock solid and sits flat. It's going to be more stable than other options that are more cylindrical and especially the speakers that sit upright.-Directional speakers over the wraparound style. I want a speaker that directs sound towards me and doesn't fill the room, especially at work.-Battery life is excellent. It is listed as 12 hours but I think it's quite a bit more. Technology websites have tested it being closer to 16 hours.-USB-C charging and Aux ports. These days it's hard to find Aux ports on speakers. If you have an old iPod like me then it's nice to have that Aux option.Cons:-Heavy and bulky compared to other options in this price range. I have no problem grabbing the Soundcore 2 to move it around the house or between labs and offices at work, but the weight of this makes me think twice about casually grabbing it.-Charging is slow, longer than I'm used to with the Soundcore 2 and other small electronic devices.-Minor quibble, I wish all of the buttons are a little bigger.","timestamp":"Reviewed in the United States January 19, 2023","profile_id":"AEWIZKAI3H4NTZISXLY4U3HUFH4A","is_verified":true,"helpful_count":11,"product_attributes":"Color: Red"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:26","page":5,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=5","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=6","asin":"B07P39MLKH","page":6,"pages":731,"reviews":[{"id":"R1AV6HPFYUUKL","title":"5.0 out of 5 stars A lot of bang for your buck","author":"Greg Knapp","rating":5,"content":"I upgraded from a different brand that I had bought 3 years ago and wow, the technology of this speaker blows the old one out of the water. Very clear high notes, great middle and strong bass. In this price range, this is a must buy.","timestamp":"Reviewed in the United States July 4, 2024","profile_id":"AGF7LTOX2S5PGF6IQVQIGLRYCWLA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1TDNL0MLH7I97","title":"4.0 out of 5 stars Great speaker for small spaces","author":"R. J. Reding","rating":4,"content":"My nearly 20 year old Bose Sounddock finally died and I was looking for replacement with good sound and small size. The Anker Soundcore Motion Plus has been a great replacement. I believe the sound is equal to my old Bose. I had purchased a small Soundcore 2 several years ago for use on my patio and travel and was very impressed with the sound. This Soundcore Motion Plus has an even more solid bass and clear treble and is a perfect size for our small living room. The bass boost is solid and with 30W of power should fill most spaces with thundering volume. Two devices can be linked for a true stereo effect, but for a small room the sound experience with a single unit is excellent The device is water and splash resistant for outdoor use, but gives piece of mind for use in my living room where spills from cats and grandkids are possible or if I wanted to take it to the kitchen. It would also be perfect for use at your cabin or on your deck or patio. The exterior does have a rubber like coating, but comes in several colors that look fine for your indoor spaces.There are a couple of small issues. Because it is battery powered you will have to physically turn it on to use it. Battery life is quite long, but It will turn off automatically when not in use with an auto shut off feature that can be adjusted via a phone or tablet app. It would have been ideal to have it turn on via the phone app or through an Alexa voice app. The manual that ships with the device is useless pictograms. Fortunately I was able to find a written owners manual online and one is available with the phone app. The equalizer on the phone app only allows you to turn the bass boost on or off. It would have been nice to have actual equalizer controls over a range of frequencies or preset equalizations for music or room type. However both my Android phone and an Alexa app have equalizer features. Aside from the pictogram quick guide set up was easy and the Bluetooth sync was without problems for both my phone and Alexa. The app also allows for firmware updates, but also includes push notifications. The device also supports the latest Bluetooth codex, though your connected devices may not offer that higher standard e.g. generation 1 and 2 Alexa devices. The speaker can however be directly connected with aux line in with an included cable.Overall the Anker Soundcore Motion Plus was exactly what I was looking for and at the price I wanted to pay. Given my good experience with my Anker Soundcore 2 speaker I would expect this product to be equally trouble free.","timestamp":"Reviewed in the United States January 21, 2022","profile_id":"AF6SON7PE54ISGTP7IWKTUBIFLXQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RORHGT3HDYR2L","title":"5.0 out of 5 stars Very full sound","author":"Amazon Customer","rating":5,"content":"The only thing I dont like about it is I left it somewhere and lost it.So buying another, very specially for the price.","timestamp":"Reviewed in the United States July 11, 2024","profile_id":"AHF7NXHIYVXHHZ3ZUKC77QZGPAAA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1KRHYHVVLP4UE","title":"5.0 out of 5 stars practical bluetooth speaker","author":"Milo Archreach","rating":5,"content":"I bought this particular brand/model at the recommendation of a friend for use in my classroom (after having borrowed his one too many times). All students can hear it perfectly well in every corner of my teaching space, and no one is \"blasted out of the room\" when used at high volume. Overall loudness is probably not great for parties, but it's just right for our needs. I do have to check it for a charge each time I want to use it, but I have developed that habit.","timestamp":"Reviewed in the United States June 14, 2024","profile_id":"AHH5IK24SSGTJIT6536C33XKGK6A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R18JAB13X3ADUW","title":"4.0 out of 5 stars Sounds great battery life not as advertised","author":"Chris Myers","rating":4,"content":"Speaker sounds great battery life not so hot I can't make it through a 8hrs before it needs charged","timestamp":"Reviewed in the United States June 25, 2024","profile_id":"AHUNLSV34FKP5WBRISIW3H7RYLYA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2864PEOL7QH3J","title":"5.0 out of 5 stars Another great Anker product","author":"Chris","rating":5,"content":"This speaker sounds great and really fills a room. The bass is deep and punchy, a lot more than you'd expect from the size. Sounds especially good when you play lossless or high-rez audio, and it even supports spatial audio. You can crank it up and there's no distortion even on max volume. Feels sturdy and well built. At this price I was skeptical, but this blows the more expensive JBL Charge 5 and Bose SoundLink Flex out of the water.","timestamp":"Reviewed in the United States June 16, 2024","profile_id":"AHTJISWN7S33SGOYFFQZ6M7ODUNQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RAICGDW2EA330","title":"5.0 out of 5 stars I believe this purchase to be a great one. Very satisfied!","author":"DCV","rating":5,"content":"Pro:1. Easy set up with iPhone (1 min)2. Deep rich sound3. I love the soundcore app with various eq options to appease your personal tastes (also easy set up)4. Built very solid love the rubberized material choice on top and bottom (easy grip)5. Apparently Anker offers customer support 24/7*did a ton of research before deciding on the motion+ and I feel I made a great choiceCons1. As of right now, I don’t have anything negative to add.*I am admittedly and audiophile- very particular about equipment and sound*I will update my review in a month to let you know how it’s going***UPDATE***05.26.21I HIGHLY recommend getting the free Soundcore App for adjusting the EQ, as it makes a huge difference. The speaker is very responsive and much improved with the App / EQ. If you aren’t savvy with the EQ, there are a few “sound maniacs” on YouTube that can walk you through how they have it set up and they are great!I really have enjoyed this speaker. I did a blind sound comparison between my new Apple HomePod and my Soundcore Motion+…with my wife, a couple of buddies, and myself. They both excell at different things- (highs, mids, lows)…but the overall SQ between the Motion+ and HomePod was pretty much a toss up. Also convenience wise, the Motion+ beats the Apple on several fronts (and I have an iPhone LOL). Keep in mind the the HomePod is $300 and the Motion+ is $100. Im liking the Motion+ so much that I ordered another one and paired them together. I tried to do this on my own but couldn’t quite figure it out. I called customer service and a rep answered my call right away, was very professional and walked me through it. As much as I enjoyed the 1 speaker, having 2 of them synced together sounds VERY VERY VERY nice! I enjoy this set up so much that I decided to return my Apple HomePod. I have nothing negative to say about this Soundcore Motion Plus! Get it, get the app, and if you have $200 to buy 2 of them…DO IT. You’ll be quite blown away with the SQ for $200. If you don’t have the cash for two, one Motion+ is plenty good for most people. Again, I’m a bit of one of those “sound maniacs” or audiophiles. I’ll just throw one more thing in- the build quality on these guys are SOLID! I’m a very happy customer. 👍🏻 I buy a lot of shizzle on Amazon. This speaker and my awesome Leaf Blower (has nothing to do with Anker Soundcore) are the best things I’ve purchased on Amazon EVER!!!Regards","timestamp":"Reviewed in the United States May 3, 2021","profile_id":"AEHNZJ7ICUG45AJDIVWQJKFAZUYA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1A2FSU8UK9HYN","title":"4.0 out of 5 stars Solid for a long while, now battery is toast","author":"RJ","rating":4,"content":"I purchased this in April 2022. It's now October 2023. This used to be my daily driver for all-things-home-audio at home until I purchased the SoundCore Motion x600 in May 2023. I love that. Once I got stuck on that, this kind of got stuck on a shelf. Back then, the battery life was acceptable, but I don't think it was ever near 12hours like advertised. Maybe half that, maybe a bit less. Not a biggie. However, in my attempts to have one bluetooth device for each PC / phone that played audio to avoid the struggles of trying to determine which device was taking over which bluetooth device, I started using this again.Battery life now is about non-existent. I don't have exact figures, but I expect it's easily within an hour it dies if not plugged in when in use. I basically have to leave it plugged in, which works for its use case, but not ideal. I have a lot of Anker products in my shopping history here going back almost 10 years. A large number of those products are in use today still. Possibly I got a dud here. It's a solid bluetooth speaker, and while I'd usually go with Anker over other brands in a number of categories, certainly against others in the same price range, I'm not sure I'd get this particular speaker again, as good as it sounds.","timestamp":"Reviewed in the United States October 22, 2023","profile_id":"AFRFJ3MRUMG3NAYTSCTHSIBBI75Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R321LM3M3OT3WY","title":"5.0 out of 5 stars I returned my equivalent Bose speakers for these and never looked back","author":"Kalel-510","rating":5,"content":"Sound quality and volume are excellent in these portable, wireless, Bluetooth-connected Anker speakers. Very little distortion at higher levels. I had a few connectivity issues until I got the hang of it, but everything is jake now.I had a pair of the equivalent ($99) Bose wireless portable speakers and returned them for these.Anker vs. Bose comparison:* Sound is superior in Anker speaker. Bose does offer the choice of mono or stereo sound.* App needed to pair Bose speakers. No app needed to pair Anker speakers.* Once Anker speakers are paired, they stay paired when you turn the speakers on again. No need to re-pair as with Bose.* Anker has an equalizer function to customize music. Stays at the setting when turned on again.* When the Anker speakers are paired, when you turn one off the other shuts off as well. Bose speakers must be shut off individually.* When music is paused, the Anker speakers stayed powered up for much longer than the Bose speakers, roughly 20 vs. 5 minutes. With the Bose I always felt that if I left the room for a couple of minutes, I had to open the app again and re-pair the speakers.One item to note--when I first got the Anker speakers some songs started half a second into the song intro, a semi-annoying problem I once had with a pair of earbuds. However, that issue seems to have resolved itself.The sound between the Anker speakers will \"drift\" from time to time. That is, sound will fade in one of the speakers and increase in the other for a second or two before equalizing again. Happens occasionally and is not annoying enough to put me off the speakers.I would have preferred a vertical rather than a horizontal orientation, but the Anker speakers are very solid and portable. I love to move them around the room so that no matter where I am, I am perfectly between the two speakers.There's something about the speakers that make the music very comfortable, almost soothing, to the ears. I I never want to turn them off.I had a pair of the equivalent Bose speakers and returned them for these. A friend of mine did the exact opposite, but that's because she wanted the mono sound option in the Bose. Some people think it's better for parties because no matter where you are in relation to the speaker, you can hear all the instruments in the song.I am very happy to give these Anker speakers two enthusiastic thumbs up.","timestamp":"Reviewed in the United States September 17, 2021","profile_id":"AGDE2OJXVZ4B2UV6ZYUH5JKLVCJQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R29GO5GDCXQAHN","title":"5.0 out of 5 stars Phenomenal Sound for the price","author":"Ajani Grant","rating":5,"content":"After some faithful years my JBL Charge 3 has fizzeled out. Resorting to being on the charger to work. Reddit actually led me to find this speaker.Pros:Budget. As it was on Sale for $85 versus a charge 5 at roughly ~160, and everything else far above thatSound( with tweaking). The audio out this thing is amazing. Not life changing. Not ridiculous. But as someone who primarily listens to hip-hop, jazz, and r&b, this speaker in it's 6-8 hours of usage already has blown me away. It gets loud. It has crisp bass, decent mids, and pretty clear highs. For the price range this is what I've come to expect and it has matched expectationsPairing. By holding Bluetooth you can pair two of these speakers together and this naturally offers double the amazing sound and you can truly fill a bedroom with music. I'd compare the experience to having a massive soundbar (like an entire walls length) with a mini subwoofer. It's actually an incredibly immersive experience. And once again, the price of this thing means buying two might not hurt your bank terriblyVolume. Even with a singular speaker I can easily fill my bedroom with more than enough sound. In a masterbedroom, half the room is drowned with music and the other is conversation level.Cons:Battery. The battery at 75-100% volume will die at roughly 4-6 hours. I've had two sessions on one battery session right out the box before resorting to charge. That's not terrible to be honest but worth mentioning as a conMax Volume Sound. You are going to sacrifice some quality of sound as you increase volume pass 75-80%. I don't notice distortions, but the bass actually gets outpowered by mids and highs which slap out, for lack of better terms. I do find this problem remedied with pairing two speakers and having them on opposite ends of the roomOverall:I look forward to seeing how long this speaker lasts me. First impressions are strong. I am happy for now. The battery is a minor con for the overall quality of the products sound. Make sure to download the Soundcore application and check reviews for your personal custom tweaking. This is completely unpaid just decided to write because Anker has never disappointed in my household.Easy 8-9/10 product. If it lasts the years this should easily be your go to 10/10 portable Bluetooth speaker. But only time will tell that for now.","timestamp":"Reviewed in the United States November 27, 2021","profile_id":"AE455FCT47AV6I4ROJ354GCUZOHA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:27","page":6,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=6","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=7","asin":"B07P39MLKH","page":7,"pages":731,"reviews":[{"id":"R3I3FJYPNV3J1Z","title":"5.0 out of 5 stars Great overall value. Loved it so much I added another!","author":"Bryan A","rating":5,"content":"I've owned a number of Bluetooth speakers in my life and my complaint is usually the same on anything that doesn't include a high price tag. Most are muffled, lack clarity, and are particularly bad on the low end. I've read the countless reviews on the Soundcore Motion+ and finally decided to try it out. I'm very glad I did as it's by far the best smaller Bluetooth speaker for the price or less that myself or friends have enjoyed.Pros:-Sound quality is very good for what I listen to and I listen to a lot of genres of music, movies/shows, and racing.- I love the size and weight of it. It's built very well. (It might be a bit too large/heavy if you like small ultra light weight speakers)- Bluetooth connectivity has been excellent, the app works great, I really like the stock EQ settings as well as the custom EQ.- Value compared to the well known name brands is exceptional.- I love the rubber on the top and bottom of the speaker. On slippery surfaces it grips well and on the top it's a nice soft touch. The top does show fingerprints, but those are really easy to clean off. I prefer that to just plastic or cloth by far.- I've not had it out in the direct rain, but I've had it out in very high humidity conditions and have spilled water on it and it didn't affect it at all. It just made it easier to clean.- The 15 degree angle of the speaker is awesome if you're sitting down or standing up. It definitely makes a difference if you have it lower than ear level listening.Cons:-I wish it had a mute button-I wish it had a battery life indicatorNeither con is enough to deduct a star from it though. You can obviously mute it from your device or see the battery life in the app, but when I'm full screen watching something live it would be nice to easily see battery life or mute on the device itself, especially when I have it hooked up to my mini PC. On a phone or tablet that is in your hand or right next to you then it's not a big deal at all.Overall this speaker is flat out awesome. I'm very happy with my purchases and I look forward to seeing what Soundcore can come out with in the future. A larger version of this with some more low end bass would be the best of all worlds in my opinion! I just wish I wouldn't have overlooked it for so long, because it wasn't a big name speaker brand. At this price and above it's the real deal!","timestamp":"Reviewed in the United States April 12, 2021","profile_id":"AEY5Y4O7TLRCCHI2DHNE6YTJXBLA","is_verified":true,"helpful_count":7,"product_attributes":"Color: Black"},{"id":"R1XARHZH2G2SE6","title":"5.0 out of 5 stars AMAZING for electronic music","author":"Kyle Archer","rating":5,"content":"A disclaimer: I use this speaker with Android and use only FLAC audio files which means I'm taking full advantage of the AptX Bluetooth codec. If your phone doesn't support AptX (like an iPhone) I wouldn't recommend the Motion +. Find something that supports AAC instead.Ok, so I'll be honest. I don't care for this speaker for rock music. That's my big criticism. The rock I listen to is heavily layered and drenched in distortion and reverb. Think \"wall of guitars\" style. In other words the sound is huge and occupies the whole spectrum as a sort of singular mass of sound. My Galaxy Buds + handle this perfectly but The Motion + seems to have a hard time and the sound is unbalanced, like the speaker is trying to emphasize a certain frequency that doesn't make sense for this music. Random frequencies of guitar distortion are elevated and it sounds really off, even after playing with the EQ setting.However for anything electronic I've found this speaker sounds absolutely stunning and it seems to me that's what the Motion + is geared for. The clarity is unreal, especially for a Bluetooth connection. I listen to everything from heavy bass EDM to rich, ethereal ambient music. With the bass heavy EQ there is a massive bass presence but it remains a refined, tight sound instead of a muddy boom like many other Bluetooth speakers. The mids retain clarity and punch despite the bass and the treble is clear as glass. All in all the sound is incredibly high quality and perfectly balanced but again, just for electronic music in my experience. This doesn't bother me too much because this is primarily what I listen to but many people aren't into electronic so I thought I'd state this for fans of rock and metal. Another thing to mention is the overall presence of the music. I can flip this speaker around to face the wall and it still somehow fills the room with crystal clear sound. The battery life is very long, charging happens pretty quick, and the aethetic of this speaker is just as appealing as everything else.To recap: If you're an Android user and you love electronic music just buy this thing. You'll be blown away. For everyone else though I'd say there are much better options out there.","timestamp":"Reviewed in the United States May 14, 2022","profile_id":"AF33Y2RIQHKDYOUV2QAUIFIZZYTA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R31ZMRWYQKIQ64","title":"5.0 out of 5 stars Loud and Clear","author":"Mark","rating":5,"content":"My old 12 watt Anker Soundcore was too quiet for some audio books. I drive endless hours over the highways delivering your food to distribution centers. Headsets are seen by the DOT at the pre-clearance sites with those big cameras looking right inside the cab of the truck. Also even the bone induction headsets cause an achy soreness after a few hours so a Bluetooth speaker is essential for listening when the truck radio's Bluetooth auxiliary is bad. This new 30 watt Soundcore+ is plenty loud even when climbing up a 6% grade with 40,000 pounds cargo and the huge engine is screaming and the giant fan is blasting like a turboprop at takeoff. I mistakenly bought an Oontz unit with 24 watts and it does not connect easily nor provide adequate clarity or volume, the Anker Soundcore connects effortlessly. Easy automatic reconnect even after my audio book is interrupted by a phone call. I've left the speaker on all night while I sleep and there's plenty of juice left for NPR news with coffee at 4 AM without plugging in the USB. I really truly benefited from the \"table\" of products I found on Amazon for the Anker Soundcore speakers. With that I found the perfect unit for my truck. My old 12 watt unit lasted about 4 years blasting it's little heart out for me before it ruptured a diaphragm. I was so sad it blew up so when I found the table of Anker Soundcore speakers I grabbed-up my 30 watt unit because I trust the brand. I couldn't be happier with it. You might think that speech in an audio book would not need quality sound, but the high-res digital audio reproduces excellent clarity at any volume I need. Quality sound is important for audio books so you catch every nuance and inflection of the voice actor. I bought it specially for the truck and I just love it's audio quality, substantial physical weight and higher volume capacity, battery life is over the top, and I know it will withstand the high vibration and moisture environment and keep blasting away because it's little brother did. I will probably replace my big screen TV at home just so I can get a mega-blaster that rattles the deck plates from Soundcore !","timestamp":"Reviewed in the United States May 8, 2022","profile_id":"AGHVEHQZT44AEEQ4PVHQV6LYOY3Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3HKYV5DWFVH6P","title":"5.0 out of 5 stars Incredible value!","author":"da_musicman","rating":5,"content":"I own an original Bose Soundlink, a Bose Soundlink Mini 2 Special Edition and the Soundcore Motion+. The Motion+ is far and away the best value of the three. It’s midrange beat the pants off both Bose speakers. Without side by side comparison, I think most people would be happy with a any of these speakers but when compared side to side, my preference is definitely for the Motion+. It's the only one with a remote that has a graphic equalizer. That’s huge! The ability to fine tune the sound to your individual hearing gives it a gigantic edge. It sounds clean and full with decent bass (not overly exaggerated) and excellent midrange and highs. It has good build quality and is also waterproof. It can also be paired to a second Motion+ for a wider stereo soundstage. (The new Bose models also have this capability. There is a microphone for using it as a Bluetooth speaker phone if that floats your boat. It has a battery life rated at 12 hours though I haven’t had it long enough to deplete the initial charge. The Soundlink Mini 2 has a similar battery rating and I have to say is an engineering marvel. Though not perfect, the sounds that comes out of that tiny thing is nothing less than amazing. I think the original Bose Soundlink has the best soundstage of the three, followed by the Mini. The soundstage on the Motion+ is decent but not quite as good as its competitors. However, I think the overall sound quality of the Motion+ across the frequency spectrum is definitely the best. Highs (electric guitar) on the Mini can be somewhat strident and sounds much more smooth and natural on the Soundcore Motion+. The Soundcore just seems to have a much fuller sound with nothing or very little missing. (Keep in mind that these are all small portable Bluetooth speakers not high end studio monitors driven by great amplifiers so they all have limitations!) When switching to the Soundlink Mini 2, it sounds like something is missing. Oh, did I mention that the price of the Soundcore is only 100 bucks?! The Soundlink Mini 2 Special Edition is $150 at Costco. That’s 50% more and doesn’t sound as good to me. The original Soundlink sold for $300 if my memory serves me correctly. If size is a driving factor, then the Bose Mini 2 is worth exploring. However, if you can put up with a little larger but still relatively small speaker, in my opinion you will not find a better sounding speaker than the Soundcore Motion+ in the $100-$200 price range. It’s a solid buy. Anker did a great job with this speaker.","timestamp":"Reviewed in the United States March 11, 2021","profile_id":"AG7CABQBZF37LILPWYLUJ2OA5OEQ","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RRGX14M3T4XYQ","title":"5.0 out of 5 stars Impressive sound, Bluetooth is weird","author":"Aaron Reitz","rating":5,"content":"I got this to make computer audio audible when playing videos outside with my small group. For the price, the sound is pretty impressive, with decent bass and no obvious peaks. I think the output is mono, even though the speaker contains two drivers -- not a big deal on a small speaker meant to be listened to from a distance. It feels very solid and heavy in the hand and the body has a soft-touch coating on the plastic, giving a nice feel. (Note, though, that I've seen these coatings degrade into a gooey mess on other products, though I haven't had any issues so far on the Motion+.)My main gripe is with the way the speaker handles audio connectivity.First, when using it with a computer, I generally want to use the wired connection for audio rather than Bluetooth. However, the Motion+ defaults to trying to connect via Bluetooth every time you start it up, and sometimes it is difficult to figure out how to make it fall back to the wired connection. There is something flakey about its detection that the audio cable is plugged in.Second, I don't know if this is a problem with the Motion+ or with Bluetooth in general, but I've seen some weird behavior when multiple devices have been configured to connect with the speaker. Sometimes I'd have it connected with a computer one foot away by Bluetooth when suddenly the audio would cut out and I'd start hearing some other audio playing. It turns out that the speaker was switching to playing from my mother-in-law's iPad, that must have been 20-30 feet away at the time. It is maddening to me that another device could just cut in on an existing Bluetooth connection like this. It seems like a major security flaw. Strangely, I've also seen my phone try to play audio to the speaker even when I am miles away at the time, as if the phone can't tell that the speaker isn't present. Due to these issues, sometimes I have to just tell my devices to forget the speaker. It's really frustrating.Still, I don't run into these issues often enough to make the speaker unusable, and maybe I need to apply a firmware update or something. I'd still recommend the product for it's high-quality audio for the price.","timestamp":"Reviewed in the United States February 10, 2022","profile_id":"AGW5PEVKSAHGE34IPTUWCPWNDZJQ","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R2ODBY2ZJQ8B9T","title":"5.0 out of 5 stars Incredible sounding speaker","author":"Dave","rating":5,"content":"I bought this speaker primarily to use outdoors on my deck and patio areas. I researched reviews for bluetooth speakers under $100 from several reliable audio and tech websites; then watched YouTube demos. I narrowed my choices to Anker, Tribit, JBL and Oontz. I chose the Anker Soundcore Motion + for it's driver configuration (full range drivers with separate tweeters, passive radiator and bass port), 30-watt power and size. The ability to customize the sound with the Soundcore app was also a deciding factor.When I received the speaker, I was pleased with the build quality. Initial set-up was a snap, took less than a minute. I downloaded the Soundcore app and reviewed it's features and available options.Now, for the audition. Let me preface by saying, I am a guitar player. I listen to real music, played by real musicians, playing real instruments. I do NOT listen to computer-generated, sampled, auto-tuned disposable crap (no offense to those that do; everyone should listen to what they dig). I began with Fleetwood Mac's self-titled album from 1975 in ultra-HD on Amazon music. It's impeccably produced and has a great drum mix (a true test for any speaker) I scrolled through the pre-sets on the Soundcore app for the first track and dialed in my custom EQ on the available equalizer. I turned up the volume and stood back about 12 feet from the speaker. My jaw dropped. I could not believe the sound coming from this portable little speaker. Great full-range audio from lows to highs. Mick's drum were punchy and deep. Much better bass response than I anticipated (though I did need to dial it in with the EQ). Wonderful separation of instruments, crystal-clear vocals. The soundstage was surprisingly wide with good depth for a single speaker configuration (non stereo setup). I was impressed (and I am not easily). I mainly listen to vinyl or CD on vintage, audiophile quality equipment (I also stream in ultra HD with a quality DAC). The Soundcore Motion + far exceeded my expectations.Are there bluetooth speakers out there that are better, or louder or have more bass? Yes, of course. But not for $80. You will not be disappointed.","timestamp":"Reviewed in the United States August 3, 2022","profile_id":"AGC3R2DUZQRWRCKO2HHQHR5HFLKQ","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R3EY0GU1HKU7UT","title":"5.0 out of 5 stars This Soundcore Motion Plus is awesome!","author":"The Badger","rating":5,"content":"The bass on this mighty little beast is amazing!! Definitely the best portable speaker I’ve ever had! Anker has always been my go to for charging cables and charger cubes now adding speakers to that list.","timestamp":"Reviewed in the United States June 21, 2024","profile_id":"AGUSGTNUBMHKOPBSJ552U66PUGAQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1OF459KAAYVO8","title":"3.0 out of 5 stars Awesome speaker; appallingly short Bluetooth range.","author":"No","rating":3,"content":"I’ve had this speaker for a little over a year now. In almost all respects, I have been very impressed. Unfortunately, the Bluetooth range (or lack thereof) is a serious flaw.The good:The sound quality is amazing for such a small speaker. I never would have expected such a rich bass from a speaker this size.The Soundcore app allows me to customize the EQ for my tastes. This allows me get the most out of the small speaker without washing out the overall sound with pure volume.Charging, portability, and durability are all right where they should be. Again, very impressed by the quality.The bad:The Bluetooth range is appallingly limited. I have connected the speaker to multiple iPhones. Most of my Bluetooth devices can maintain a solid connection well over 20 yards, especially if the devices are within line-of-sight. This speaker, however, will start to drop a Bluetooth connection in less than 5 yards, even without obstacles in the way.It is a serious flaw. There is no point in having a Bluetooth connection if the phone needs to be that close to the speaker. I might as well buy a 3.5mm cable and just hardwire the connection.If you want to use the speaker during a backyard cookout, that’s fine. But you’ll have to leave your phone sitting right next to the speaker instead of in your pocket as you walk around.Again, it’s a great speaker, but the short Bluetooth range is a serious flaw.____UPDATE after another 6 months:*When connected to the charger, it may not be able to draw enough power to function at higher volumes. I used it at a party recently, and I had to keep the volume at maximum (or close to it). The battery died after about 3 hours; no surprise there. I hooked up the charging cable and turned it back on. Every 10 to 15 minutes it would die again. I'm assuming that, at full volume, it uses more power than it can draw through the charging cable. This is very disappointing. This is the only time I have used it on max volume for extended times and the only time I have used it hardwired to the charger. But it should be able to draw power consistently enough to function.For what it's worth, even at the high volumes the sound quality was still impressive. The bass was a little lacking, but it's still impressive.*The bluetooth range is still appalling. It's also inconsistent. I actually got it to connect at around 20 yards the other day. But it would randomly crackle out or drop the connection. Again, I eventually just placed my phone right next to the speaker.","timestamp":"Reviewed in the United States August 15, 2023","profile_id":"AFYI4JVG2NYFLOBVED2TLERIPIAA","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"RGV7Y77KCH4HF","title":"4.0 out of 5 stars Physics cannot be cheated; the hype is unfounded","author":"Frank Doghearty","rating":4,"content":"(08/10/2020) After several months of satisfactory performance, I am raising my rating from 3 to 4.(Original review:) In order to be fair, I used the wired connection for this review. (The speakerphone feature works well, which alone is making this a keeper for me.)The tiny drivers simply cannot produce anything close to a pair of 30-year-old Sony amplified speakers with 3\" drivers. In fact, the sound resembles the tiny USB speakers that came out 15-20 years ago, possibly because that's where its sound comes from: tiny speakers. Of course, for the price, you do get some privileges: namely, bass-reflex design and silk domes, both of which far surpassing the potentials of cheap, tiny computer speakers.Some reviewers did note that using the app would give away \"your voice\" for free, so that is obviously not an option for those who care for that sort of thing. Without the utility that enables various equalizer settings (out of which the basic setting should have been built in to begin with), the device falls flat, exhibiting all the shortcomings that its tiny drivers entail (the uncompressed sound coming from an iPad 3, using music and movies from Amazon Prime). Severely colored sound, bad to the point that even mp3 sound just as \"good\" (or shall I say, bad) as uncompressed sound. Some people compared the sound to a DOSS Soundbox SL, but the latter actually reflects the difference between mp3 and uncompressed sound to the point that mp3 comes through severely distorted, because that's just the way mp3 sounds like. Of course, that makes this unit a winner for listening to mp3. For the Soundbox SL, that's a punishment for producing untainted sound (of course, there are better speakers out there, but they also cost more; I got my SL for $56 at the manufacturer's site and got $30 off this one, which I still find a bit much for the actual performance, although I am sure that two of these would be much better than a single unit and these can be paired for stereo sound, as opposed to the current Soundbox SL).NOTICE that my DOS Soundbox stopped working properly after about 10 uses, but is out of warranty, and this one is working fine!The bells and whistles, silk domes for the treble and a passive membrane for the \"bass\" do contribute, although only the treble is fairly improved, because such tiny drivers simply cannot defeat physics. Realistically speaking, \"bass\" starts over 100Hz, and any tweaking simply upsets the sound image and the sound balance.The price is paid for1. Outstanding battery life2. Being somewhat waterproof (I would not venture to experiment with that, but splashproofness seems reasonably true)3. Sophisticated design with extra \"bass\" (that is not really bass)4. Silk domes5. The option to pair two of these for stereo sound6. Excellent BT performance7. There is some stereo imaging, if you are using this below a matchingly small screen.However, if you are looking for a steady sound image without loudness and detailed, dynamic sound, look elsewhere.","timestamp":"Reviewed in the United States December 24, 2019","profile_id":"AHXUNV656OFRHCTBGKYFCYS6UEHQ","is_verified":true,"helpful_count":13,"product_attributes":"Color: Black"},{"id":"RUFZOC308T6QK","title":"4.0 out of 5 stars Great sound & value.","author":"Joshua Williams","rating":4,"content":"I'd needed a speaker to replace my 6 year old Douni which had a weird farting sound when the bass hits above 27% volume. After thousands of hours of speaker reviews, I settled on this one.So far I'm not regretting the extra 20 watts I could have had from a Dockin D Fine + 2 as this gets pretty loud. In fact, I never felt the need to have this above 40% volume and this just sounds great.It was annoying at first since it randomly increased the volume during audio playback & when changing or restarting tracks but after unpairing from my devices and resetting the speaker, it seems to have solved the issue.I would have preferred physical buttons for previous and next track instead of the useless \"Bass up\" button since the feature can be enabled in the app. You'd need the app for firmware updates and sound customization and other settings, like auto off when not in use which you can set to your preferred time.The power button is a bit stiff and it's an arm workout to turn on this speaker. It also just dies abruptly without any sound notification when using the aux cable (not sure if its thw same with Bluetooth) and takes over 4 hours to fully recharge.You'd want to enable \"Bass up\" or Custom but with a flat profile because it sounds exactly like Bass up. Any other preset sounded terrible to my ears.","timestamp":"Reviewed in the United States August 17, 2023","profile_id":"AFQHHS4JJYBBBU4HRI2OM2LUUHRA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:28","page":7,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=7","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=8","asin":"B07P39MLKH","page":8,"pages":731,"reviews":[{"id":"RE3FKZQVCJGRW","title":"4.0 out of 5 stars Bueno pero no tan bueno!","author":"Juan Carlos","rating":4,"content":"Hola a todosEl día de hoy adquirí la bocina soundcore motion +, estaba realmente emocionado por las reviews tan positivas en cuanto a construcción y sonido, quizá me he vuelto un poco exigente en cuanto a sonido aunque no me considere un audiofilo pero si busque una calidad de sonido superior.Me habia emocionado mucho porque es una bocina Hi-Res y podra conectar mi dac que es un Fiio que no brilla por la presencia de bajos pero tiene un sonido bueno, la conectividad Bluetooth es muy buena, es muy fácil de ocupar al tan solo sacar de la caja. tiene buenos medios, los agudos son buenos también pero le falta bajo, estaba buscando un bajo surround parecido al de mi sony SRS X-3, que al conectarlo con un dac mejora muchísimo el audio, el caso del anker es muy positivo en un volumen alto, pero en un sonido bajo como en una habitación le falta potencia, en general si se utiliza con Bluetooth el sonido es muy bueno, depende el ecualizador del telefono, suena mejor al conectarlo con el jack 33.5. La función de bajo del parlante es buena pero con un dac no mejora mucho, la separación es muy buena aunque las unicas que son hi res son los tweeters, cosa que no mucho me gustó, me esperaba un poco mas de la bocina, pensaba que reproducir archivos hi res, con un dac y una bocina hi res seria buenísima mezcla para mis oidos, si lo fue pero no me termina de convencer, pienso que el Sony es mucho mejor!Si lo recomiendo? Si buscas algo que suene duro y en lineas generales bien, este es tu parlante. No tiene mucho bajo al menos no si lo reproduces con sonido suave.Si buscas una bocina hi res, ve a sony tienen muchas buenas pero no a este precio.Hi res a $100? No lo es tanto.Si es tu primera bocina, te sorprendera lo bueno que es.Si no quieres comprar una bocina tan cara y que tenga buen audio, te recomiendo esta por encima de bose, jbl por que? Porque en lineas generales esta bocina en especial suena muy bien! Con sonidos balanceados y claros en todas sus lineas!Actualización: si es una bocina hi res pero considero que el sonido podría ser mejor, es hifi pero no de la calidad que deseas","timestamp":"Reviewed in the United States October 26, 2021","profile_id":"AGONFG6544O2UYQMO4MUUAGMDKNQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R67N5TEBHAPTD","title":"4.0 out of 5 stars Worth its price","author":"GK","rating":4,"content":"It's a solid speaker with wonderful battery life. It's not a premium product so don't expect all the bells and whistles but the app is wonderful for customising the sound to your liking.","timestamp":"Reviewed in the United States May 8, 2024","profile_id":"AGH4LMCIEHBXQMSZK3H5UAJWXW2A","is_verified":true,"product_attributes":"Color: Black"},{"id":"R12GV6OMFVNVCQ","title":"5.0 out of 5 stars Great Upgrade!","author":"Stephen","rating":5,"content":"My use case: Needed a better speaker for my desktop computer at work so I could listen to music and do conference calls as I upgraded from laptop to a beefy desktop for some heavier development work I was doing that required multiple virtual machines and all the memory I could afford.For music, I'm not a trained ear, but it packs a lot of bass for a small device even at lower volumes and sounds great for the kind of music I listen to while developing (dubstep, lofi electronic music, classical, jazz, the rat pack, michael buble, r&b, rap). Seems to do well enough across the gamut but I like it best for lower volume bass heavy instrumental music that I listen to while doing other tasks.I've tried to use other bluetooth speakers I have that have aux ports for my PC (bose home speaker 300 in particular). In comparison: - This sounds as good or better to me, bose has a special warmth to it that this lacks but this seems more accurate and punches with just as much bass for a small speaker array. - This is portable/has a battery that the bose doesn't - The bose thinks I'm talking to alexa all the time and does weird things that this doesn't - The bose requires me to turn it back to \"Aux\" mode every time i sit down at my computer, not sure why - The bose doesn't have a mcirophone in it, this does and seems to work wellMinor complaints for my use case: - Super short cords USB-C and aux cords - going to have to fix that - The port cover on the side is a little annoying to have to leave open to get to the power/aux ports - It doesn't do bluetooth and aux sound at the same time while playing from your phone. This is more minor annoyance because some apps play silent sound constantly when they are in the foreground which mutes computer sound even though nothing is playing. More an issue with ios/those apps, but it's annoying when you get on a conference call and can't figure out why you can't hear people. You can have a phone connected that's not playing any sound and play the computer audio without issue though. This is workable.","timestamp":"Reviewed in the United States May 25, 2021","profile_id":"AFKRAKA427IIGNL7TTGEHL3K3XJA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R392COXJM9X256","title":"5.0 out of 5 stars Yes, I am ready","author":"Cameron","rating":5,"content":"I was deep in a slumber one frigid November night, icy winds howling all around me, the last embers fading in the fireplace, when a vision came to me: A figure with a powerful aura; with kind eyes and surrounded by treasure whose beauty cannot be expressed with words. I think it was maybe my friend David.Anyway, without opening his mouth, he spoke deep into my soul. A rumbling, almost tectonic voice:\"DO YOU FEEL COMPLETE?\"I could not speak, only a slight shake of my head once I understood that my answer was no.\"DO YOU FEEL THE VOID, THE MISSING PIECE OF THE PUZZLE?\"I nodded, more assertively this time, without hesitation.\"I CAN SHOW YOU THE WAY TO ENLIGHTENMENT, IF YOU ARE READY.\"This time I spoke. A raw, unfettered vocalisation from deep within me. I could see my words taking the form of light, twisting this way and that, on their journey toward the dark figure. \"Yes. I feel ready. Please make me whole, I am ready. I am ready.\"A pause which felt like a lifetime ended as the figure (still probably David) began taking in a huge breath. He took in more and more, as if preparing for a war cry. I could barely contain myself. I shook in my place, my gaze transfixed. I had totally surrendered to whatever might happen now. My soul was his.As soon as he started to speak, so began a sort of time-lapse of my whole life up to that point, like a flick book of all the important moments in my life. It brought me to tears. I wept joyous, rapturous tears as his voice, now even more seismic, finally told me what I'd been waiting so long to hear:\"SOUNDCORE MOTION+ WITH USB-C CHARGING, 6,700mAh BATTERY, 12-HOUR PLAYTIME, 40kHz SILK DOME TWEETERS WITH ACTIVE CROSSOVER, CUSTOMIZABLE EQ, BLUETOOTH 5.0, AND IPX7 WATERPROOFING\"I woke with a jolt, fresh tears in my eyes and adrenaline coursing through my body. My hands were sweaty but even so I reached for my phone and immediately searched the words from the dark figure.I ordered the speaker and yeah it's pretty good to be honest, definitely bang for your buck.","timestamp":"Reviewed in the United States November 8, 2021","profile_id":"AFKQYXJW4PLKSXXPQFL57MIIA24A","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"RR9AVJHGRHE0W","title":"5.0 out of 5 stars Simply fantastic","author":"GB","rating":5,"content":"I expected this to sound pretty good, based on reviews from various places...certainly better than the less-expensive bluetooth speakers I've had. I'm a lifelong musician...been around music of all types most of my life. I am blown away by the fidelity of this speaker. My musical tastes are all over the map. Everything is game, and this speaker handles it all impressively. From Coltrane to the Stones, and everything between.Out of the box, the frequency response is flat. That is by design, to give you a reference point for shaping the sound the way you want. To appreciate the capabilities of this speaker you MUST download the Soundcore app, where you can adjust the EQ to whatever suits you. There are several presets in the app, but the real difference-maker is in the \"custom\" setting, which gives you 9 bands of EQ to fiddle with. If I had to describe this speaker's performance in one word, that word would be \"balanced\". If you're into bass-dominant listening (rap/hip-hop), you'll probably be better served by one of the boom-box models. This speaker offers rich, full and natural sound across the frequency spectrum, with plenty of volume as well.Punches well above its weight class. I'll grab another one when they're on sale again to have in other areas of the house. Highly recommended.","timestamp":"Reviewed in the United States November 29, 2023","profile_id":"AFAPKGR2EPFYDEZHRBDJRU2BYBNA","is_verified":true,"helpful_count":6,"product_attributes":"Color: Black"},{"id":"R2P7QEIOOGPNOR","title":"5.0 out of 5 stars Buy it.","author":"P","rating":5,"content":"As many other reviews have stated this is an almost perfect, and to some perfect, bluetooth speaker. I waited a few weeks before leaving a review to be sure, but I love it. The sound quality is excellent, as many others have stated this thing gets LOUD. Use the custom EQ for the best sound (I'm a rap fan so as a bass heavy genre it handles it perfectly!) Noticed minor clipping on certain songs (\"Top Back\" by T.I. for anyone who knows it as an example) just go down one notch from max and it's good. Definitely plan on buying a second to link together and my ONLY gripe is that it won't accept more lol. It CAN play while charging if not charging from a fully dead battery, it will cut off until it reaches a certain level. Haven't played it constantly so I can't speak to the total battery life just yet, however, I've used it intermittently for a couple hours for an entire week and it lasted with no problems so I imagine a full day at the beach would be fine. The update solved the issues in the comments on the EQ saving and mine saved right out the box. Outside of that, it's done everything I needed and more, can't wait until we can get back out and I can use it for it's intended purpose! Stop reading reviews. I read over 400 on various competing products and watched hours of YouTube videos so I got you on the research lol this is the one.Update: 12/21/21: I've owned this speaker for about 2 years now so I have a full understanding of it's quirks and features and everything in between. My original statement still stands..... BUY IT. I have since bought another and saw someone else mention they are running more than 2 so please share how because I would have one in every room of the house if I could. These have been everywhere. Thrown in the back of the truck on beach day and plays LOUD the entire day. When we hit the beach it's from 10-5 and they last the entire time. I have received so many compliments from other people on the quality of sound from such a small speaker and the speakers themselves have been all in sand, had water on them and continue running without a hiccup. Someone mentioned it being \"invisible to bluetooth\" not sure what they were doing but I can hook these up to anything (and have)... Phones, my laptop, my surface, my TV, everything. I've been checking for an updated version but honestly if it's not broke then don't fix it and these just work perfectly. And for $100 you can't beat it.","timestamp":"Reviewed in the United States April 16, 2020","profile_id":"AEC26SEGHBLWMR3AKC3OZZJYZZ5A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R9HQLRYIIZXTK","title":"5.0 out of 5 stars One of my favorite bluetooth speakers","author":"Roger L. Calvert","rating":5,"content":"I've had a lot of Bluetooth speakers: Sony, JBL, Creative, Logitech, UE, Bose.....but I have to say I have become a true soundcore fan. Besides this speaker, I also have the Motion Boom and the Motion Boom Plus. They all sound phenomenal. In my opinion, Soundcore gives you the most bang for your buck. The Motion + has become one of my favorite speakers, so much so that I just ordered this one so I could hook them up in stereo. Unfortunately when I got this speaker I couldn't get them to connect even though I followed the instructions. I was informed by Soundcore that this was because my previous model had an older chip and firmware and they were not compatible. I was prepared to send this one back but the Soundcore rep went above and beyond to help by letting me trade my older version for a new one. WOW! Great customer service. I am certainly a Soundcore fan for life now. I'm a retired audiophile. I've had a lot of expensive stereo equipment in the past with outboard dacs and the whole nine yards. You're not gonna get audiophile quality in a Bluetooth speaker, especially one for a $100 or less. However, what you will get in this speaker is a lot of quality sound for the price. It's definitely worthy of the near 5 star rating. It's a very well rounded speaker with excellent highs, good mids and more than adequate bass. The app is user friendly and helpful in tailoring the sound to your liking. You can add another for stereo and the customer service is, what can I say, excellent. Overall, it's a speaker well worth the money.","timestamp":"Reviewed in the United States June 19, 2023","profile_id":"AHNDQTU7F7JAYMHHRQ2OWALC42SA","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"R1MHPUA3K7BQ0P","title":"5.0 out of 5 stars Great sound, ultra convenient.","author":"Marcel","rating":5,"content":"I can’t say enough good things about this. I use it daily for music & anything else I’m playing on my phone or laptop. Took it to a hotel & it filled the room at around half volume. Bass & clarity are top notch. Also, more than one device can connect to it at once.","timestamp":"Reviewed in the United States June 1, 2024","profile_id":"AFSUIMEZBATNTKR2NG6I4TRQ2QDA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1ZXK68ZNPIPQ6","title":"4.0 out of 5 stars Great speaker, Bluetooth range is average","author":"Ryan Hunt","rating":4,"content":"Speaker is quality made and sounds great. Nice and loud with great quality. Bluetooth range is average but not great.","timestamp":"Reviewed in the United States May 5, 2024","profile_id":"AEOS4IVWOVCLJJ7UCSABJA5QZ2GQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"RUD24ZJ8F7ALN","title":"5.0 out of 5 stars Best Bluetooth Speaker I have Heard and Amazing under $100","author":"Science Guy","rating":5,"content":"Incredible battery life. Deep bass and plenty of volume. Easy to connect!","timestamp":"Reviewed in the United States June 27, 2024","profile_id":"AFHIOWSFR6RX4WQ4NLVUD3OWV4TA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:29","page":8,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=8","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=9","asin":"B07P39MLKH","page":9,"pages":731,"reviews":[{"id":"RLNPR7VGAQIP3","title":"5.0 out of 5 stars WHOA! Yes, it's all that!","author":"G. Curran","rating":5,"content":"I have an older Altec Lansing BT speaker. It's small, I've had it for a few years, it works pretty well for what it is. I probably paid $60 for it when I got it.I wanted something better, with more bass, better sounds. I don't need multiple speaker set up, or anything like that. I'm a musician, well, keyboard player, and my standard of reference is a pair of KRK Rokit RP-5s. They are very nice, low end monitoring speakers and I drive them from a high end D/A converter. The sound, for me, at 64 years of age, is all that I need.The Soundcore Motion + blew me away with it's sound. I would say that it rivals the RP-5s in clarity and sound discrimination. I did a lot of 'research' on new BT speaker, meaning I watches some YouTube videos, and the Soundcore Motion + always seemed to come out near the top of the pack. I can see why.If you want clear, crisp highs, a wonderful midrange and bass that is clear and accurate (I'm not talking window rattling bass, but bass that sounds like acoustic bass should), then this really is the speaker for you.The free downloadable app for your phone gives you custom EQ capabilities, plus there's an aux in for laptops and such that may not use BT.I am truly impressed by this. I'm also further impressed that by an additional $10 shipping cost, I ordered at 11 a.m. and had the unit here at 6 p.m. The only thing that would have made it any better was if it had gotten here 30 minutes sooner, since I was going out to a party, and it would have worked wonders there.So, if you're on the fence about this speaker, spend the $105 for it. I haven't listened to the Bose or the Sony or the JBL speakers, all of which are probably good speakers, but in the $100 range, I don't think you're going to do too much better than this speaker! Buy it! Tell 'em I sent ya!","timestamp":"Reviewed in the United States October 17, 2021","profile_id":"AFUQQUEWDCC6LVACFML6P7UVHVWA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R152BTEUFK4UBY","title":"5.0 out of 5 stars *****************PLEASE READ UPDATED REVIEW*******************","author":"BBB","rating":5,"content":"Read the reviews so I took the plunge. I wanted to like it a lot but the sound quality left too much to be desire for my taste. Even with the app, which allows you to make various adjustments, I could never really fine-tune to my liking. We sent it back and purchased our second Beats Pill +. To each his own.-----------------------------------------------------UPDATE BELOW-------------------------------------------------First The Good: Anker Soundcore Motion+ Bluetooth Speaker delivers excellent sound for the money on a variety of music genres. But I will say that in my specific case I did need to use the EQ, available as an app download, to get my sound to a level that would make this beautiful looking speaker shine. Now about that app,-Once the Anker Soundcore Motion+ Bluetooth Speaker is charged you will want to set up the previously mentioned custom EQ. To do that you’ll have to download the app. To use the Ankers Soundcore App, it does seem to want a lot of feedback which I’m sure is for future product enhancements. The decision is yours to use it or not. I had no problem.The longer we have used the speaker the more we enjoy the fun that comes with it. From its portable design, sturdy and solid craftsmanship, it’s built to last. One thing I enjoy is the power button glows white while powered and changes to a blinking red when the battery is low. In this mode, it automatically plays at a reduced volume until plugged in. Once plugged into a charger via the USB-C port, Anker Soundcore Motion+ Bluetooth Speaker increases in volume and continues to play while charging. Nice touch!I was able to get all of my eclectic music to sound very fine-tuned. I especially loved how I could Bluetooth to my TV and have my own personal speaker as to not disturb the neighbors on those late nights.My one issue is that at higher volumes it did tend to distort and I could not find a fix but with many EQ settings at my disposal we were able to come to a happy experience and satisfied with the sound.This is a solid speaker with the potential to sit alongside the BEATS PILL+(which I own) UE BOOMBOX(which I own)and in my opinion, is much better than the Bose SoundLink Mini II Bluetooth Speaker. (which I own)Lastly, the speaker gets 4 stars for quality and price but because Anker is invested in providing outstanding products and customer service then my all-around score is a solid 5.Great Fathers Day gift people. I’d love another for Fathers Day!","timestamp":"Reviewed in the United States May 27, 2020","profile_id":"AG2QXXN2G34QUSJODDKYNA52EK4Q","is_verified":true,"helpful_count":1,"product_attributes":"Color: Red"},{"id":"R2GV6DGP4DSR93","title":"5.0 out of 5 stars Good sound.","author":"Johnny Dee","rating":5,"content":"This unit has good sound for the size and price. I would prefer that the buttons on the top be in a more contrasting color. It is black on black and hard to see. Otherwise, I can't complain. Has an external jack for if you want to plug something into it like a television. That is an addition to the blue. Good company with a good reputation.","timestamp":"Reviewed in the United States May 19, 2024","profile_id":"AHJRSBK5IM366SBFC6363RJNQZXQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R2SC66DMOUNCBC","title":"5.0 out of 5 stars Anker customer support reached out, perfectly resolved!","author":"Matthew","rating":5,"content":"Rewrite from an earlier review as Anker has reached out to me. But they did NOT ask me to edit or change my review. This is all my own doing (just a heads up).Initially, I had purchased this product due to all the stellar reviews from various audio reviewers. Item arrives and there is a terrible static, almost like a grounding wire was knocked loose, I'm not sure. Imagine turning on a CRT tv in the middle of the night at full volume with no signal. I had used the motion+ in a different system, different set-up, even had some friends of mine try a hand at it just to make sure it wasnt me.But it happens, there's bound to be a dud every so often. I returned the unit for a replacement. And that replacement, same exact thing. Same steps to troubleshoot but at that point, I was done with the product. I do have more anker products than I can count, they make some great hardware, but the motion+ in particular I figured I was done with. Let other people enjoy it, not worth the headache.I left an earlier review expressing as much and sure enough, a customer rep from Anker actually reached out to me. I like most people have grown very cynical when it comes to dealing with companies standing by their products and actually honoring their warranties BUT the entire experience has more than made up for the earlier issues. I'm still waiting on the replacement to arrive but until then, 5/5 at least for the customer service experience, and that's saying a lot these days.","timestamp":"Reviewed in the United States July 21, 2023","profile_id":"AHHH34PFU33JE5K5W5SPHHUD5IWA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R20S2E8H61JEQ6","title":"5.0 out of 5 stars Great bang for your buck","author":"RP","rating":5,"content":"Update: Love the Soundcore Motion+ speaker so much I bought a second one. 😄 They work great as a stereo pair.---I was looking for a bt speaker for under my monitor, mainly to use with my computer, but also something portable that I could carry around the house and to the pool for better sound than my phone speaker. Sometimes, I just don't want to have to wear earbuds.The Soundcore Motion+ did not disappoint. It's a solid performer, has punchy bass, and you can tune the EQ to your heart's content via the app. The speaker has heft, thanks to the 12-hour battery life. It feels like a quality product. It also has USB-C charging, which is a must in 2023.If I were to nit about anything, if you hold the speaker up to your ear, you can hear a distinct hiss when nothing's playing. However, practically speaking, this doesn't bother me since, at listening distance (arm's length or longer), you can't hear the hiss at all.If they go on sale again, I might buy another to pair it up.","timestamp":"Reviewed in the United States December 25, 2023","profile_id":"AGZFQCCRUPOIOUPZ2DRK6Z5WBOJA","is_verified":true,"helpful_count":5,"product_attributes":"Color: Black"},{"id":"R250K91U05W3UX","title":"3.0 out of 5 stars Great frequency response for size","author":"Pat","rating":3,"content":"Update: Bluetooth on this speaker is the worst. It takes precedence over a connection. Also my husband keeps turning off the connection in the app and if he even touches his phone, even having turned off the connection, it automatically overrides my own Bluetooth connection while I'm in the middle of playing a song. He unpaired permanently and hopefully this will be fixed. But there's the problem of my laptop. I'll be sure to unpair that permanently too. Never pair this thing with more than one device. It blows, because I need to use it with my laptop and my phone for original music projects I'm working on. The app doesn't do anything to help. Bluetooth just needs to die. However, I've not run into this with my little JBL speaker. It will not allow anyone to connect to it when it's currently paired with something else.Of course, my stupid phone has no mini jack output so I can't give up on Bluetooth altogether.Previous reviewI got this as a portable speaker to bring to music composition lessons. I'm composing music on the computer (hobby only) and it was hard to hear the lowest frequency instruments (cello, contrabass so far) on my JBL clip speaker. This isn't as good as studio monitor speakers, but so much more portable. And there's an equalizer in the app.I work on music in a casual hobby band too, and this will be much easier for me to hear the instruments, particularly the bass, in tracks they send me.I usually use very large, high-quality speakers for music listening but don't consider myself an audiophile. This is a Bluetooth speaker that's intended to be a portable convenience and has enough bass that you can hear the bass line loud and clear. The sound overall is crisp and pleasing. If I want the best, I'm not going to get that from a speaker I can put in a tote bag. For about $100, this totable speaker is honestly amazing.","timestamp":"Reviewed in the United States September 29, 2023","profile_id":"AHQ4HD6B6SKRYX4ON5PYMWBSTLTQ","is_verified":true,"helpful_count":4,"product_attributes":"Color: Black"},{"id":"RD2VLMG13DVIZ","title":"5.0 out of 5 stars Good Speaker Quality, but HUGE drawback","author":"Michael O'Donnell","rating":5,"content":"I bought one last year and have enjoyed using it. Good value quality for under $100. However, I recently bought the same model in order to create a stereo pair of speakers for a projector setup. When I received the new speaker I tried pairing the speakers together and couldn't get it for the life of me. I contacted Soundcore customer support and they informed me that even though they have the same model name and number, that I bought a newer version that CANNOT pair with the \"old\" version and that the old version could not be upgraded to pair with the \"new\" version. I think it is absolutely ridiculous that two speakers that are the same model cannot pair together even though that is an advertised feature. That is something that should be clearly stated as I now have to go through the hassle of returning it and wasted an hour of my life trying to get the speakers to pair. Majorly disappointed.UPDATE:Worked with Anker customer support and they were able to send me a new one that works. Great customer support experience!","timestamp":"Reviewed in the United States December 9, 2023","profile_id":"AFXHPAP6A4ZDG3JV23QBMP3U33QA","is_verified":true,"helpful_count":3,"product_attributes":"Color: Black"},{"id":"R30CETOJIZVBRA","title":"4.0 out of 5 stars Decent speaker that could use some design updates","author":"Nick Cunningham","rating":4,"content":"This is probably your best option at this price point in the \"large but still somewhat packable speaker\" market. The speaker is slightly larger than a 20 oz. soda bottle laid flat, but much heavier; you could pack this in a suitcase but it's probably going to take up too much room in a carry on or backpack unless you aren't bringing much else. It'll probably do fine in a bag to take to the beach or a cookout. It produces enough clear sound to fill large rooms easily and sounds good with the bass boost activated (and not great without it).I'm docking one star because in an effort to be sleek (and waterproof), Anker sacrificed some ease of use with the button layout. As you can see in the picture above, there are five buttons on the top of the speaker. In short, the buttons are confusing, mushy, and easily show wear.Two of the buttons you are likely using most often, the volume buttons, are the 2nd and 5th buttons in the layout. If you aren't looking directly at the speaker, it's very easy to accidentally hit the Bluetooth pairing button when attempting to turn the volume up, or to hit the center button when trying to turn the volume down. The center button is just the logo, which gives no indication to what it actually does (multifunction play/pause/skip), which is fine if you own the speaker but not great if you ask someone else to change songs. Finally, the buttons have that mushy, silicone feel that makes you wonder if you actually activated it, and despite attempting to clean them, they look very worn after only a few presses. I know that some of this was probably done to improve the waterproofing of the speaker. I have to wonder who the audience is supposed to be, then. Are people taking these into the ocean? Or into their swimming pools at home? Or dancing in the rain? It just doesn't feel like a common enough use case to warrant the trade off.These small-ish quibbles aside, I've enjoyed the speaker and I think it's still the best option at this price point. I just think if could be even better.","timestamp":"Reviewed in the United States March 26, 2021","profile_id":"AE5NTZ7O2YOXZWMEJINA5PB7YMBA","is_verified":true,"product_attributes":"Color: Black"},{"id":"R20MPMFGI8AOVG","title":"5.0 out of 5 stars Not what I expected - returned the speaker","author":"eimajine","rating":5,"content":"I wrote the following review and Soundcore's customer service was so amazing, they offered to accept my return for a full refund. Not everyone likes the same sound and this wasn't for me, but I would not hesitate to buy from them again based on this experience.Original review- I was upgrading from a cheaper speaker and this one got good reviews. However, I don't think the sound is much better than my old one - it doesn't feel very full, it's kind of tinny, I would have returned it but I messed up the box when I opened it and felt guilty about it. I waited so long to purchase and researched so much, I'm very disappointed. The operation is great - good bluetooth connection and the app allows you to make changes to the sound profile if that's something you want to do. I did, but it didn't help me to like the speaker any better.","timestamp":"Reviewed in the United States January 22, 2024","profile_id":"AEIRWAPZ4UN3IJKS6CE5YETNWV2A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"RT0JXSY1JD7VV","title":"5.0 out of 5 stars If you can, buy two motion+ the TWS is awesome!!","author":"Beatrice C.","rating":5,"content":"I originally purchased one red motion+ like 2 years ago. The sound was really great with no real complaints except something was missing… separate channel stereo sound. So I recently decided to purchase a second motion + but the 2 motion+ had different hardware and firmware so they weren’t compatible. I checked with Anker’s excellent customer service and they confirmed that was the issue. So I had to purchase a 2nd new one so they would pair together correctly. The sound is truly incredible and its worth the extra money I had to pay to achieve it. I can use the old motion+ in a different room as it’s still going strong.","timestamp":"Reviewed in the United States March 3, 2024","profile_id":"AFCOS5XNBKWX23JWJWLNBNZIAVFA","is_verified":true,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:32","page":9,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=9","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""},{"content":{"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=10","asin":"B07P39MLKH","page":10,"pages":1,"reviews":[{"id":"RUM82JV4JIT3Z","title":"5.0 out of 5 stars Excellent quality speakers for the money","author":"Scott W.","rating":5,"content":"I bought 4 Motion+ speakers (to configure in 2 stereo pairs for my office and living room) to replace my Sonos Play1 and Play3 speakers after Sonos once again screwed over its users with personal music libraries.The sound quality and dynamic range of the speakers is excellent. While not quite as good as the Sonos speakers, for the $$ these speakers nail the sound. Pairing 2 speakers in a stereo pair is very easy.The speakers have multiple sound presets and a 9-band EQ configurable via the mobile app. (NOTE: I also bought the Space Q45 NC headphones and used the HearID recommended 8-band EQ settings for configuring the Motion+ EQ.) I absolutely love the sound from the speakers with my custom EQ settings for Rock, Blues, and Metal.I can't speak to the battery life because I bought Anker USB power adapters and all 4 speakers are connected to power 100% of the time.The mobile app is serviceable, but short on extra features. For instance, the app only tracks one pair of the Motion+ speaker pairs at a time. The app has to disconnect from one set to connect to another. Also there is no L/R fader function in the app to adjust the balance between the paired speakers. I have submitted requests to Anker Soundcore support to add features to remember devices and customize the names, and to add the fader feature.Overall, I am extremely happy with my purchase of the Motion+ speakers.","timestamp":"Reviewed in the United States July 4, 2023","profile_id":"AF362OS3S3ZXUTFMGPOFXHLFFDGA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R1EVDVHAQA9P72","title":"5.0 out of 5 stars Near zero lag watching YouTube on my iPad","author":"Fenix8452","rating":5,"content":"I got this for basically two reasons: to watch YouTube/Hulu/Netflix on my 2021 iPad, and to have a decent speaker to quickly set up in a garage for when I have people over to listen to music.I am extremely happy with the streaming video synchronization. While watching almost anything, I cannot pick up any delay in the sound vs peoples lips on screen, a constant problem I've had with earlier Bluetooth devices. I've had identical experiences with my Android phone as well. However my devices are fairly up to date on the Bluetooth standards, and that is likely why they work so well. Experiences will vary if you have a device with older bluetooth equipment in them.I have had no problems with the app, and dialing in the sound for my music. The presets are ok, but really only ok. But after some minor tweaking, it really is as good as advertised. And it can get loud enough for me. When I crank it all the way up, I have to really try to be heard over it, so if you need it loud I think this does a very serviceable job.I haven't run it down to empty yet, but I've used it for numerous hours in a row without issue. Also it charges quickly, and works fine to run while being charged if being used at home like mine is.","timestamp":"Reviewed in the United States July 18, 2023","profile_id":"AEKEEDOXMMHDUNJKVT4CPE2FSRBA","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"},{"id":"R2MHURAGPDLZBZ","title":"4.0 out of 5 stars Good value for the Money","author":"dave","rating":4,"content":"Bought for my shop and it checks all boxes I was looking for. Bought an Oontz Angle 3 first and found it to be junk. Returned and tried the Soundcore for more money and it did the trick. Great battery life and can turn up the volume with little distortion.","timestamp":"Reviewed in the United States February 18, 2024","profile_id":"AFWTK5B7G3DGLEVLE2N2BOWCR76Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R1XZ4IAZL4VW2A","title":"4.0 out of 5 stars Soundly a superb Bluetooth speaker","author":"D.W. Scott","rating":4,"content":"Quality, Great Sound for the price point...not as biG of a name as some others...yet as good in sound!","timestamp":"Reviewed in the United States April 6, 2024","profile_id":"AFI33YIUFVPNBIMKMC6HHBYMB5TQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R13LBUHRSCD1IP","title":"4.0 out of 5 stars Sounds Better The Longer I've Had It!","author":"DrNik","rating":4,"content":"Update 7/15/2021:Perhaps there was a break-in period on this unit because the longer I've had it the better it sounds even at higher volumes! Since everyone's hearing is different, I really recommend using the Soundcore app on your phone and do Custom EQ settings that sound right to you. I didn't like any of the EQ Presets. So I have officially changed my mind and increased my rating from 3 to 4 Stars. I think this was worth the price and would definitely recommend this BT Speaker.Original From Feb. 2021:I'm a bit disappointed for the price considering it supposed to be 30W of power. Thought I would take the chance since it has separate left and right mid-range and tweeter drivers. There are so many positive reviews and youtube videos comparing this to the larger JBL Charge 4 and others. In my opinion this doesn't sound as good or pack the punch of the smaller JBL Flip 4 or 5. I put the Soundcore app on my phone, tried the BassUp and all EQ Presets. It sounded better with my own Custom EQ settings.It sounds pretty good up to half volume. Going above that and there is distortion in the mid-range and treble, and gets worse the higher it goes. The max volume is tied to my Bluetooth device, and once the max is reached on the device then pressing the volume up on the speaker has no effect. On other BT speakers like JBL & Sony I can increase the volume more on the speakers after the BT sources is at max volume.Listening to quality music is very important to me and 98% of my music library is full CD quality FLAC files. Either I got a defective unit or Anker is putting out a lot of dishonest review and videos. I'm thinking about returning this and going with the JBL Flip 5 even though it has only 1 active Transducer driver. Anker had a good idea here for a compact BT speaker, but it doesn't live up to all the hype.","timestamp":"Reviewed in the United States February 9, 2021","profile_id":"AEOUB25MPZ4HGZQTKKUXWTPU5JLQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R3V1KUTDQGYYSQ","title":"4.0 out of 5 stars great sound but wish it could go louder","author":"Yeezy","rating":4,"content":"i was looking for a portable speaker that could be used outdoor for sports or social gatherings but also had enough sound quality for indoor listening.the speakers had a neutral sound signature very similar to sennheiser. u can hear layers of the instrumentals and vocals. highs came out clear without distortion even at high volume. bass didn’t sound synthetic but i would say is kind of missing particularly lows and u don’t feel any punch from the bass.although highs come out clear it leaves u wanting more as u max out the volume to really fill the space and to jam out.overall a great quality sounding speaker. it just wasn’t the sound i was looking for","timestamp":"Reviewed in the United States October 29, 2023","profile_id":"AEWK7ZCJQGQY3CF2Z5NATYGAKQNQ","is_verified":true,"product_attributes":"Color: Black"},{"id":"R37HUI3EPME03Y","title":"5.0 out of 5 stars Solidly built, great sound, in a perfect package","author":"Sean Mckenzie","rating":5,"content":"I love this thing! First off, I think it looks good. I like that one can see the speakers through the grill, while feeling confident that said speakers are well protected, since themesh is metal not fabric. This will make wiping it down easier, too. I hate fabric speaker covers, they're dust magnets and a pain to clean.The sound: Remarkable! Especially for such a small sized unit. Honestly, it looks bigger in the photos, and it's the perfect size for any shelf or table. The sound is so crisp and clear, yet you can honestly feel the bass, and that's not even with the Bass boost enabled. The Soundcore app is easy to use and gives you access to an EQ mixer, as well as a range of presets. I use the EQ mixer, and you can clearly hear the difference as you adjust. It's also clearly well made. The unit feels hella solid and it's surprisingly heavy, which is a good thing! You're not likely to find great quality sound and quality construction in a plastic, lightweight speaker. This bad boy has a metal body and feels solid AF.My only knock would be that the control buttons on top of the unit are unlit, and the same color (black) as the rest of the unit, making it difficult to see which button is which. But this is really pretty minor, given that most of us will use the soundcore app or our music app, to adjust the controls instead of manually with the hard to read buttons. Also, once you learn which does what, it's a non-issue.I highly recommend this speaker for anyone who wants a high quality portable speaker with excellent sound-for-size/price. You cannot go wrong, and Anker is a quality company with excellent customer service, so you can buy with confidence.","timestamp":"Reviewed in the United States January 25, 2022","profile_id":"AHQ5345MK2FWM32RKP67X3GAQW2A","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R3T2WS82BPF7A3","title":"4.0 out of 5 stars A larger, louder version of the Boost.","author":"Dalton Boehm","rating":4,"content":"I ordered this Bluetooth speaker to replace my Anker Soundcore Boost that served me well for 3 years as a speaker for my PC.As a higher priced device, I was hoping that it would be an improvement in sound quality over my former speaker. But it’s about the same, maybe even a little worse. The speaker sounds pretty flat out of the box and you need to use the Soundcore app on your phone to EQ it for a richer, wider sound. This EQ doesn’t stay when you disconnect from your phone and use a computer (there’s no soundcore app for windows.) overall the default sound is acceptable but I’m sure there’s speakers out there that sound better for $100 (I got the speaker for about $80 with a sale.)The speaker is also way bigger and heavier than the Boost. The boost is pretty easy to pack in a camping bag or backpack but the Motion is a bit unwieldy and awkward.The upside for this is that the battery should be much better and it is notably louder, but those two perks are irrelevant for my use case and the Boost was loud enough with a good enough battery.If you’re considering this speaker, I’d go for the Soundcore Boost instead.","timestamp":"Reviewed in the United States March 17, 2023","profile_id":"AGDCVTOYPW4DSRPI3477OGIPO2QA","is_verified":true,"helpful_count":2,"product_attributes":"Color: Black"},{"id":"R3BQP3IYNPH8Z8","title":"4.0 out of 5 stars Good speaker but doesn’t stereo pair with last year’s model.","author":"BAJ","rating":4,"content":"I liked the sound of this speaker and the accompanying app. I bought one last July and have enjoyed it. To my ears it sounds better, even using the supported, compressed AAC Bluetooth and SBC codecs, with my iOS (iPhone and IPad) and Amazon Fire tablet 10+ devices, than my Sonos Roam speaker sounds via lossless (eg with Amazon HD Music) using Sonos Wi-Fi app or airplay2.I just bought another one yesterday, solely to add “stereo pairing” and it was on sale. However, I couldn’t get this feature to work.After trying all the trouble shooting steps on their website, I called Soundcore. They said that their engineers changed the Bluetooth chip on the newer speaker version and that’s why my 2 speakers wouldn’t pair.Fortunately, I was just a few days within my warranty and they told me to send the older one back and that they would ship out a replacement with the new chipset.Hopefully, the stereo pairing will work once I receive it. I knocked off one star for this issue.","timestamp":"Reviewed in the United States June 21, 2023","profile_id":"AFTJK32PAEEZB6SS2EOKX3VCSF7Q","is_verified":true,"product_attributes":"Color: Black"},{"id":"R25IX1W1BN8S6L","title":"4.0 out of 5 stars Hit or miss for music, excellent for podcasts. Missing features for the price point.","author":"David Doria","rating":4,"content":"Bought this as an external laptop speaker for when I'm away from home. Tried a couple of tunes right away. Don't Panic by Coldplay sounded great. Some punk songs from NOFX sounded quite muddy. Like I think any average person without a particularly good ear for sound would notice the quality issue.But in reality, I'll mostly use this for stuff like listening to some podcasts or gaming at night before I pass out. Vocals in my fave YouTuber channels sound excellent...arguably even better than my desktop speakers in some ways. Gaming is somewhere between my laptop and desktop speakers, but certainly better than the latter so they serve their purpose as I'm not going to lug around my desktop speakers.For the price should have come with a case, and also a wall charger and USB cord. Comes with none of these.Also a bit of a fingerprint magnet though generally looks and feels sleek.Deducted a star for hit or miss sound quality, and another star for missing features for the price point.EDIT: Apparently supposed to come with a charging cord. The company did contact me separately and send one with an apology credit. Updating to 4 stars. Still think a case should be included for the price, being mindful of the sound quality.","timestamp":"Reviewed in the United States April 2, 2023","profile_id":"AFHC6PZZYIPGRCYKCZBWAXJ26X7A","is_verified":true,"helpful_count":1,"product_attributes":"Color: Black"}],"page_type":"Question","asin_in_url":"B07P39MLKH","product_name":"Soundcore Motion+ Bluetooth Speaker with Hi-Res 30W Audio","parse_status_code":12000},"created_at":"2024-09-11 22:41:19","updated_at":"2024-09-11 22:41:33","page":10,"url":"https://www.amazon.com/product-reviews/B07P39MLKH?reviewerType=all_reviews&pageNumber=10","job_id":"7239764978503272449","is_render_forced":false,"status_code":200,"parser_type":""}],"job":{"callback_url":null,"client_id":18306,"context":[{"key":"force_headers","value":null},{"key":"force_cookies","value":false},{"key":"hc_policy","value":null},{"key":"check_empty_geo","value":null},{"key":"safe_search","value":true}],"created_at":"2024-09-11 22:41:19","domain":"com","geo_location":null,"id":"7239764978503272449","limit":10,"locale":null,"pages":20,"parse":true,"parser_type":null,"parsing_instructions":null,"browser_instructions":null,"render":null,"url":null,"query":"B07P39MLKH","source":"amazon_reviews","start_page":1,"status":"done","storage_type":null,"storage_url":null,"subdomain":"www","content_encoding":"utf-8","updated_at":"2024-09-11 22:41:33","user_agent_type":"desktop","session_info":null,"statuses":[],"client_notes":null,"_links":[{"rel":"self","href":"http://data.oxylabs.io/v1/queries/7239764978503272449","method":"GET"},{"rel":"results","href":"http://data.oxylabs.io/v1/queries/7239764978503272449/results","method":"GET"},{"rel":"results-content","href_list":["http://data.oxylabs.io/v1/queries/7239764978503272449/results/1/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/2/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/3/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/4/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/5/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/6/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/7/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/8/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/9/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/10/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/11/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/12/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/13/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/14/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/15/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/16/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/17/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/18/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/19/content","http://data.oxylabs.io/v1/queries/7239764978503272449/results/20/content"],"method":"GET"},{"rel":"results-html","href":"http://data.oxylabs.io/v1/queries/7239764978503272449/results?type=raw","method":"GET"},{"rel":"results-content-html","href_list":["http://data.oxylabs.io/v1/queries/7239764978503272449/results/1/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/2/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/3/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/4/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/5/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/6/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/7/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/8/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/9/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/10/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/11/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/12/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/13/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/14/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/15/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/16/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/17/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/18/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/19/content?type=raw","http://data.oxylabs.io/v1/queries/7239764978503272449/results/20/content?type=raw"],"method":"GET"},{"rel":"results-parsed","href":"http://data.oxylabs.io/v1/queries/7239764978503272449/results?type=parsed","method":"GET"},{"rel":"results-content-parsed","href_list":["http://data.oxylabs.io/v1/queries/7239764978503272449/results/1/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/2/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/3/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/4/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/5/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/6/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/7/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/8/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/9/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/10/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/11/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/12/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/13/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/14/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/15/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/16/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/17/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/18/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/19/content?type=parsed","http://data.oxylabs.io/v1/queries/7239764978503272449/results/20/content?type=parsed"],"method":"GET"}]}}